Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0xe7a (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 29 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x2430): GNU C17 13.3.1 20240614 -mcpu=cortex-m7 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fpv5 -g3 -O0 -std=gnu17 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x10ea): C:/Users/hans-/Nextcloud/Documents/DHBW/Labor/Labor_HWNahesProg_Echtzeitsysteme/Semester4/Solution/libs/LibL6474/src/LibL6474x.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x11a): C:/Users/hans-/Nextcloud/Documents/DHBW/Labor/Labor_HWNahesProg_Echtzeitsysteme/Semester4/Solution/stepper/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <2b>   DW_AT_name        : (indirect string, offset: 0x116b): L6474x_State
    <2f>   DW_AT_encoding    : 7	(unsigned)
    <30>   DW_AT_byte_size   : 1
    <30>   DW_AT_type        : <0x53>
    <34>   DW_AT_decl_file   : 2
    <35>   DW_AT_decl_line   : 26
    <36>   DW_AT_decl_column : 14
    <36>   DW_AT_sibling     : <0x53>
 <2><3a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3b>   DW_AT_name        : (indirect string, offset: 0x2ad4): stRESET
    <3f>   DW_AT_const_value : 0
 <2><40>: Abbrev Number: 1 (DW_TAG_enumerator)
    <41>   DW_AT_name        : (indirect string, offset: 0x2935): stDISABLED
    <45>   DW_AT_const_value : 1
 <2><46>: Abbrev Number: 1 (DW_TAG_enumerator)
    <47>   DW_AT_name        : (indirect string, offset: 0x242): stENABLED
    <4b>   DW_AT_const_value : 2
 <2><4c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <4d>   DW_AT_name        : (indirect string, offset: 0x2a05): stINVALID
    <51>   DW_AT_const_value : 4
 <2><52>: Abbrev Number: 0
 <1><53>: Abbrev Number: 17 (DW_TAG_base_type)
    <54>   DW_AT_byte_size   : 1
    <55>   DW_AT_encoding    : 8	(unsigned char)
    <56>   DW_AT_name        : (indirect string, offset: 0x304a): unsigned char
 <1><5a>: Abbrev Number: 13 (DW_TAG_typedef)
    <5b>   DW_AT_name        : (indirect string, offset: 0x2af2): L6474x_State_t
    <5f>   DW_AT_decl_file   : 2
    <60>   DW_AT_decl_line   : 54
    <61>   DW_AT_decl_column : 3
    <61>   DW_AT_type        : <0x2a>
 <1><65>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <66>   DW_AT_name        : (indirect string, offset: 0xebb): L6474x_StepMode
    <6a>   DW_AT_encoding    : 7	(unsigned)
    <6b>   DW_AT_byte_size   : 1
    <6b>   DW_AT_type        : <0x53>
    <6f>   DW_AT_decl_file   : 2
    <70>   DW_AT_decl_line   : 63
    <71>   DW_AT_decl_column : 14
    <71>   DW_AT_sibling     : <0x94>
 <2><75>: Abbrev Number: 1 (DW_TAG_enumerator)
    <76>   DW_AT_name        : (indirect string, offset: 0x14dc): smFULL
    <7a>   DW_AT_const_value : 0
 <2><7b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7c>   DW_AT_name        : (indirect string, offset: 0x216a): smHALF
    <80>   DW_AT_const_value : 1
 <2><81>: Abbrev Number: 1 (DW_TAG_enumerator)
    <82>   DW_AT_name        : (indirect string, offset: 0x3ad1): smMICRO4
    <86>   DW_AT_const_value : 2
 <2><87>: Abbrev Number: 1 (DW_TAG_enumerator)
    <88>   DW_AT_name        : (indirect string, offset: 0x2782): smMICRO8
    <8c>   DW_AT_const_value : 3
 <2><8d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8e>   DW_AT_name        : (indirect string, offset: 0x16b8): smMICRO16
    <92>   DW_AT_const_value : 4
 <2><93>: Abbrev Number: 0
 <1><94>: Abbrev Number: 13 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x2f94): L6474x_StepMode_t
    <99>   DW_AT_decl_file   : 2
    <9a>   DW_AT_decl_line   : 91
    <9b>   DW_AT_decl_column : 3
    <9b>   DW_AT_type        : <0x65>
 <1><9f>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <a0>   DW_AT_name        : (indirect string, offset: 0x1ea5): L6474x_ErrorCode
    <a4>   DW_AT_encoding    : 5	(signed)
    <a5>   DW_AT_byte_size   : 1
    <a5>   DW_AT_type        : <0xe6>
    <a9>   DW_AT_decl_file   : 2
    <aa>   DW_AT_decl_line   : 116
    <ab>   DW_AT_decl_column : 14
    <ab>   DW_AT_sibling     : <0xe6>
 <2><af>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b0>   DW_AT_name        : (indirect string, offset: 0x322e): errcNONE
    <b4>   DW_AT_const_value : 0
 <2><b5>: Abbrev Number: 11 (DW_TAG_enumerator)
    <b6>   DW_AT_name        : (indirect string, offset: 0x533): errcINV_ARG
    <ba>   DW_AT_const_value : -1
 <2><bb>: Abbrev Number: 11 (DW_TAG_enumerator)
    <bc>   DW_AT_name        : (indirect string, offset: 0x2b1b): errcNULL_ARG
    <c0>   DW_AT_const_value : -2
 <2><c1>: Abbrev Number: 11 (DW_TAG_enumerator)
    <c2>   DW_AT_name        : (indirect string, offset: 0x2a1a): errcINV_STATE
    <c6>   DW_AT_const_value : -3
 <2><c7>: Abbrev Number: 11 (DW_TAG_enumerator)
    <c8>   DW_AT_name        : (indirect string, offset: 0x2ecd): errcINTERNAL
    <cc>   DW_AT_const_value : -4
 <2><cd>: Abbrev Number: 11 (DW_TAG_enumerator)
    <ce>   DW_AT_name        : (indirect string, offset: 0x14d0): errcLOCKING
    <d2>   DW_AT_const_value : -5
 <2><d3>: Abbrev Number: 11 (DW_TAG_enumerator)
    <d4>   DW_AT_name        : (indirect string, offset: 0x10b6): errcDEVICE_STATE
    <d8>   DW_AT_const_value : -6
 <2><d9>: Abbrev Number: 11 (DW_TAG_enumerator)
    <da>   DW_AT_name        : (indirect string, offset: 0x27fb): errcPENDING
    <de>   DW_AT_const_value : -7
 <2><df>: Abbrev Number: 11 (DW_TAG_enumerator)
    <e0>   DW_AT_name        : (indirect string, offset: 0x1a9e): errcFORBIDDEN
    <e4>   DW_AT_const_value : -8
 <2><e5>: Abbrev Number: 0
 <1><e6>: Abbrev Number: 17 (DW_TAG_base_type)
    <e7>   DW_AT_byte_size   : 1
    <e8>   DW_AT_encoding    : 6	(signed char)
    <e9>   DW_AT_name        : (indirect string, offset: 0x2e2f): signed char
 <1><ed>: Abbrev Number: 22 (DW_TAG_structure_type)
    <ee>   DW_AT_name        : (indirect string, offset: 0xb10): L6474_Status
    <f2>   DW_AT_byte_size   : 9
    <f3>   DW_AT_decl_file   : 2
    <f4>   DW_AT_decl_line   : 176
    <f5>   DW_AT_decl_column : 16
    <f6>   DW_AT_sibling     : <0x170>
 <2><fa>: Abbrev Number: 6 (DW_TAG_member)
    <fb>   DW_AT_name        : (indirect string, offset: 0x3b74): HIGHZ
    <ff>   DW_AT_decl_file   : 2
    <100>   DW_AT_decl_line   : 182
    <101>   DW_AT_decl_column : 16
    <102>   DW_AT_type        : <0x53>
    <106>   DW_AT_data_member_location: 0
 <2><107>: Abbrev Number: 23 (DW_TAG_member)
    <108>   DW_AT_name        : DIR
    <10c>   DW_AT_decl_file   : 2
    <10d>   DW_AT_decl_line   : 187
    <10e>   DW_AT_decl_column : 16
    <10f>   DW_AT_type        : <0x53>
    <113>   DW_AT_data_member_location: 1
 <2><114>: Abbrev Number: 6 (DW_TAG_member)
    <115>   DW_AT_name        : (indirect string, offset: 0x2030): NOTPERF_CMD
    <119>   DW_AT_decl_file   : 2
    <11a>   DW_AT_decl_line   : 192
    <11b>   DW_AT_decl_column : 16
    <11c>   DW_AT_type        : <0x53>
    <120>   DW_AT_data_member_location: 2
 <2><121>: Abbrev Number: 6 (DW_TAG_member)
    <122>   DW_AT_name        : (indirect string, offset: 0x327b): WRONG_CMD
    <126>   DW_AT_decl_file   : 2
    <127>   DW_AT_decl_line   : 197
    <128>   DW_AT_decl_column : 16
    <129>   DW_AT_type        : <0x53>
    <12d>   DW_AT_data_member_location: 3
 <2><12e>: Abbrev Number: 6 (DW_TAG_member)
    <12f>   DW_AT_name        : (indirect string, offset: 0x3276): UVLO
    <133>   DW_AT_decl_file   : 2
    <134>   DW_AT_decl_line   : 202
    <135>   DW_AT_decl_column : 16
    <136>   DW_AT_type        : <0x53>
    <13a>   DW_AT_data_member_location: 4
 <2><13b>: Abbrev Number: 6 (DW_TAG_member)
    <13c>   DW_AT_name        : (indirect string, offset: 0xe6a): TH_WARN
    <140>   DW_AT_decl_file   : 2
    <141>   DW_AT_decl_line   : 207
    <142>   DW_AT_decl_column : 16
    <143>   DW_AT_type        : <0x53>
    <147>   DW_AT_data_member_location: 5
 <2><148>: Abbrev Number: 6 (DW_TAG_member)
    <149>   DW_AT_name        : (indirect string, offset: 0x1c18): TH_SD
    <14d>   DW_AT_decl_file   : 2
    <14e>   DW_AT_decl_line   : 212
    <14f>   DW_AT_decl_column : 16
    <150>   DW_AT_type        : <0x53>
    <154>   DW_AT_data_member_location: 6
 <2><155>: Abbrev Number: 23 (DW_TAG_member)
    <156>   DW_AT_name        : OCD
    <15a>   DW_AT_decl_file   : 2
    <15b>   DW_AT_decl_line   : 217
    <15c>   DW_AT_decl_column : 16
    <15d>   DW_AT_type        : <0x53>
    <161>   DW_AT_data_member_location: 7
 <2><162>: Abbrev Number: 6 (DW_TAG_member)
    <163>   DW_AT_name        : (indirect string, offset: 0x80f39): ONGOING
    <167>   DW_AT_decl_file   : 2
    <168>   DW_AT_decl_line   : 222
    <169>   DW_AT_decl_column : 16
    <16a>   DW_AT_type        : <0x53>
    <16e>   DW_AT_data_member_location: 8
 <2><16f>: Abbrev Number: 0
 <1><170>: Abbrev Number: 13 (DW_TAG_typedef)
    <171>   DW_AT_name        : (indirect string, offset: 0x2eff): L6474_Status_t
    <175>   DW_AT_decl_file   : 2
    <176>   DW_AT_decl_line   : 223
    <177>   DW_AT_decl_column : 3
    <177>   DW_AT_type        : <0xed>
 <1><17b>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <17c>   DW_AT_name        : (indirect string, offset: 0x3992): L6474x_OCD_TH
    <180>   DW_AT_encoding    : 7	(unsigned)
    <181>   DW_AT_byte_size   : 1
    <181>   DW_AT_type        : <0x53>
    <185>   DW_AT_decl_file   : 2
    <186>   DW_AT_decl_line   : 231
    <187>   DW_AT_decl_column : 14
    <187>   DW_AT_sibling     : <0x1ec>
 <2><18b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <18c>   DW_AT_name        : (indirect string, offset: 0xc05): ocdth375mA
    <190>   DW_AT_const_value : 0
 <2><191>: Abbrev Number: 1 (DW_TAG_enumerator)
    <192>   DW_AT_name        : (indirect string, offset: 0x2a0f): ocdth750mA
    <196>   DW_AT_const_value : 1
 <2><197>: Abbrev Number: 1 (DW_TAG_enumerator)
    <198>   DW_AT_name        : (indirect string, offset: 0x2965): ocdth1125mA
    <19c>   DW_AT_const_value : 2
 <2><19d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <19e>   DW_AT_name        : (indirect string, offset: 0x9ab): ocdth1500mA
    <1a2>   DW_AT_const_value : 3
 <2><1a3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1a4>   DW_AT_name        : (indirect string, offset: 0x24c): ocdth1875mA
    <1a8>   DW_AT_const_value : 4
 <2><1a9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1aa>   DW_AT_name        : (indirect string, offset: 0x256e): ocdth2250mA
    <1ae>   DW_AT_const_value : 5
 <2><1af>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1b0>   DW_AT_name        : (indirect string, offset: 0x37d): ocdth2625mA
    <1b4>   DW_AT_const_value : 6
 <2><1b5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1b6>   DW_AT_name        : (indirect string, offset: 0x1c3): ocdth3000mA
    <1ba>   DW_AT_const_value : 7
 <2><1bb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1bc>   DW_AT_name        : (indirect string, offset: 0x3d60): ocdth3375mA
    <1c0>   DW_AT_const_value : 8
 <2><1c1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1c2>   DW_AT_name        : (indirect string, offset: 0x1e82): ocdth3750mA
    <1c6>   DW_AT_const_value : 9
 <2><1c7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1c8>   DW_AT_name        : (indirect string, offset: 0x1dc7): ocdth4125mA
    <1cc>   DW_AT_const_value : 10
 <2><1cd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1ce>   DW_AT_name        : (indirect string, offset: 0x25c5): ocdth4500mA
    <1d2>   DW_AT_const_value : 11
 <2><1d3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1d4>   DW_AT_name        : (indirect string, offset: 0x3496): ocdth4875mA
    <1d8>   DW_AT_const_value : 12
 <2><1d9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1da>   DW_AT_name        : (indirect string, offset: 0x1925): ocdth5250mA
    <1de>   DW_AT_const_value : 13
 <2><1df>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1e0>   DW_AT_name        : (indirect string, offset: 0xfd4): ocdth5625mA
    <1e4>   DW_AT_const_value : 14
 <2><1e5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1e6>   DW_AT_name        : (indirect string, offset: 0x34c1): ocdth6000mA
    <1ea>   DW_AT_const_value : 15
 <2><1eb>: Abbrev Number: 0
 <1><1ec>: Abbrev Number: 13 (DW_TAG_typedef)
    <1ed>   DW_AT_name        : (indirect string, offset: 0x2b28): L6474x_OCD_TH_t
    <1f1>   DW_AT_decl_file   : 2
    <1f2>   DW_AT_decl_line   : 250
    <1f3>   DW_AT_decl_column : 3
    <1f3>   DW_AT_type        : <0x17b>
 <1><1f7>: Abbrev Number: 18 (DW_TAG_typedef)
    <1f8>   DW_AT_name        : (indirect string, offset: 0x33d1): L6474_Handle_t
    <1fc>   DW_AT_decl_file   : 2
    <1fc>   DW_AT_decl_line   : 258
    <1fe>   DW_AT_decl_column : 30
    <1ff>   DW_AT_type        : <0x203>
 <1><203>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <204>   DW_AT_byte_size   : 4
    <204>   DW_AT_type        : <0x208>
 <1><208>: Abbrev Number: 22 (DW_TAG_structure_type)
    <209>   DW_AT_name        : (indirect string, offset: 0x2928): L6474_Handle
    <20d>   DW_AT_byte_size   : 24
    <20e>   DW_AT_decl_file   : 1
    <20f>   DW_AT_decl_line   : 146
    <210>   DW_AT_decl_column : 8
    <211>   DW_AT_sibling     : <0x264>
 <2><215>: Abbrev Number: 6 (DW_TAG_member)
    <216>   DW_AT_name        : (indirect string, offset: 0x1016dd): state
    <21a>   DW_AT_decl_file   : 1
    <21b>   DW_AT_decl_line   : 149
    <21c>   DW_AT_decl_column : 21
    <21d>   DW_AT_type        : <0x5a>
    <221>   DW_AT_data_member_location: 0
 <2><222>: Abbrev Number: 6 (DW_TAG_member)
    <223>   DW_AT_name        : (indirect string, offset: 0x1890): pending
    <227>   DW_AT_decl_file   : 1
    <228>   DW_AT_decl_line   : 150
    <229>   DW_AT_decl_column : 21
    <22a>   DW_AT_type        : <0x317>
    <22e>   DW_AT_data_member_location: 4
 <2><22f>: Abbrev Number: 23 (DW_TAG_member)
    <230>   DW_AT_name        : pIO
    <234>   DW_AT_decl_file   : 1
    <235>   DW_AT_decl_line   : 151
    <236>   DW_AT_decl_column : 21
    <237>   DW_AT_type        : <0x2d0>
    <23b>   DW_AT_data_member_location: 8
 <2><23c>: Abbrev Number: 6 (DW_TAG_member)
    <23d>   DW_AT_name        : (indirect string, offset: 0x2bb3): pGPO
    <241>   DW_AT_decl_file   : 1
    <242>   DW_AT_decl_line   : 152
    <243>   DW_AT_decl_column : 21
    <244>   DW_AT_type        : <0x2d0>
    <248>   DW_AT_data_member_location: 12
 <2><249>: Abbrev Number: 6 (DW_TAG_member)
    <24a>   DW_AT_name        : (indirect string, offset: 0x398d): pPWM
    <24e>   DW_AT_decl_file   : 1
    <24f>   DW_AT_decl_line   : 153
    <250>   DW_AT_decl_column : 21
    <251>   DW_AT_type        : <0x2d0>
    <255>   DW_AT_data_member_location: 16
 <2><256>: Abbrev Number: 6 (DW_TAG_member)
    <257>   DW_AT_name        : (indirect string, offset: 0x725): platform
    <25b>   DW_AT_decl_file   : 1
    <25c>   DW_AT_decl_line   : 154
    <25d>   DW_AT_decl_column : 21
    <25e>   DW_AT_type        : <0x4d2>
    <262>   DW_AT_data_member_location: 20
 <2><263>: Abbrev Number: 0
 <1><264>: Abbrev Number: 30 (DW_TAG_structure_type)
    <265>   DW_AT_name        : (indirect string, offset: 0xcb9): L6474x_Platform
    <269>   DW_AT_byte_size   : 24
    <26a>   DW_AT_decl_file   : 2
    <26b>   DW_AT_decl_line   : 267
    <26d>   DW_AT_decl_column : 16
    <26e>   DW_AT_sibling     : <0x2c1>
 <2><272>: Abbrev Number: 9 (DW_TAG_member)
    <273>   DW_AT_name        : (indirect string, offset: 0xf71): malloc
    <277>   DW_AT_decl_file   : 2
    <277>   DW_AT_decl_line   : 285
    <279>   DW_AT_decl_column : 10
    <27a>   DW_AT_type        : <0x2d9>
    <27e>   DW_AT_data_member_location: 0
 <2><27f>: Abbrev Number: 9 (DW_TAG_member)
    <280>   DW_AT_name        : (indirect string, offset: 0x1860): free
    <284>   DW_AT_decl_file   : 2
    <284>   DW_AT_decl_line   : 303
    <286>   DW_AT_decl_column : 10
    <287>   DW_AT_type        : <0x2f4>
    <28b>   DW_AT_data_member_location: 4
 <2><28c>: Abbrev Number: 9 (DW_TAG_member)
    <28d>   DW_AT_name        : (indirect string, offset: 0xb9d): transfer
    <291>   DW_AT_decl_file   : 2
    <291>   DW_AT_decl_line   : 321
    <293>   DW_AT_decl_column : 10
    <294>   DW_AT_type        : <0x339>
    <298>   DW_AT_data_member_location: 8
 <2><299>: Abbrev Number: 9 (DW_TAG_member)
    <29a>   DW_AT_name        : (indirect string, offset: 0x3005): reset
    <29e>   DW_AT_decl_file   : 2
    <29e>   DW_AT_decl_line   : 337
    <2a0>   DW_AT_decl_column : 10
    <2a1>   DW_AT_type        : <0x34e>
    <2a5>   DW_AT_data_member_location: 12
 <2><2a6>: Abbrev Number: 9 (DW_TAG_member)
    <2a7>   DW_AT_name        : (indirect string, offset: 0x36de): sleep
    <2ab>   DW_AT_decl_file   : 2
    <2ab>   DW_AT_decl_line   : 352
    <2ad>   DW_AT_decl_column : 10
    <2ae>   DW_AT_type        : <0x35e>
    <2b2>   DW_AT_data_member_location: 16
 <2><2b3>: Abbrev Number: 9 (DW_TAG_member)
    <2b4>   DW_AT_name        : (indirect string, offset: 0x24f5): step
    <2b8>   DW_AT_decl_file   : 2
    <2b8>   DW_AT_decl_line   : 379
    <2ba>   DW_AT_decl_column : 10
    <2bb>   DW_AT_type        : <0x37c>
    <2bf>   DW_AT_data_member_location: 20
 <2><2c0>: Abbrev Number: 0
 <1><2c1>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <2c2>   DW_AT_prototyped  : 1
    <2c2>   DW_AT_type        : <0x2d0>
    <2c6>   DW_AT_sibling     : <0x2d0>
 <2><2ca>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <2cb>   DW_AT_type        : <0x2d2>
 <2><2cf>: Abbrev Number: 0
 <1><2d0>: Abbrev Number: 31 (DW_TAG_pointer_type)
    <2d1>   DW_AT_byte_size   : 4
 <1><2d2>: Abbrev Number: 17 (DW_TAG_base_type)
    <2d3>   DW_AT_byte_size   : 4
    <2d4>   DW_AT_encoding    : 7	(unsigned)
    <2d5>   DW_AT_name        : (indirect string, offset: 0x2cf5): unsigned int
 <1><2d9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <2da>   DW_AT_byte_size   : 4
    <2da>   DW_AT_type        : <0x2c1>
 <1><2de>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <2df>   DW_AT_prototyped  : 1
    <2df>   DW_AT_sibling     : <0x2e9>
 <2><2e3>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <2e4>   DW_AT_type        : <0x2ee>
 <2><2e8>: Abbrev Number: 0
 <1><2e9>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <2ea>   DW_AT_byte_size   : 4
    <2ea>   DW_AT_type        : <0x2f3>
 <1><2ee>: Abbrev Number: 15 (DW_TAG_const_type)
    <2ef>   DW_AT_type        : <0x2e9>
 <1><2f3>: Abbrev Number: 32 (DW_TAG_const_type)
 <1><2f4>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <2f5>   DW_AT_byte_size   : 4
    <2f5>   DW_AT_type        : <0x2de>
 <1><2f9>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <2fa>   DW_AT_prototyped  : 1
    <2fa>   DW_AT_type        : <0x317>
    <2fe>   DW_AT_sibling     : <0x317>
 <2><302>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <303>   DW_AT_type        : <0x2d0>
 <2><307>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <308>   DW_AT_type        : <0x323>
 <2><30c>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <30d>   DW_AT_type        : <0x334>
 <2><311>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <312>   DW_AT_type        : <0x2d2>
 <2><316>: Abbrev Number: 0
 <1><317>: Abbrev Number: 33 (DW_TAG_base_type)
    <318>   DW_AT_byte_size   : 4
    <319>   DW_AT_encoding    : 5	(signed)
    <31a>   DW_AT_name        : int
 <1><31e>: Abbrev Number: 15 (DW_TAG_const_type)
    <31f>   DW_AT_type        : <0x317>
 <1><323>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <324>   DW_AT_byte_size   : 4
    <324>   DW_AT_type        : <0x328>
 <1><328>: Abbrev Number: 17 (DW_TAG_base_type)
    <329>   DW_AT_byte_size   : 1
    <32a>   DW_AT_encoding    : 8	(unsigned char)
    <32b>   DW_AT_name        : (indirect string, offset: 0xd288c): char
 <1><32f>: Abbrev Number: 15 (DW_TAG_const_type)
    <330>   DW_AT_type        : <0x328>
 <1><334>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <335>   DW_AT_byte_size   : 4
    <335>   DW_AT_type        : <0x32f>
 <1><339>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <33a>   DW_AT_byte_size   : 4
    <33a>   DW_AT_type        : <0x2f9>
 <1><33e>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <33f>   DW_AT_prototyped  : 1
    <33f>   DW_AT_sibling     : <0x34e>
 <2><343>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <344>   DW_AT_type        : <0x2d0>
 <2><348>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <349>   DW_AT_type        : <0x31e>
 <2><34d>: Abbrev Number: 0
 <1><34e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <34f>   DW_AT_byte_size   : 4
    <34f>   DW_AT_type        : <0x33e>
 <1><353>: Abbrev Number: 25 (DW_TAG_subroutine_type)
    <354>   DW_AT_prototyped  : 1
    <354>   DW_AT_sibling     : <0x35e>
 <2><358>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <359>   DW_AT_type        : <0x2d2>
 <2><35d>: Abbrev Number: 0
 <1><35e>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <35f>   DW_AT_byte_size   : 4
    <35f>   DW_AT_type        : <0x353>
 <1><363>: Abbrev Number: 24 (DW_TAG_subroutine_type)
    <364>   DW_AT_prototyped  : 1
    <364>   DW_AT_type        : <0x317>
    <368>   DW_AT_sibling     : <0x37c>
 <2><36c>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <36d>   DW_AT_type        : <0x2d0>
 <2><371>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <372>   DW_AT_type        : <0x317>
 <2><376>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <377>   DW_AT_type        : <0x2d2>
 <2><37b>: Abbrev Number: 0
 <1><37c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <37d>   DW_AT_byte_size   : 4
    <37d>   DW_AT_type        : <0x363>
 <1><381>: Abbrev Number: 18 (DW_TAG_typedef)
    <382>   DW_AT_name        : (indirect string, offset: 0x3768): L6474x_Platform_t
    <386>   DW_AT_decl_file   : 2
    <386>   DW_AT_decl_line   : 442
    <388>   DW_AT_decl_column : 3
    <389>   DW_AT_type        : <0x264>
 <1><38d>: Abbrev Number: 34 (DW_TAG_enumeration_type)
    <38e>   DW_AT_encoding    : 7	(unsigned)
    <38f>   DW_AT_byte_size   : 1
    <390>   DW_AT_type        : <0x53>
    <394>   DW_AT_decl_file   : 2
    <395>   DW_AT_decl_line   : 453
    <397>   DW_AT_decl_column : 1
    <398>   DW_AT_sibling     : <0x3c1>
 <2><39c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <39d>   DW_AT_name        : (indirect string, offset: 0x38dd): L6474_PROP_TORQUE
    <3a1>   DW_AT_const_value : 9
 <2><3a2>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3a3>   DW_AT_name        : (indirect string, offset: 0x3bce): L6474_PROP_TON
    <3a7>   DW_AT_const_value : 15
 <2><3a8>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3a9>   DW_AT_name        : (indirect string, offset: 0x1229): L6474_PROP_TOFF
    <3ad>   DW_AT_const_value : 16
 <2><3ae>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3af>   DW_AT_name        : (indirect string, offset: 0x3451): L6474_PROP_ADC_OUT
    <3b3>   DW_AT_const_value : 18
 <2><3b4>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3b5>   DW_AT_name        : (indirect string, offset: 0x36c): L6474_PROP_OCDTH
    <3b9>   DW_AT_const_value : 19
 <2><3ba>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3bb>   DW_AT_name        : (indirect string, offset: 0x324): L6474_PROP_TFAST
    <3bf>   DW_AT_const_value : 14
 <2><3c0>: Abbrev Number: 0
 <1><3c1>: Abbrev Number: 18 (DW_TAG_typedef)
    <3c2>   DW_AT_name        : (indirect string, offset: 0x351d): L6474_Property_t
    <3c6>   DW_AT_decl_file   : 2
    <3c6>   DW_AT_decl_line   : 483
    <3c8>   DW_AT_decl_column : 3
    <3c9>   DW_AT_type        : <0x38d>
 <1><3cd>: Abbrev Number: 35 (DW_TAG_structure_type)
    <3ce>   DW_AT_byte_size   : 6
    <3cf>   DW_AT_decl_file   : 2
    <3d0>   DW_AT_decl_line   : 492
    <3d2>   DW_AT_decl_column : 9
    <3d3>   DW_AT_sibling     : <0x426>
 <2><3d7>: Abbrev Number: 9 (DW_TAG_member)
    <3d8>   DW_AT_name        : (indirect string, offset: 0x8ff): stepMode
    <3dc>   DW_AT_decl_file   : 2
    <3dc>   DW_AT_decl_line   : 498
    <3de>   DW_AT_decl_column : 20
    <3df>   DW_AT_type        : <0x94>
    <3e3>   DW_AT_data_member_location: 0
 <2><3e4>: Abbrev Number: 9 (DW_TAG_member)
    <3e5>   DW_AT_name        : (indirect string, offset: 0x3464): OcdTh
    <3e9>   DW_AT_decl_file   : 2
    <3e9>   DW_AT_decl_line   : 503
    <3eb>   DW_AT_decl_column : 20
    <3ec>   DW_AT_type        : <0x1ec>
    <3f0>   DW_AT_data_member_location: 1
 <2><3f1>: Abbrev Number: 9 (DW_TAG_member)
    <3f2>   DW_AT_name        : (indirect string, offset: 0x2e3b): TimeOnMin
    <3f6>   DW_AT_decl_file   : 2
    <3f6>   DW_AT_decl_line   : 508
    <3f8>   DW_AT_decl_column : 20
    <3f9>   DW_AT_type        : <0x328>
    <3fd>   DW_AT_data_member_location: 2
 <2><3fe>: Abbrev Number: 9 (DW_TAG_member)
    <3ff>   DW_AT_name        : (indirect string, offset: 0x1b85): TimeOffMin
    <403>   DW_AT_decl_file   : 2
    <403>   DW_AT_decl_line   : 513
    <405>   DW_AT_decl_column : 20
    <406>   DW_AT_type        : <0x328>
    <40a>   DW_AT_data_member_location: 3
 <2><40b>: Abbrev Number: 9 (DW_TAG_member)
    <40c>   DW_AT_name        : (indirect string, offset: 0x21a9): TorqueVal
    <410>   DW_AT_decl_file   : 2
    <410>   DW_AT_decl_line   : 518
    <412>   DW_AT_decl_column : 20
    <413>   DW_AT_type        : <0x328>
    <417>   DW_AT_data_member_location: 4
 <2><418>: Abbrev Number: 9 (DW_TAG_member)
    <419>   DW_AT_name        : (indirect string, offset: 0xd5f): TFast
    <41d>   DW_AT_decl_file   : 2
    <41d>   DW_AT_decl_line   : 523
    <41f>   DW_AT_decl_column : 20
    <420>   DW_AT_type        : <0x328>
    <424>   DW_AT_data_member_location: 5
 <2><425>: Abbrev Number: 0
 <1><426>: Abbrev Number: 18 (DW_TAG_typedef)
    <427>   DW_AT_name        : (indirect string, offset: 0x22e4): L6474_BaseParameter_t
    <42b>   DW_AT_decl_file   : 2
    <42b>   DW_AT_decl_line   : 525
    <42d>   DW_AT_decl_column : 3
    <42e>   DW_AT_type        : <0x3cd>
 <1><432>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <433>   DW_AT_name        : (indirect string, offset: 0xca6): L6474x_AccessFlags
    <437>   DW_AT_encoding    : 7	(unsigned)
    <438>   DW_AT_byte_size   : 1
    <438>   DW_AT_type        : <0x53>
    <43c>   DW_AT_decl_file   : 1
    <43d>   DW_AT_decl_line   : 124
    <43e>   DW_AT_decl_column : 14
    <43e>   DW_AT_sibling     : <0x45b>
 <2><442>: Abbrev Number: 1 (DW_TAG_enumerator)
    <443>   DW_AT_name        : (indirect string, offset: 0x3108): afNONE
    <447>   DW_AT_const_value : 0
 <2><448>: Abbrev Number: 1 (DW_TAG_enumerator)
    <449>   DW_AT_name        : (indirect string, offset: 0x2ef8): afREAD
    <44d>   DW_AT_const_value : 1
 <2><44e>: Abbrev Number: 1 (DW_TAG_enumerator)
    <44f>   DW_AT_name        : (indirect string, offset: 0x3624): afWRITE
    <453>   DW_AT_const_value : 2
 <2><454>: Abbrev Number: 1 (DW_TAG_enumerator)
    <455>   DW_AT_name        : (indirect string, offset: 0xbe1): afWRITE_HighZ
    <459>   DW_AT_const_value : 4
 <2><45a>: Abbrev Number: 0
 <1><45b>: Abbrev Number: 13 (DW_TAG_typedef)
    <45c>   DW_AT_name        : (indirect string, offset: 0x30b6): L6474x_AccessFlags_t
    <460>   DW_AT_decl_file   : 1
    <461>   DW_AT_decl_line   : 131
    <462>   DW_AT_decl_column : 3
    <462>   DW_AT_type        : <0x432>
 <1><466>: Abbrev Number: 22 (DW_TAG_structure_type)
    <467>   DW_AT_name        : (indirect string, offset: 0x3309): L6474x_ParameterDescriptor
    <46b>   DW_AT_byte_size   : 16
    <46c>   DW_AT_decl_file   : 1
    <46d>   DW_AT_decl_line   : 134
    <46e>   DW_AT_decl_column : 16
    <46f>   DW_AT_sibling     : <0x4c2>
 <2><473>: Abbrev Number: 6 (DW_TAG_member)
    <474>   DW_AT_name        : (indirect string, offset: 0x25bd): command
    <478>   DW_AT_decl_file   : 1
    <479>   DW_AT_decl_line   : 137
    <47a>   DW_AT_decl_column : 23
    <47b>   DW_AT_type        : <0x53>
    <47f>   DW_AT_data_member_location: 0
 <2><480>: Abbrev Number: 6 (DW_TAG_member)
    <481>   DW_AT_name        : (indirect string, offset: 0x3177): defined
    <485>   DW_AT_decl_file   : 1
    <486>   DW_AT_decl_line   : 138
    <487>   DW_AT_decl_column : 23
    <488>   DW_AT_type        : <0x53>
    <48c>   DW_AT_data_member_location: 1
 <2><48d>: Abbrev Number: 6 (DW_TAG_member)
    <48e>   DW_AT_name        : (indirect string, offset: 0x2d3c): length
    <492>   DW_AT_decl_file   : 1
    <493>   DW_AT_decl_line   : 139
    <494>   DW_AT_decl_column : 23
    <495>   DW_AT_type        : <0x53>
    <499>   DW_AT_data_member_location: 2
 <2><49a>: Abbrev Number: 6 (DW_TAG_member)
    <49b>   DW_AT_name        : (indirect string, offset: 0x2631): mask
    <49f>   DW_AT_decl_file   : 1
    <4a0>   DW_AT_decl_line   : 140
    <4a1>   DW_AT_decl_column : 23
    <4a2>   DW_AT_type        : <0x2d2>
    <4a6>   DW_AT_data_member_location: 4
 <2><4a7>: Abbrev Number: 6 (DW_TAG_member)
    <4a8>   DW_AT_name        : (indirect string, offset: 0xa3722): name
    <4ac>   DW_AT_decl_file   : 1
    <4ad>   DW_AT_decl_line   : 141
    <4ae>   DW_AT_decl_column : 23
    <4af>   DW_AT_type        : <0x323>
    <4b3>   DW_AT_data_member_location: 8
 <2><4b4>: Abbrev Number: 6 (DW_TAG_member)
    <4b5>   DW_AT_name        : (indirect string, offset: 0xfb474): flags
    <4b9>   DW_AT_decl_file   : 1
    <4ba>   DW_AT_decl_line   : 142
    <4bb>   DW_AT_decl_column : 23
    <4bc>   DW_AT_type        : <0x45b>
    <4c0>   DW_AT_data_member_location: 12
 <2><4c1>: Abbrev Number: 0
 <1><4c2>: Abbrev Number: 13 (DW_TAG_typedef)
    <4c3>   DW_AT_name        : (indirect string, offset: 0x31fa): L6474x_ParameterDescriptor_t
    <4c7>   DW_AT_decl_file   : 1
    <4c8>   DW_AT_decl_line   : 143
    <4c9>   DW_AT_decl_column : 3
    <4c9>   DW_AT_type        : <0x466>
 <1><4cd>: Abbrev Number: 15 (DW_TAG_const_type)
    <4ce>   DW_AT_type        : <0x4c2>
 <1><4d2>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <4d3>   DW_AT_byte_size   : 4
    <4d3>   DW_AT_type        : <0x381>
 <1><4d7>: Abbrev Number: 19 (DW_TAG_array_type)
    <4d8>   DW_AT_type        : <0x4cd>
    <4dc>   DW_AT_sibling     : <0x4e7>
 <2><4e0>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <4e1>   DW_AT_type        : <0x2d2>
    <4e5>   DW_AT_upper_bound : 30
 <2><4e6>: Abbrev Number: 0
 <1><4e7>: Abbrev Number: 15 (DW_TAG_const_type)
    <4e8>   DW_AT_type        : <0x4d7>
 <1><4ec>: Abbrev Number: 12 (DW_TAG_variable)
    <4ed>   DW_AT_name        : (indirect string, offset: 0x187f): L6474_Parameters
    <4f1>   DW_AT_decl_file   : 1
    <4f1>   DW_AT_decl_line   : 158
    <4f2>   DW_AT_decl_column : 43
    <4f3>   DW_AT_type        : <0x4e7>
    <4f7>   DW_AT_location    : 5 byte block: 3 ec b 1 8 	(DW_OP_addr: 8010bec)
 <1><4fd>: Abbrev Number: 5 (DW_TAG_subprogram)
    <4fe>   DW_AT_external    : 1
    <4fe>   DW_AT_name        : (indirect string, offset: 0xc5d): L6474_StepIncremental
    <502>   DW_AT_decl_file   : 1
    <502>   DW_AT_decl_line   : 1252
    <504>   DW_AT_decl_column : 5
    <505>   DW_AT_prototyped  : 1
    <505>   DW_AT_type        : <0x317>
    <509>   DW_AT_low_pc      : 0x8001a0c
    <50d>   DW_AT_high_pc     : 0xae
    <511>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <513>   DW_AT_call_all_tail_calls: 1
    <513>   DW_AT_sibling     : <0x543>
 <2><517>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <518>   DW_AT_name        : h
    <51a>   DW_AT_decl_file   : 1
    <51a>   DW_AT_decl_line   : 1252
    <51c>   DW_AT_decl_column : 42
    <51d>   DW_AT_type        : <0x1f7>
    <521>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><524>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <525>   DW_AT_name        : (indirect string, offset: 0xe28): steps
    <529>   DW_AT_decl_file   : 1
    <529>   DW_AT_decl_line   : 1252
    <52b>   DW_AT_decl_column : 49
    <52c>   DW_AT_type        : <0x317>
    <530>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><533>: Abbrev Number: 3 (DW_TAG_variable)
    <534>   DW_AT_name        : ret
    <538>   DW_AT_decl_file   : 1
    <538>   DW_AT_decl_line   : 1279
    <53a>   DW_AT_decl_column : 6
    <53b>   DW_AT_type        : <0x317>
    <53f>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><542>: Abbrev Number: 0
 <1><543>: Abbrev Number: 5 (DW_TAG_subprogram)
    <544>   DW_AT_external    : 1
    <544>   DW_AT_name        : (indirect string, offset: 0x155f): L6474_StopMovement
    <548>   DW_AT_decl_file   : 1
    <548>   DW_AT_decl_line   : 1211
    <54a>   DW_AT_decl_column : 5
    <54b>   DW_AT_prototyped  : 1
    <54b>   DW_AT_type        : <0x317>
    <54f>   DW_AT_low_pc      : 0
    <553>   DW_AT_high_pc     : 0x62
    <557>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <559>   DW_AT_call_all_tail_calls: 1
    <559>   DW_AT_sibling     : <0x56b>
 <2><55d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <55e>   DW_AT_name        : h
    <560>   DW_AT_decl_file   : 1
    <560>   DW_AT_decl_line   : 1211
    <562>   DW_AT_decl_column : 39
    <563>   DW_AT_type        : <0x1f7>
    <567>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><56a>: Abbrev Number: 0
 <1><56b>: Abbrev Number: 26 (DW_TAG_subprogram)
    <56c>   DW_AT_external    : 1
    <56c>   DW_AT_name        : (indirect string, offset: 0x28e0): L6474_GetState
    <570>   DW_AT_decl_file   : 1
    <570>   DW_AT_decl_line   : 1196
    <572>   DW_AT_decl_column : 5
    <572>   DW_AT_prototyped  : 1
    <572>   DW_AT_type        : <0x317>
    <576>   DW_AT_low_pc      : 0
    <57a>   DW_AT_high_pc     : 0x38
    <57e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <580>   DW_AT_call_all_calls: 1
    <580>   DW_AT_sibling     : <0x5a1>
 <2><584>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <585>   DW_AT_name        : h
    <587>   DW_AT_decl_file   : 1
    <587>   DW_AT_decl_line   : 1196
    <589>   DW_AT_decl_column : 35
    <58a>   DW_AT_type        : <0x1f7>
    <58e>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><591>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <592>   DW_AT_name        : (indirect string, offset: 0x1016dd): state
    <596>   DW_AT_decl_file   : 1
    <596>   DW_AT_decl_line   : 1196
    <598>   DW_AT_decl_column : 54
    <599>   DW_AT_type        : <0x5a1>
    <59d>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><5a0>: Abbrev Number: 0
 <1><5a1>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5a2>   DW_AT_byte_size   : 4
    <5a2>   DW_AT_type        : <0x5a>
 <1><5a6>: Abbrev Number: 5 (DW_TAG_subprogram)
    <5a7>   DW_AT_external    : 1
    <5a7>   DW_AT_name        : (indirect string, offset: 0x1915): L6474_GetStatus
    <5ab>   DW_AT_decl_file   : 1
    <5ab>   DW_AT_decl_line   : 1152
    <5ad>   DW_AT_decl_column : 5
    <5ae>   DW_AT_prototyped  : 1
    <5ae>   DW_AT_type        : <0x317>
    <5b2>   DW_AT_low_pc      : 0
    <5b6>   DW_AT_high_pc     : 0x11a
    <5ba>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <5bc>   DW_AT_call_all_tail_calls: 1
    <5bc>   DW_AT_sibling     : <0x5ec>
 <2><5c0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <5c1>   DW_AT_name        : h
    <5c3>   DW_AT_decl_file   : 1
    <5c3>   DW_AT_decl_line   : 1152
    <5c5>   DW_AT_decl_column : 36
    <5c6>   DW_AT_type        : <0x1f7>
    <5ca>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><5cd>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <5ce>   DW_AT_name        : (indirect string, offset: 0x100b72): status
    <5d2>   DW_AT_decl_file   : 1
    <5d2>   DW_AT_decl_line   : 1152
    <5d4>   DW_AT_decl_column : 55
    <5d5>   DW_AT_type        : <0x5ec>
    <5d9>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><5dc>: Abbrev Number: 3 (DW_TAG_variable)
    <5dd>   DW_AT_name        : val
    <5e1>   DW_AT_decl_file   : 1
    <5e1>   DW_AT_decl_line   : 1155
    <5e3>   DW_AT_decl_column : 6
    <5e4>   DW_AT_type        : <0x317>
    <5e8>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><5eb>: Abbrev Number: 0
 <1><5ec>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5ed>   DW_AT_byte_size   : 4
    <5ed>   DW_AT_type        : <0x170>
 <1><5f1>: Abbrev Number: 5 (DW_TAG_subprogram)
    <5f2>   DW_AT_external    : 1
    <5f2>   DW_AT_name        : (indirect string, offset: 0x3b2d): L6474_SetAlarmEnables
    <5f6>   DW_AT_decl_file   : 1
    <5f6>   DW_AT_decl_line   : 1120
    <5f8>   DW_AT_decl_column : 5
    <5f9>   DW_AT_prototyped  : 1
    <5f9>   DW_AT_type        : <0x317>
    <5fd>   DW_AT_low_pc      : 0
    <601>   DW_AT_high_pc     : 0x72
    <605>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <607>   DW_AT_call_all_tail_calls: 1
    <607>   DW_AT_sibling     : <0x637>
 <2><60b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <60c>   DW_AT_name        : h
    <60e>   DW_AT_decl_file   : 1
    <60e>   DW_AT_decl_line   : 1120
    <610>   DW_AT_decl_column : 42
    <611>   DW_AT_type        : <0x1f7>
    <615>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><618>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <619>   DW_AT_name        : (indirect string, offset: 0x102f66): bits
    <61d>   DW_AT_decl_file   : 1
    <61d>   DW_AT_decl_line   : 1120
    <61f>   DW_AT_decl_column : 49
    <620>   DW_AT_type        : <0x317>
    <624>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><627>: Abbrev Number: 3 (DW_TAG_variable)
    <628>   DW_AT_name        : val
    <62c>   DW_AT_decl_file   : 1
    <62c>   DW_AT_decl_line   : 1123
    <62e>   DW_AT_decl_column : 6
    <62f>   DW_AT_type        : <0x317>
    <633>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><636>: Abbrev Number: 0
 <1><637>: Abbrev Number: 5 (DW_TAG_subprogram)
    <638>   DW_AT_external    : 1
    <638>   DW_AT_name        : (indirect string, offset: 0xc73): L6474_GetProperty
    <63c>   DW_AT_decl_file   : 1
    <63c>   DW_AT_decl_line   : 1087
    <63e>   DW_AT_decl_column : 5
    <63f>   DW_AT_prototyped  : 1
    <63f>   DW_AT_type        : <0x317>
    <643>   DW_AT_low_pc      : 0
    <647>   DW_AT_high_pc     : 0x7c
    <64b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <64d>   DW_AT_call_all_tail_calls: 1
    <64d>   DW_AT_sibling     : <0x68c>
 <2><651>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <652>   DW_AT_name        : h
    <654>   DW_AT_decl_file   : 1
    <654>   DW_AT_decl_line   : 1087
    <656>   DW_AT_decl_column : 38
    <657>   DW_AT_type        : <0x1f7>
    <65b>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><65e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <65f>   DW_AT_name        : (indirect string, offset: 0x3339): prop
    <663>   DW_AT_decl_file   : 1
    <663>   DW_AT_decl_line   : 1087
    <665>   DW_AT_decl_column : 58
    <666>   DW_AT_type        : <0x3c1>
    <66a>   DW_AT_location    : 2 byte block: 91 6b 	(DW_OP_fbreg: -21)
 <2><66d>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <66e>   DW_AT_name        : (indirect string, offset: 0xfe4a0): value
    <672>   DW_AT_decl_file   : 1
    <672>   DW_AT_decl_line   : 1087
    <674>   DW_AT_decl_column : 69
    <675>   DW_AT_type        : <0x68c>
    <679>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><67c>: Abbrev Number: 3 (DW_TAG_variable)
    <67d>   DW_AT_name        : val
    <681>   DW_AT_decl_file   : 1
    <681>   DW_AT_decl_line   : 1090
    <683>   DW_AT_decl_column : 6
    <684>   DW_AT_type        : <0x317>
    <688>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><68b>: Abbrev Number: 0
 <1><68c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <68d>   DW_AT_byte_size   : 4
    <68d>   DW_AT_type        : <0x317>
 <1><691>: Abbrev Number: 5 (DW_TAG_subprogram)
    <692>   DW_AT_external    : 1
    <692>   DW_AT_name        : (indirect string, offset: 0x4f9): L6474_SetProperty
    <696>   DW_AT_decl_file   : 1
    <696>   DW_AT_decl_line   : 1055
    <698>   DW_AT_decl_column : 5
    <699>   DW_AT_prototyped  : 1
    <699>   DW_AT_type        : <0x317>
    <69d>   DW_AT_low_pc      : 0
    <6a1>   DW_AT_high_pc     : 0x78
    <6a5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6a7>   DW_AT_call_all_tail_calls: 1
    <6a7>   DW_AT_sibling     : <0x6e6>
 <2><6ab>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <6ac>   DW_AT_name        : h
    <6ae>   DW_AT_decl_file   : 1
    <6ae>   DW_AT_decl_line   : 1055
    <6b0>   DW_AT_decl_column : 38
    <6b1>   DW_AT_type        : <0x1f7>
    <6b5>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><6b8>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <6b9>   DW_AT_name        : (indirect string, offset: 0x3339): prop
    <6bd>   DW_AT_decl_file   : 1
    <6bd>   DW_AT_decl_line   : 1055
    <6bf>   DW_AT_decl_column : 58
    <6c0>   DW_AT_type        : <0x3c1>
    <6c4>   DW_AT_location    : 2 byte block: 91 6b 	(DW_OP_fbreg: -21)
 <2><6c7>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <6c8>   DW_AT_name        : (indirect string, offset: 0xfe4a0): value
    <6cc>   DW_AT_decl_file   : 1
    <6cc>   DW_AT_decl_line   : 1055
    <6ce>   DW_AT_decl_column : 68
    <6cf>   DW_AT_type        : <0x317>
    <6d3>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><6d6>: Abbrev Number: 3 (DW_TAG_variable)
    <6d7>   DW_AT_name        : val
    <6db>   DW_AT_decl_file   : 1
    <6db>   DW_AT_decl_line   : 1058
    <6dd>   DW_AT_decl_column : 6
    <6de>   DW_AT_type        : <0x317>
    <6e2>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><6e5>: Abbrev Number: 0
 <1><6e6>: Abbrev Number: 5 (DW_TAG_subprogram)
    <6e7>   DW_AT_external    : 1
    <6e7>   DW_AT_name        : (indirect string, offset: 0x389): L6474_GetAlarmEnables
    <6eb>   DW_AT_decl_file   : 1
    <6eb>   DW_AT_decl_line   : 1022
    <6ed>   DW_AT_decl_column : 5
    <6ee>   DW_AT_prototyped  : 1
    <6ee>   DW_AT_type        : <0x317>
    <6f2>   DW_AT_low_pc      : 0
    <6f6>   DW_AT_high_pc     : 0x7c
    <6fa>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6fc>   DW_AT_call_all_tail_calls: 1
    <6fc>   DW_AT_sibling     : <0x72c>
 <2><700>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <701>   DW_AT_name        : h
    <703>   DW_AT_decl_file   : 1
    <703>   DW_AT_decl_line   : 1022
    <705>   DW_AT_decl_column : 42
    <706>   DW_AT_type        : <0x1f7>
    <70a>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><70d>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <70e>   DW_AT_name        : (indirect string, offset: 0x102f66): bits
    <712>   DW_AT_decl_file   : 1
    <712>   DW_AT_decl_line   : 1022
    <714>   DW_AT_decl_column : 50
    <715>   DW_AT_type        : <0x68c>
    <719>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><71c>: Abbrev Number: 3 (DW_TAG_variable)
    <71d>   DW_AT_name        : val
    <721>   DW_AT_decl_file   : 1
    <721>   DW_AT_decl_line   : 1025
    <723>   DW_AT_decl_column : 6
    <724>   DW_AT_type        : <0x317>
    <728>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><72b>: Abbrev Number: 0
 <1><72c>: Abbrev Number: 5 (DW_TAG_subprogram)
    <72d>   DW_AT_external    : 1
    <72d>   DW_AT_name        : (indirect string, offset: 0x1997): L6474_SetPositionMark
    <731>   DW_AT_decl_file   : 1
    <731>   DW_AT_decl_line   : 990
    <733>   DW_AT_decl_column : 5
    <734>   DW_AT_prototyped  : 1
    <734>   DW_AT_type        : <0x317>
    <738>   DW_AT_low_pc      : 0
    <73c>   DW_AT_high_pc     : 0x72
    <740>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <742>   DW_AT_call_all_tail_calls: 1
    <742>   DW_AT_sibling     : <0x772>
 <2><746>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <747>   DW_AT_name        : h
    <749>   DW_AT_decl_file   : 1
    <749>   DW_AT_decl_line   : 990
    <74b>   DW_AT_decl_column : 42
    <74c>   DW_AT_type        : <0x1f7>
    <750>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><753>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <754>   DW_AT_name        : (indirect string, offset: 0x100bea): position
    <758>   DW_AT_decl_file   : 1
    <758>   DW_AT_decl_line   : 990
    <75a>   DW_AT_decl_column : 49
    <75b>   DW_AT_type        : <0x317>
    <75f>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><762>: Abbrev Number: 3 (DW_TAG_variable)
    <763>   DW_AT_name        : val
    <767>   DW_AT_decl_file   : 1
    <767>   DW_AT_decl_line   : 993
    <769>   DW_AT_decl_column : 6
    <76a>   DW_AT_type        : <0x317>
    <76e>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><771>: Abbrev Number: 0
 <1><772>: Abbrev Number: 5 (DW_TAG_subprogram)
    <773>   DW_AT_external    : 1
    <773>   DW_AT_name        : (indirect string, offset: 0x49d): L6474_GetPositionMark
    <777>   DW_AT_decl_file   : 1
    <777>   DW_AT_decl_line   : 954
    <779>   DW_AT_decl_column : 5
    <77a>   DW_AT_prototyped  : 1
    <77a>   DW_AT_type        : <0x317>
    <77e>   DW_AT_low_pc      : 0
    <782>   DW_AT_high_pc     : 0x92
    <786>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <788>   DW_AT_call_all_tail_calls: 1
    <788>   DW_AT_sibling     : <0x7b8>
 <2><78c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <78d>   DW_AT_name        : h
    <78f>   DW_AT_decl_file   : 1
    <78f>   DW_AT_decl_line   : 954
    <791>   DW_AT_decl_column : 42
    <792>   DW_AT_type        : <0x1f7>
    <796>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><799>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <79a>   DW_AT_name        : (indirect string, offset: 0x100bea): position
    <79e>   DW_AT_decl_file   : 1
    <79e>   DW_AT_decl_line   : 954
    <7a0>   DW_AT_decl_column : 50
    <7a1>   DW_AT_type        : <0x68c>
    <7a5>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><7a8>: Abbrev Number: 3 (DW_TAG_variable)
    <7a9>   DW_AT_name        : val
    <7ad>   DW_AT_decl_file   : 1
    <7ad>   DW_AT_decl_line   : 957
    <7af>   DW_AT_decl_column : 6
    <7b0>   DW_AT_type        : <0x317>
    <7b4>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><7b7>: Abbrev Number: 0
 <1><7b8>: Abbrev Number: 5 (DW_TAG_subprogram)
    <7b9>   DW_AT_external    : 1
    <7b9>   DW_AT_name        : (indirect string, offset: 0x2999): L6474_SetElectricalPosition
    <7bd>   DW_AT_decl_file   : 1
    <7bd>   DW_AT_decl_line   : 922
    <7bf>   DW_AT_decl_column : 5
    <7c0>   DW_AT_prototyped  : 1
    <7c0>   DW_AT_type        : <0x317>
    <7c4>   DW_AT_low_pc      : 0
    <7c8>   DW_AT_high_pc     : 0x72
    <7cc>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7ce>   DW_AT_call_all_tail_calls: 1
    <7ce>   DW_AT_sibling     : <0x7fe>
 <2><7d2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7d3>   DW_AT_name        : h
    <7d5>   DW_AT_decl_file   : 1
    <7d5>   DW_AT_decl_line   : 922
    <7d7>   DW_AT_decl_column : 48
    <7d8>   DW_AT_type        : <0x1f7>
    <7dc>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><7df>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <7e0>   DW_AT_name        : (indirect string, offset: 0x100bea): position
    <7e4>   DW_AT_decl_file   : 1
    <7e4>   DW_AT_decl_line   : 922
    <7e6>   DW_AT_decl_column : 55
    <7e7>   DW_AT_type        : <0x317>
    <7eb>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><7ee>: Abbrev Number: 3 (DW_TAG_variable)
    <7ef>   DW_AT_name        : val
    <7f3>   DW_AT_decl_file   : 1
    <7f3>   DW_AT_decl_line   : 925
    <7f5>   DW_AT_decl_column : 6
    <7f6>   DW_AT_type        : <0x317>
    <7fa>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><7fd>: Abbrev Number: 0
 <1><7fe>: Abbrev Number: 5 (DW_TAG_subprogram)
    <7ff>   DW_AT_external    : 1
    <7ff>   DW_AT_name        : (indirect string, offset: 0x23a3): L6474_GetElectricalPosition
    <803>   DW_AT_decl_file   : 1
    <803>   DW_AT_decl_line   : 889
    <805>   DW_AT_decl_column : 5
    <806>   DW_AT_prototyped  : 1
    <806>   DW_AT_type        : <0x317>
    <80a>   DW_AT_low_pc      : 0
    <80e>   DW_AT_high_pc     : 0x7c
    <812>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <814>   DW_AT_call_all_tail_calls: 1
    <814>   DW_AT_sibling     : <0x844>
 <2><818>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <819>   DW_AT_name        : h
    <81b>   DW_AT_decl_file   : 1
    <81b>   DW_AT_decl_line   : 889
    <81d>   DW_AT_decl_column : 48
    <81e>   DW_AT_type        : <0x1f7>
    <822>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><825>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <826>   DW_AT_name        : (indirect string, offset: 0x100bea): position
    <82a>   DW_AT_decl_file   : 1
    <82a>   DW_AT_decl_line   : 889
    <82c>   DW_AT_decl_column : 56
    <82d>   DW_AT_type        : <0x68c>
    <831>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><834>: Abbrev Number: 3 (DW_TAG_variable)
    <835>   DW_AT_name        : val
    <839>   DW_AT_decl_file   : 1
    <839>   DW_AT_decl_line   : 892
    <83b>   DW_AT_decl_column : 6
    <83c>   DW_AT_type        : <0x317>
    <840>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><843>: Abbrev Number: 0
 <1><844>: Abbrev Number: 5 (DW_TAG_subprogram)
    <845>   DW_AT_external    : 1
    <845>   DW_AT_name        : (indirect string, offset: 0xae3): L6474_SetAbsolutePosition
    <849>   DW_AT_decl_file   : 1
    <849>   DW_AT_decl_line   : 857
    <84b>   DW_AT_decl_column : 5
    <84c>   DW_AT_prototyped  : 1
    <84c>   DW_AT_type        : <0x317>
    <850>   DW_AT_low_pc      : 0
    <854>   DW_AT_high_pc     : 0x72
    <858>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <85a>   DW_AT_call_all_tail_calls: 1
    <85a>   DW_AT_sibling     : <0x88a>
 <2><85e>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <85f>   DW_AT_name        : h
    <861>   DW_AT_decl_file   : 1
    <861>   DW_AT_decl_line   : 857
    <863>   DW_AT_decl_column : 46
    <864>   DW_AT_type        : <0x1f7>
    <868>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><86b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <86c>   DW_AT_name        : (indirect string, offset: 0x100bea): position
    <870>   DW_AT_decl_file   : 1
    <870>   DW_AT_decl_line   : 857
    <872>   DW_AT_decl_column : 53
    <873>   DW_AT_type        : <0x317>
    <877>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><87a>: Abbrev Number: 3 (DW_TAG_variable)
    <87b>   DW_AT_name        : val
    <87f>   DW_AT_decl_file   : 1
    <87f>   DW_AT_decl_line   : 860
    <881>   DW_AT_decl_column : 6
    <882>   DW_AT_type        : <0x317>
    <886>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><889>: Abbrev Number: 0
 <1><88a>: Abbrev Number: 5 (DW_TAG_subprogram)
    <88b>   DW_AT_external    : 1
    <88b>   DW_AT_name        : (indirect string, offset: 0x2b5e): L6474_GetAbsolutePosition
    <88f>   DW_AT_decl_file   : 1
    <88f>   DW_AT_decl_line   : 820
    <891>   DW_AT_decl_column : 5
    <892>   DW_AT_prototyped  : 1
    <892>   DW_AT_type        : <0x317>
    <896>   DW_AT_low_pc      : 0
    <89a>   DW_AT_high_pc     : 0x92
    <89e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8a0>   DW_AT_call_all_tail_calls: 1
    <8a0>   DW_AT_sibling     : <0x8d0>
 <2><8a4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8a5>   DW_AT_name        : h
    <8a7>   DW_AT_decl_file   : 1
    <8a7>   DW_AT_decl_line   : 820
    <8a9>   DW_AT_decl_column : 46
    <8aa>   DW_AT_type        : <0x1f7>
    <8ae>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><8b1>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <8b2>   DW_AT_name        : (indirect string, offset: 0x100bea): position
    <8b6>   DW_AT_decl_file   : 1
    <8b6>   DW_AT_decl_line   : 820
    <8b8>   DW_AT_decl_column : 54
    <8b9>   DW_AT_type        : <0x68c>
    <8bd>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><8c0>: Abbrev Number: 3 (DW_TAG_variable)
    <8c1>   DW_AT_name        : val
    <8c5>   DW_AT_decl_file   : 1
    <8c5>   DW_AT_decl_line   : 823
    <8c7>   DW_AT_decl_column : 6
    <8c8>   DW_AT_type        : <0x317>
    <8cc>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><8cf>: Abbrev Number: 0
 <1><8d0>: Abbrev Number: 5 (DW_TAG_subprogram)
    <8d1>   DW_AT_external    : 1
    <8d1>   DW_AT_name        : (indirect string, offset: 0x20a1): L6474_SetPowerOutputs
    <8d5>   DW_AT_decl_file   : 1
    <8d5>   DW_AT_decl_line   : 788
    <8d7>   DW_AT_decl_column : 5
    <8d8>   DW_AT_prototyped  : 1
    <8d8>   DW_AT_type        : <0x317>
    <8dc>   DW_AT_low_pc      : 0x800198c
    <8e0>   DW_AT_high_pc     : 0x80
    <8e4>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8e6>   DW_AT_call_all_tail_calls: 1
    <8e6>   DW_AT_sibling     : <0x916>
 <2><8ea>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8eb>   DW_AT_name        : h
    <8ed>   DW_AT_decl_file   : 1
    <8ed>   DW_AT_decl_line   : 788
    <8ef>   DW_AT_decl_column : 42
    <8f0>   DW_AT_type        : <0x1f7>
    <8f4>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><8f7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8f8>   DW_AT_name        : ena
    <8fc>   DW_AT_decl_file   : 1
    <8fc>   DW_AT_decl_line   : 788
    <8fe>   DW_AT_decl_column : 49
    <8ff>   DW_AT_type        : <0x317>
    <903>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><906>: Abbrev Number: 3 (DW_TAG_variable)
    <907>   DW_AT_name        : val
    <90b>   DW_AT_decl_file   : 1
    <90b>   DW_AT_decl_line   : 791
    <90d>   DW_AT_decl_column : 6
    <90e>   DW_AT_type        : <0x317>
    <912>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><915>: Abbrev Number: 0
 <1><916>: Abbrev Number: 5 (DW_TAG_subprogram)
    <917>   DW_AT_external    : 1
    <917>   DW_AT_name        : (indirect string, offset: 0x1239): L6474_GetStepMode
    <91b>   DW_AT_decl_file   : 1
    <91b>   DW_AT_decl_line   : 751
    <91d>   DW_AT_decl_column : 5
    <91e>   DW_AT_prototyped  : 1
    <91e>   DW_AT_type        : <0x317>
    <922>   DW_AT_low_pc      : 0
    <926>   DW_AT_high_pc     : 0x8a
    <92a>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <92c>   DW_AT_call_all_tail_calls: 1
    <92c>   DW_AT_sibling     : <0x95c>
 <2><930>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <931>   DW_AT_name        : h
    <933>   DW_AT_decl_file   : 1
    <933>   DW_AT_decl_line   : 751
    <935>   DW_AT_decl_column : 38
    <936>   DW_AT_type        : <0x1f7>
    <93a>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><93d>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <93e>   DW_AT_name        : (indirect string, offset: 0x10106e): mode
    <942>   DW_AT_decl_file   : 1
    <942>   DW_AT_decl_line   : 751
    <944>   DW_AT_decl_column : 60
    <945>   DW_AT_type        : <0x95c>
    <949>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><94c>: Abbrev Number: 3 (DW_TAG_variable)
    <94d>   DW_AT_name        : val
    <951>   DW_AT_decl_file   : 1
    <951>   DW_AT_decl_line   : 754
    <953>   DW_AT_decl_column : 6
    <954>   DW_AT_type        : <0x317>
    <958>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><95b>: Abbrev Number: 0
 <1><95c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <95d>   DW_AT_byte_size   : 4
    <95d>   DW_AT_type        : <0x94>
 <1><961>: Abbrev Number: 5 (DW_TAG_subprogram)
    <962>   DW_AT_external    : 1
    <962>   DW_AT_name        : (indirect string, offset: 0x9e4): L6474_SetStepMode
    <966>   DW_AT_decl_file   : 1
    <966>   DW_AT_decl_line   : 713
    <968>   DW_AT_decl_column : 5
    <969>   DW_AT_prototyped  : 1
    <969>   DW_AT_type        : <0x317>
    <96d>   DW_AT_low_pc      : 0x8001902
    <971>   DW_AT_high_pc     : 0x8a
    <975>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <977>   DW_AT_call_all_tail_calls: 1
    <977>   DW_AT_sibling     : <0x9a7>
 <2><97b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <97c>   DW_AT_name        : h
    <97e>   DW_AT_decl_file   : 1
    <97e>   DW_AT_decl_line   : 713
    <980>   DW_AT_decl_column : 38
    <981>   DW_AT_type        : <0x1f7>
    <985>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><988>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <989>   DW_AT_name        : (indirect string, offset: 0x10106e): mode
    <98d>   DW_AT_decl_file   : 1
    <98d>   DW_AT_decl_line   : 713
    <98f>   DW_AT_decl_column : 59
    <990>   DW_AT_type        : <0x94>
    <994>   DW_AT_location    : 2 byte block: 91 6b 	(DW_OP_fbreg: -21)
 <2><997>: Abbrev Number: 3 (DW_TAG_variable)
    <998>   DW_AT_name        : val
    <99c>   DW_AT_decl_file   : 1
    <99c>   DW_AT_decl_line   : 716
    <99e>   DW_AT_decl_column : 6
    <99f>   DW_AT_type        : <0x317>
    <9a3>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><9a6>: Abbrev Number: 0
 <1><9a7>: Abbrev Number: 5 (DW_TAG_subprogram)
    <9a8>   DW_AT_external    : 1
    <9a8>   DW_AT_name        : (indirect string, offset: 0x2ddc): L6474_IsMoving
    <9ac>   DW_AT_decl_file   : 1
    <9ac>   DW_AT_decl_line   : 696
    <9ae>   DW_AT_decl_column : 5
    <9af>   DW_AT_prototyped  : 1
    <9af>   DW_AT_type        : <0x317>
    <9b3>   DW_AT_low_pc      : 0
    <9b7>   DW_AT_high_pc     : 0x46
    <9bb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9bd>   DW_AT_call_all_tail_calls: 1
    <9bd>   DW_AT_sibling     : <0x9de>
 <2><9c1>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9c2>   DW_AT_name        : h
    <9c4>   DW_AT_decl_file   : 1
    <9c4>   DW_AT_decl_line   : 696
    <9c6>   DW_AT_decl_column : 35
    <9c7>   DW_AT_type        : <0x1f7>
    <9cb>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><9ce>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <9cf>   DW_AT_name        : (indirect string, offset: 0x36a2): moving
    <9d3>   DW_AT_decl_file   : 1
    <9d3>   DW_AT_decl_line   : 696
    <9d5>   DW_AT_decl_column : 43
    <9d6>   DW_AT_type        : <0x68c>
    <9da>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><9dd>: Abbrev Number: 0
 <1><9de>: Abbrev Number: 5 (DW_TAG_subprogram)
    <9df>   DW_AT_external    : 1
    <9df>   DW_AT_name        : (indirect string, offset: 0x12ea): L6474_Initialize
    <9e3>   DW_AT_decl_file   : 1
    <9e3>   DW_AT_decl_line   : 570
    <9e5>   DW_AT_decl_column : 5
    <9e6>   DW_AT_prototyped  : 1
    <9e6>   DW_AT_type        : <0x317>
    <9ea>   DW_AT_low_pc      : 0x8001660
    <9ee>   DW_AT_high_pc     : 0x2a2
    <9f2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9f4>   DW_AT_call_all_tail_calls: 1
    <9f4>   DW_AT_sibling     : <0xa31>
 <2><9f8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9f9>   DW_AT_name        : h
    <9fb>   DW_AT_decl_file   : 1
    <9fb>   DW_AT_decl_line   : 570
    <9fd>   DW_AT_decl_column : 37
    <9fe>   DW_AT_type        : <0x1f7>
    <a02>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><a05>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a06>   DW_AT_name        : p
    <a08>   DW_AT_decl_file   : 1
    <a08>   DW_AT_decl_line   : 570
    <a0a>   DW_AT_decl_column : 63
    <a0b>   DW_AT_type        : <0xa31>
    <a0f>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><a12>: Abbrev Number: 3 (DW_TAG_variable)
    <a13>   DW_AT_name        : val
    <a17>   DW_AT_decl_file   : 1
    <a17>   DW_AT_decl_line   : 573
    <a19>   DW_AT_decl_column : 6
    <a1a>   DW_AT_type        : <0x317>
    <a1e>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><a21>: Abbrev Number: 8 (DW_TAG_variable)
    <a22>   DW_AT_name        : (indirect string, offset: 0x2c418): CONFIG
    <a26>   DW_AT_decl_file   : 1
    <a26>   DW_AT_decl_line   : 599
    <a28>   DW_AT_decl_column : 15
    <a29>   DW_AT_type        : <0x2d2>
    <a2d>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><a30>: Abbrev Number: 0
 <1><a31>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a32>   DW_AT_byte_size   : 4
    <a32>   DW_AT_type        : <0x426>
 <1><a36>: Abbrev Number: 26 (DW_TAG_subprogram)
    <a37>   DW_AT_external    : 1
    <a37>   DW_AT_name        : (indirect string, offset: 0x2fa6): L6474_SetBaseParameter
    <a3b>   DW_AT_decl_file   : 1
    <a3b>   DW_AT_decl_line   : 553
    <a3d>   DW_AT_decl_column : 5
    <a3d>   DW_AT_prototyped  : 1
    <a3d>   DW_AT_type        : <0x317>
    <a41>   DW_AT_low_pc      : 0x800161a
    <a45>   DW_AT_high_pc     : 0x46
    <a49>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a4b>   DW_AT_call_all_calls: 1
    <a4b>   DW_AT_sibling     : <0xa5d>
 <2><a4f>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a50>   DW_AT_name        : p
    <a52>   DW_AT_decl_file   : 1
    <a52>   DW_AT_decl_line   : 553
    <a54>   DW_AT_decl_column : 51
    <a55>   DW_AT_type        : <0xa31>
    <a59>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><a5c>: Abbrev Number: 0
 <1><a5d>: Abbrev Number: 5 (DW_TAG_subprogram)
    <a5e>   DW_AT_external    : 1
    <a5e>   DW_AT_name        : (indirect string, offset: 0x3b02): L6474_ResetStandBy
    <a62>   DW_AT_decl_file   : 1
    <a62>   DW_AT_decl_line   : 511
    <a64>   DW_AT_decl_column : 5
    <a65>   DW_AT_prototyped  : 1
    <a65>   DW_AT_type        : <0x317>
    <a69>   DW_AT_low_pc      : 0x800159a
    <a6d>   DW_AT_high_pc     : 0x80
    <a71>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a73>   DW_AT_call_all_tail_calls: 1
    <a73>   DW_AT_sibling     : <0xa9e>
 <2><a77>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a78>   DW_AT_name        : h
    <a7a>   DW_AT_decl_file   : 1
    <a7a>   DW_AT_decl_line   : 511
    <a7c>   DW_AT_decl_column : 39
    <a7d>   DW_AT_type        : <0x1f7>
    <a81>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><a84>: Abbrev Number: 36 (DW_TAG_lexical_block)
    <a85>   DW_AT_low_pc      : 0x80015ce
    <a89>   DW_AT_high_pc     : 0x1c
 <3><a8d>: Abbrev Number: 3 (DW_TAG_variable)
    <a8e>   DW_AT_name        : ret
    <a92>   DW_AT_decl_file   : 1
    <a92>   DW_AT_decl_line   : 534
    <a94>   DW_AT_decl_column : 7
    <a95>   DW_AT_type        : <0x317>
    <a99>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><a9c>: Abbrev Number: 0
 <2><a9d>: Abbrev Number: 0
 <1><a9e>: Abbrev Number: 5 (DW_TAG_subprogram)
    <a9f>   DW_AT_external    : 1
    <a9f>   DW_AT_name        : (indirect string, offset: 0x2c32): L6474_DestroyInstance
    <aa3>   DW_AT_decl_file   : 1
    <aa3>   DW_AT_decl_line   : 486
    <aa5>   DW_AT_decl_column : 5
    <aa6>   DW_AT_prototyped  : 1
    <aa6>   DW_AT_type        : <0x317>
    <aaa>   DW_AT_low_pc      : 0
    <aae>   DW_AT_high_pc     : 0x4a
    <ab2>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <ab4>   DW_AT_call_all_tail_calls: 1
    <ab4>   DW_AT_sibling     : <0xac6>
 <2><ab8>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <ab9>   DW_AT_name        : h
    <abb>   DW_AT_decl_file   : 1
    <abb>   DW_AT_decl_line   : 486
    <abd>   DW_AT_decl_column : 42
    <abe>   DW_AT_type        : <0x1f7>
    <ac2>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><ac5>: Abbrev Number: 0
 <1><ac6>: Abbrev Number: 5 (DW_TAG_subprogram)
    <ac7>   DW_AT_external    : 1
    <ac7>   DW_AT_name        : (indirect string, offset: 0x33fa): L6474_CreateInstance
    <acb>   DW_AT_decl_file   : 1
    <acb>   DW_AT_decl_line   : 440
    <acd>   DW_AT_decl_column : 16
    <ace>   DW_AT_prototyped  : 1
    <ace>   DW_AT_type        : <0x1f7>
    <ad2>   DW_AT_low_pc      : 0x80014f8
    <ad6>   DW_AT_high_pc     : 0xa2
    <ada>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <adc>   DW_AT_call_all_tail_calls: 1
    <adc>   DW_AT_sibling     : <0xb28>
 <2><ae0>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <ae1>   DW_AT_name        : p
    <ae3>   DW_AT_decl_file   : 1
    <ae3>   DW_AT_decl_line   : 440
    <ae5>   DW_AT_decl_column : 56
    <ae6>   DW_AT_type        : <0x4d2>
    <aea>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><aed>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <aee>   DW_AT_name        : pIO
    <af2>   DW_AT_decl_file   : 1
    <af2>   DW_AT_decl_line   : 440
    <af4>   DW_AT_decl_column : 65
    <af5>   DW_AT_type        : <0x2d0>
    <af9>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><afc>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <afd>   DW_AT_name        : (indirect string, offset: 0x2bb3): pGPO
    <b01>   DW_AT_decl_file   : 1
    <b01>   DW_AT_decl_line   : 440
    <b03>   DW_AT_decl_column : 76
    <b04>   DW_AT_type        : <0x2d0>
    <b08>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><b0b>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <b0c>   DW_AT_name        : (indirect string, offset: 0x398d): pPWM
    <b10>   DW_AT_decl_file   : 1
    <b10>   DW_AT_decl_line   : 440
    <b12>   DW_AT_decl_column : 88
    <b13>   DW_AT_type        : <0x2d0>
    <b17>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><b1a>: Abbrev Number: 3 (DW_TAG_variable)
    <b1b>   DW_AT_name        : h
    <b1d>   DW_AT_decl_file   : 1
    <b1d>   DW_AT_decl_line   : 467
    <b1f>   DW_AT_decl_column : 17
    <b20>   DW_AT_type        : <0x1f7>
    <b24>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><b27>: Abbrev Number: 0
 <1><b28>: Abbrev Number: 21 (DW_TAG_subprogram)
    <b29>   DW_AT_name        : (indirect string, offset: 0x2be9): L6474_DisableCommand
    <b2d>   DW_AT_decl_file   : 1
    <b2d>   DW_AT_decl_line   : 407
    <b2f>   DW_AT_decl_column : 12
    <b2f>   DW_AT_prototyped  : 1
    <b2f>   DW_AT_type        : <0x317>
    <b33>   DW_AT_low_pc      : 0x800147c
    <b37>   DW_AT_high_pc     : 0x7c
    <b3b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b3d>   DW_AT_call_all_tail_calls: 1
    <b3d>   DW_AT_sibling     : <0xb8b>
 <2><b41>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b42>   DW_AT_name        : h
    <b44>   DW_AT_decl_file   : 1
    <b44>   DW_AT_decl_line   : 407
    <b46>   DW_AT_decl_column : 48
    <b47>   DW_AT_type        : <0x1f7>
    <b4b>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><b4e>: Abbrev Number: 8 (DW_TAG_variable)
    <b4f>   DW_AT_name        : (indirect string, offset: 0x2d3c): length
    <b53>   DW_AT_decl_file   : 1
    <b53>   DW_AT_decl_line   : 413
    <b55>   DW_AT_decl_column : 6
    <b56>   DW_AT_type        : <0x317>
    <b5a>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><b5d>: Abbrev Number: 8 (DW_TAG_variable)
    <b5e>   DW_AT_name        : (indirect string, offset: 0x3ab7): rxBuff
    <b62>   DW_AT_decl_file   : 1
    <b62>   DW_AT_decl_line   : 415
    <b64>   DW_AT_decl_column : 16
    <b65>   DW_AT_type        : <0xb8b>
    <b69>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><b6c>: Abbrev Number: 8 (DW_TAG_variable)
    <b6d>   DW_AT_name        : (indirect string, offset: 0x2a3c): txBuff
    <b71>   DW_AT_decl_file   : 1
    <b71>   DW_AT_decl_line   : 416
    <b73>   DW_AT_decl_column : 16
    <b74>   DW_AT_type        : <0xb8b>
    <b78>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><b7b>: Abbrev Number: 3 (DW_TAG_variable)
    <b7c>   DW_AT_name        : ret
    <b80>   DW_AT_decl_file   : 1
    <b80>   DW_AT_decl_line   : 419
    <b82>   DW_AT_decl_column : 6
    <b83>   DW_AT_type        : <0x317>
    <b87>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><b8a>: Abbrev Number: 0
 <1><b8b>: Abbrev Number: 19 (DW_TAG_array_type)
    <b8c>   DW_AT_type        : <0x53>
    <b90>   DW_AT_sibling     : <0xb9b>
 <2><b94>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <b95>   DW_AT_type        : <0x2d2>
    <b99>   DW_AT_upper_bound : 0
 <2><b9a>: Abbrev Number: 0
 <1><b9b>: Abbrev Number: 21 (DW_TAG_subprogram)
    <b9c>   DW_AT_name        : (indirect string, offset: 0x2f0e): L6474_EnableCommand
    <ba0>   DW_AT_decl_file   : 1
    <ba0>   DW_AT_decl_line   : 376
    <ba2>   DW_AT_decl_column : 12
    <ba2>   DW_AT_prototyped  : 1
    <ba2>   DW_AT_type        : <0x317>
    <ba6>   DW_AT_low_pc      : 0x80013f4
    <baa>   DW_AT_high_pc     : 0x88
    <bae>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <bb0>   DW_AT_call_all_tail_calls: 1
    <bb0>   DW_AT_sibling     : <0xbfe>
 <2><bb4>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <bb5>   DW_AT_name        : h
    <bb7>   DW_AT_decl_file   : 1
    <bb7>   DW_AT_decl_line   : 376
    <bb9>   DW_AT_decl_column : 47
    <bba>   DW_AT_type        : <0x1f7>
    <bbe>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><bc1>: Abbrev Number: 8 (DW_TAG_variable)
    <bc2>   DW_AT_name        : (indirect string, offset: 0x2d3c): length
    <bc6>   DW_AT_decl_file   : 1
    <bc6>   DW_AT_decl_line   : 385
    <bc8>   DW_AT_decl_column : 6
    <bc9>   DW_AT_type        : <0x317>
    <bcd>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><bd0>: Abbrev Number: 8 (DW_TAG_variable)
    <bd1>   DW_AT_name        : (indirect string, offset: 0x3ab7): rxBuff
    <bd5>   DW_AT_decl_file   : 1
    <bd5>   DW_AT_decl_line   : 387
    <bd7>   DW_AT_decl_column : 16
    <bd8>   DW_AT_type        : <0xb8b>
    <bdc>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><bdf>: Abbrev Number: 8 (DW_TAG_variable)
    <be0>   DW_AT_name        : (indirect string, offset: 0x2a3c): txBuff
    <be4>   DW_AT_decl_file   : 1
    <be4>   DW_AT_decl_line   : 388
    <be6>   DW_AT_decl_column : 16
    <be7>   DW_AT_type        : <0xb8b>
    <beb>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><bee>: Abbrev Number: 3 (DW_TAG_variable)
    <bef>   DW_AT_name        : ret
    <bf3>   DW_AT_decl_file   : 1
    <bf3>   DW_AT_decl_line   : 391
    <bf5>   DW_AT_decl_column : 6
    <bf6>   DW_AT_type        : <0x317>
    <bfa>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><bfd>: Abbrev Number: 0
 <1><bfe>: Abbrev Number: 21 (DW_TAG_subprogram)
    <bff>   DW_AT_name        : (indirect string, offset: 0xa38): L6474_SetParamCommand
    <c03>   DW_AT_decl_file   : 1
    <c03>   DW_AT_decl_line   : 316
    <c05>   DW_AT_decl_column : 12
    <c05>   DW_AT_prototyped  : 1
    <c05>   DW_AT_type        : <0x317>
    <c09>   DW_AT_low_pc      : 0x8001274
    <c0d>   DW_AT_high_pc     : 0x180
    <c11>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c13>   DW_AT_call_all_tail_calls: 1
    <c13>   DW_AT_sibling     : <0xc9d>
 <2><c17>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <c18>   DW_AT_name        : h
    <c1a>   DW_AT_decl_file   : 1
    <c1a>   DW_AT_decl_line   : 316
    <c1c>   DW_AT_decl_column : 49
    <c1d>   DW_AT_type        : <0x1f7>
    <c21>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><c24>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c25>   DW_AT_name        : (indirect string, offset: 0x36d9): addr
    <c29>   DW_AT_decl_file   : 1
    <c29>   DW_AT_decl_line   : 316
    <c2b>   DW_AT_decl_column : 56
    <c2c>   DW_AT_type        : <0x317>
    <c30>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><c33>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c34>   DW_AT_name        : (indirect string, offset: 0xfe4a0): value
    <c38>   DW_AT_decl_file   : 1
    <c38>   DW_AT_decl_line   : 316
    <c3a>   DW_AT_decl_column : 66
    <c3b>   DW_AT_type        : <0x317>
    <c3f>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><c42>: Abbrev Number: 8 (DW_TAG_variable)
    <c43>   DW_AT_name        : (indirect string, offset: 0x2d3c): length
    <c47>   DW_AT_decl_file   : 1
    <c47>   DW_AT_decl_line   : 329
    <c49>   DW_AT_decl_column : 6
    <c4a>   DW_AT_type        : <0x317>
    <c4e>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><c51>: Abbrev Number: 8 (DW_TAG_variable)
    <c52>   DW_AT_name        : (indirect string, offset: 0x3ab7): rxBuff
    <c56>   DW_AT_decl_file   : 1
    <c56>   DW_AT_decl_line   : 333
    <c58>   DW_AT_decl_column : 16
    <c59>   DW_AT_type        : <0xc9d>
    <c5d>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><c60>: Abbrev Number: 8 (DW_TAG_variable)
    <c61>   DW_AT_name        : (indirect string, offset: 0x2a3c): txBuff
    <c65>   DW_AT_decl_file   : 1
    <c65>   DW_AT_decl_line   : 334
    <c67>   DW_AT_decl_column : 16
    <c68>   DW_AT_type        : <0xc9d>
    <c6c>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><c6f>: Abbrev Number: 3 (DW_TAG_variable)
    <c70>   DW_AT_name        : tmp
    <c74>   DW_AT_decl_file   : 1
    <c74>   DW_AT_decl_line   : 335
    <c76>   DW_AT_decl_column : 16
    <c77>   DW_AT_type        : <0x2d2>
    <c7b>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><c7e>: Abbrev Number: 3 (DW_TAG_variable)
    <c7f>   DW_AT_name        : ret
    <c83>   DW_AT_decl_file   : 1
    <c83>   DW_AT_decl_line   : 360
    <c85>   DW_AT_decl_column : 6
    <c86>   DW_AT_type        : <0x317>
    <c8a>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><c8d>: Abbrev Number: 3 (DW_TAG_variable)
    <c8e>   DW_AT_name        : res
    <c92>   DW_AT_decl_file   : 1
    <c92>   DW_AT_decl_line   : 365
    <c94>   DW_AT_decl_column : 6
    <c95>   DW_AT_type        : <0x317>
    <c99>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><c9c>: Abbrev Number: 0
 <1><c9d>: Abbrev Number: 19 (DW_TAG_array_type)
    <c9e>   DW_AT_type        : <0x53>
    <ca2>   DW_AT_sibling     : <0xcad>
 <2><ca6>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <ca7>   DW_AT_type        : <0x2d2>
    <cab>   DW_AT_upper_bound : 3
 <2><cac>: Abbrev Number: 0
 <1><cad>: Abbrev Number: 21 (DW_TAG_subprogram)
    <cae>   DW_AT_name        : (indirect string, offset: 0x352e): L6474_GetParamCommand
    <cb2>   DW_AT_decl_file   : 1
    <cb2>   DW_AT_decl_line   : 257
    <cb4>   DW_AT_decl_column : 12
    <cb4>   DW_AT_prototyped  : 1
    <cb4>   DW_AT_type        : <0x317>
    <cb8>   DW_AT_low_pc      : 0x8001114
    <cbc>   DW_AT_high_pc     : 0x160
    <cc0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cc2>   DW_AT_call_all_tail_calls: 1
    <cc2>   DW_AT_sibling     : <0xd4c>
 <2><cc6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <cc7>   DW_AT_name        : h
    <cc9>   DW_AT_decl_file   : 1
    <cc9>   DW_AT_decl_line   : 257
    <ccb>   DW_AT_decl_column : 49
    <ccc>   DW_AT_type        : <0x1f7>
    <cd0>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><cd3>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <cd4>   DW_AT_name        : (indirect string, offset: 0x36d9): addr
    <cd8>   DW_AT_decl_file   : 1
    <cd8>   DW_AT_decl_line   : 257
    <cda>   DW_AT_decl_column : 56
    <cdb>   DW_AT_type        : <0x317>
    <cdf>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><ce2>: Abbrev Number: 8 (DW_TAG_variable)
    <ce3>   DW_AT_name        : (indirect string, offset: 0x2d3c): length
    <ce7>   DW_AT_decl_file   : 1
    <ce7>   DW_AT_decl_line   : 270
    <ce9>   DW_AT_decl_column : 6
    <cea>   DW_AT_type        : <0x317>
    <cee>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><cf1>: Abbrev Number: 8 (DW_TAG_variable)
    <cf2>   DW_AT_name        : (indirect string, offset: 0x3ab7): rxBuff
    <cf6>   DW_AT_decl_file   : 1
    <cf6>   DW_AT_decl_line   : 274
    <cf8>   DW_AT_decl_column : 16
    <cf9>   DW_AT_type        : <0xc9d>
    <cfd>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><d00>: Abbrev Number: 8 (DW_TAG_variable)
    <d01>   DW_AT_name        : (indirect string, offset: 0x2a3c): txBuff
    <d05>   DW_AT_decl_file   : 1
    <d05>   DW_AT_decl_line   : 275
    <d07>   DW_AT_decl_column : 16
    <d08>   DW_AT_type        : <0xc9d>
    <d0c>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><d0f>: Abbrev Number: 3 (DW_TAG_variable)
    <d10>   DW_AT_name        : ret
    <d14>   DW_AT_decl_file   : 1
    <d14>   DW_AT_decl_line   : 278
    <d16>   DW_AT_decl_column : 6
    <d17>   DW_AT_type        : <0x317>
    <d1b>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><d1e>: Abbrev Number: 3 (DW_TAG_variable)
    <d1f>   DW_AT_name        : res
    <d23>   DW_AT_decl_file   : 1
    <d23>   DW_AT_decl_line   : 283
    <d25>   DW_AT_decl_column : 6
    <d26>   DW_AT_type        : <0x317>
    <d2a>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><d2d>: Abbrev Number: 3 (DW_TAG_variable)
    <d2e>   DW_AT_name        : tmp
    <d32>   DW_AT_decl_file   : 1
    <d32>   DW_AT_decl_line   : 284
    <d34>   DW_AT_decl_column : 15
    <d35>   DW_AT_type        : <0x2d2>
    <d39>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><d3c>: Abbrev Number: 8 (DW_TAG_variable)
    <d3d>   DW_AT_name        : (indirect string, offset: 0x3574): opres
    <d41>   DW_AT_decl_file   : 1
    <d41>   DW_AT_decl_line   : 305
    <d43>   DW_AT_decl_column : 6
    <d44>   DW_AT_type        : <0x317>
    <d48>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><d4b>: Abbrev Number: 0
 <1><d4c>: Abbrev Number: 27 (DW_TAG_subprogram)
    <d4d>   DW_AT_name        : (indirect string, offset: 0x3c0): L6474_NopCommand
    <d51>   DW_AT_decl_file   : 1
    <d51>   DW_AT_decl_line   : 236
    <d52>   DW_AT_decl_column : 12
    <d52>   DW_AT_prototyped  : 1
    <d52>   DW_AT_type        : <0x317>
    <d56>   DW_AT_low_pc      : 0
    <d5a>   DW_AT_high_pc     : 0x54
    <d5e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d60>   DW_AT_call_all_tail_calls: 1
    <d60>   DW_AT_sibling     : <0xda8>
 <2><d64>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <d65>   DW_AT_name        : h
    <d67>   DW_AT_decl_file   : 1
    <d67>   DW_AT_decl_line   : 236
    <d68>   DW_AT_decl_column : 44
    <d69>   DW_AT_type        : <0x1f7>
    <d6d>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><d70>: Abbrev Number: 12 (DW_TAG_variable)
    <d71>   DW_AT_name        : (indirect string, offset: 0x2d3c): length
    <d75>   DW_AT_decl_file   : 1
    <d75>   DW_AT_decl_line   : 242
    <d76>   DW_AT_decl_column : 6
    <d77>   DW_AT_type        : <0x317>
    <d7b>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><d7e>: Abbrev Number: 12 (DW_TAG_variable)
    <d7f>   DW_AT_name        : (indirect string, offset: 0x3ab7): rxBuff
    <d83>   DW_AT_decl_file   : 1
    <d83>   DW_AT_decl_line   : 244
    <d84>   DW_AT_decl_column : 16
    <d85>   DW_AT_type        : <0xb8b>
    <d89>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><d8c>: Abbrev Number: 12 (DW_TAG_variable)
    <d8d>   DW_AT_name        : (indirect string, offset: 0x2a3c): txBuff
    <d91>   DW_AT_decl_file   : 1
    <d91>   DW_AT_decl_line   : 245
    <d92>   DW_AT_decl_column : 16
    <d93>   DW_AT_type        : <0xb8b>
    <d97>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><d9a>: Abbrev Number: 28 (DW_TAG_variable)
    <d9b>   DW_AT_name        : ret
    <d9f>   DW_AT_decl_file   : 1
    <d9f>   DW_AT_decl_line   : 248
    <da0>   DW_AT_decl_column : 6
    <da0>   DW_AT_type        : <0x317>
    <da4>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><da7>: Abbrev Number: 0
 <1><da8>: Abbrev Number: 27 (DW_TAG_subprogram)
    <da9>   DW_AT_name        : (indirect string, offset: 0x3b7a): L6474_GetStatusCommand
    <dad>   DW_AT_decl_file   : 1
    <dad>   DW_AT_decl_line   : 212
    <dae>   DW_AT_decl_column : 12
    <dae>   DW_AT_prototyped  : 1
    <dae>   DW_AT_type        : <0x317>
    <db2>   DW_AT_low_pc      : 0x800108a
    <db6>   DW_AT_high_pc     : 0x88
    <dba>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <dbc>   DW_AT_call_all_tail_calls: 1
    <dbc>   DW_AT_sibling     : <0xe04>
 <2><dc0>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <dc1>   DW_AT_name        : h
    <dc3>   DW_AT_decl_file   : 1
    <dc3>   DW_AT_decl_line   : 212
    <dc4>   DW_AT_decl_column : 50
    <dc5>   DW_AT_type        : <0x1f7>
    <dc9>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><dcc>: Abbrev Number: 12 (DW_TAG_variable)
    <dcd>   DW_AT_name        : (indirect string, offset: 0x2d3c): length
    <dd1>   DW_AT_decl_file   : 1
    <dd1>   DW_AT_decl_line   : 218
    <dd2>   DW_AT_decl_column : 6
    <dd3>   DW_AT_type        : <0x317>
    <dd7>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><dda>: Abbrev Number: 12 (DW_TAG_variable)
    <ddb>   DW_AT_name        : (indirect string, offset: 0x3ab7): rxBuff
    <ddf>   DW_AT_decl_file   : 1
    <ddf>   DW_AT_decl_line   : 220
    <de0>   DW_AT_decl_column : 16
    <de1>   DW_AT_type        : <0xe04>
    <de5>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><de8>: Abbrev Number: 12 (DW_TAG_variable)
    <de9>   DW_AT_name        : (indirect string, offset: 0x2a3c): txBuff
    <ded>   DW_AT_decl_file   : 1
    <ded>   DW_AT_decl_line   : 221
    <dee>   DW_AT_decl_column : 16
    <def>   DW_AT_type        : <0xe04>
    <df3>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><df6>: Abbrev Number: 28 (DW_TAG_variable)
    <df7>   DW_AT_name        : ret
    <dfb>   DW_AT_decl_file   : 1
    <dfb>   DW_AT_decl_line   : 224
    <dfc>   DW_AT_decl_column : 6
    <dfc>   DW_AT_type        : <0x317>
    <e00>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><e03>: Abbrev Number: 0
 <1><e04>: Abbrev Number: 19 (DW_TAG_array_type)
    <e05>   DW_AT_type        : <0x53>
    <e09>   DW_AT_sibling     : <0xe14>
 <2><e0d>: Abbrev Number: 20 (DW_TAG_subrange_type)
    <e0e>   DW_AT_type        : <0x2d2>
    <e12>   DW_AT_upper_bound : 2
 <2><e13>: Abbrev Number: 0
 <1><e14>: Abbrev Number: 37 (DW_TAG_subprogram)
    <e15>   DW_AT_name        : (indirect string, offset: 0x3353): L6474_HelperReleaseStep
    <e19>   DW_AT_decl_file   : 1
    <e1a>   DW_AT_decl_line   : 203
    <e1b>   DW_AT_decl_column : 13
    <e1c>   DW_AT_prototyped  : 1
    <e1c>   DW_AT_low_pc      : 0
    <e20>   DW_AT_high_pc     : 0x22
    <e24>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e26>   DW_AT_call_all_tail_calls: 1
    <e26>   DW_AT_sibling     : <0xe37>
 <2><e2a>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <e2b>   DW_AT_name        : h
    <e2d>   DW_AT_decl_file   : 1
    <e2d>   DW_AT_decl_line   : 203
    <e2e>   DW_AT_decl_column : 52
    <e2f>   DW_AT_type        : <0x1f7>
    <e33>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><e36>: Abbrev Number: 0
 <1><e37>: Abbrev Number: 38 (DW_TAG_subprogram)
    <e38>   DW_AT_name        : (indirect string, offset: 0x13): L6474_HelperUnlock
    <e3c>   DW_AT_decl_file   : 1
    <e3d>   DW_AT_decl_line   : 190
    <e3e>   DW_AT_decl_column : 20
    <e3f>   DW_AT_prototyped  : 1
    <e3f>   DW_AT_low_pc      : 0x8001076
    <e43>   DW_AT_high_pc     : 0x14
    <e47>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e49>   DW_AT_call_all_calls: 1
    <e49>   DW_AT_sibling     : <0xe5a>
 <2><e4d>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <e4e>   DW_AT_name        : h
    <e50>   DW_AT_decl_file   : 1
    <e50>   DW_AT_decl_line   : 190
    <e51>   DW_AT_decl_column : 54
    <e52>   DW_AT_type        : <0x1f7>
    <e56>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><e59>: Abbrev Number: 0
 <1><e5a>: Abbrev Number: 39 (DW_TAG_subprogram)
    <e5b>   DW_AT_name        : (indirect string, offset: 0x18f1): L6474_HelperLock
    <e5f>   DW_AT_decl_file   : 1
    <e60>   DW_AT_decl_line   : 178
    <e61>   DW_AT_decl_column : 19
    <e62>   DW_AT_prototyped  : 1
    <e62>   DW_AT_type        : <0x317>
    <e66>   DW_AT_low_pc      : 0x8001060
    <e6a>   DW_AT_high_pc     : 0x16
    <e6e>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e70>   DW_AT_call_all_calls: 1
 <2><e70>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <e71>   DW_AT_name        : h
    <e73>   DW_AT_decl_file   : 1
    <e73>   DW_AT_decl_line   : 178
    <e74>   DW_AT_decl_column : 51
    <e75>   DW_AT_type        : <0x1f7>
    <e79>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><e7c>: Abbrev Number: 0
 <1><e7d>: Abbrev Number: 0
  Compilation Unit @ offset 0xe7e:
   Length:        0x2054 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x281
   Pointer Size:  4
 <0><e8a>: Abbrev Number: 49 (DW_TAG_compile_unit)
    <e8b>   DW_AT_producer    : (indirect string, offset: 0x2430): GNU C17 13.3.1 20240614 -mcpu=cortex-m7 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fpv5 -g3 -O0 -std=gnu17 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <e8f>   DW_AT_language    : 29	(C11)
    <e90>   DW_AT_name        : (indirect string, offset: 0xdf96b): ../Core/Src/main.c
    <e94>   DW_AT_comp_dir    : (indirect string, offset: 0x11a): C:/Users/hans-/Nextcloud/Documents/DHBW/Labor/Labor_HWNahesProg_Echtzeitsysteme/Semester4/Solution/stepper/Debug
    <e98>   DW_AT_ranges      : 0xe7
    <e9c>   DW_AT_low_pc      : 0
    <ea0>   DW_AT_stmt_list   : 0xda9
    <ea4>   DW_AT_macros      : 0x21a
 <1><ea8>: Abbrev Number: 15 (DW_TAG_base_type)
    <ea9>   DW_AT_byte_size   : 1
    <eaa>   DW_AT_encoding    : 6	(signed char)
    <eab>   DW_AT_name        : (indirect string, offset: 0x2e2f): signed char
 <1><eaf>: Abbrev Number: 6 (DW_TAG_typedef)
    <eb0>   DW_AT_name        : (indirect string, offset: 0x4b375): __uint8_t
    <eb4>   DW_AT_decl_file   : 4
    <eb5>   DW_AT_decl_line   : 43
    <eb6>   DW_AT_decl_column : 24
    <eb7>   DW_AT_type        : <0xebb>
 <1><ebb>: Abbrev Number: 15 (DW_TAG_base_type)
    <ebc>   DW_AT_byte_size   : 1
    <ebd>   DW_AT_encoding    : 8	(unsigned char)
    <ebe>   DW_AT_name        : (indirect string, offset: 0x304a): unsigned char
 <1><ec2>: Abbrev Number: 15 (DW_TAG_base_type)
    <ec3>   DW_AT_byte_size   : 2
    <ec4>   DW_AT_encoding    : 5	(signed)
    <ec5>   DW_AT_name        : (indirect string, offset: 0x801): short int
 <1><ec9>: Abbrev Number: 6 (DW_TAG_typedef)
    <eca>   DW_AT_name        : (indirect string, offset: 0xcd999): __uint16_t
    <ece>   DW_AT_decl_file   : 4
    <ecf>   DW_AT_decl_line   : 57
    <ed0>   DW_AT_decl_column : 25
    <ed1>   DW_AT_type        : <0xed5>
 <1><ed5>: Abbrev Number: 15 (DW_TAG_base_type)
    <ed6>   DW_AT_byte_size   : 2
    <ed7>   DW_AT_encoding    : 7	(unsigned)
    <ed8>   DW_AT_name        : (indirect string, offset: 0x618): short unsigned int
 <1><edc>: Abbrev Number: 15 (DW_TAG_base_type)
    <edd>   DW_AT_byte_size   : 4
    <ede>   DW_AT_encoding    : 5	(signed)
    <edf>   DW_AT_name        : (indirect string, offset: 0x2c95): long int
 <1><ee3>: Abbrev Number: 6 (DW_TAG_typedef)
    <ee4>   DW_AT_name        : (indirect string, offset: 0xa13c8): __uint32_t
    <ee8>   DW_AT_decl_file   : 4
    <ee9>   DW_AT_decl_line   : 79
    <eea>   DW_AT_decl_column : 25
    <eeb>   DW_AT_type        : <0xeef>
 <1><eef>: Abbrev Number: 15 (DW_TAG_base_type)
    <ef0>   DW_AT_byte_size   : 4
    <ef1>   DW_AT_encoding    : 7	(unsigned)
    <ef2>   DW_AT_name        : (indirect string, offset: 0x289e): long unsigned int
 <1><ef6>: Abbrev Number: 15 (DW_TAG_base_type)
    <ef7>   DW_AT_byte_size   : 8
    <ef8>   DW_AT_encoding    : 5	(signed)
    <ef9>   DW_AT_name        : (indirect string, offset: 0x25fa): long long int
 <1><efd>: Abbrev Number: 6 (DW_TAG_typedef)
    <efe>   DW_AT_name        : (indirect string, offset: 0x74d83): __uint64_t
    <f02>   DW_AT_decl_file   : 4
    <f03>   DW_AT_decl_line   : 105
    <f04>   DW_AT_decl_column : 25
    <f05>   DW_AT_type        : <0xf09>
 <1><f09>: Abbrev Number: 15 (DW_TAG_base_type)
    <f0a>   DW_AT_byte_size   : 8
    <f0b>   DW_AT_encoding    : 7	(unsigned)
    <f0c>   DW_AT_name        : (indirect string, offset: 0x1b40): long long unsigned int
 <1><f10>: Abbrev Number: 50 (DW_TAG_base_type)
    <f11>   DW_AT_byte_size   : 4
    <f12>   DW_AT_encoding    : 5	(signed)
    <f13>   DW_AT_name        : int
 <1><f17>: Abbrev Number: 12 (DW_TAG_const_type)
    <f18>   DW_AT_type        : <0xf10>
 <1><f1c>: Abbrev Number: 15 (DW_TAG_base_type)
    <f1d>   DW_AT_byte_size   : 4
    <f1e>   DW_AT_encoding    : 7	(unsigned)
    <f1f>   DW_AT_name        : (indirect string, offset: 0x2cf5): unsigned int
 <1><f23>: Abbrev Number: 6 (DW_TAG_typedef)
    <f24>   DW_AT_name        : (indirect string, offset: 0x4b377): uint8_t
    <f28>   DW_AT_decl_file   : 5
    <f29>   DW_AT_decl_line   : 24
    <f2a>   DW_AT_decl_column : 19
    <f2b>   DW_AT_type        : <0xeaf>
 <1><f2f>: Abbrev Number: 12 (DW_TAG_const_type)
    <f30>   DW_AT_type        : <0xf23>
 <1><f34>: Abbrev Number: 6 (DW_TAG_typedef)
    <f35>   DW_AT_name        : (indirect string, offset: 0xcd99b): uint16_t
    <f39>   DW_AT_decl_file   : 5
    <f3a>   DW_AT_decl_line   : 36
    <f3b>   DW_AT_decl_column : 20
    <f3c>   DW_AT_type        : <0xec9>
 <1><f40>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <f41>   DW_AT_type        : <0xf34>
 <1><f45>: Abbrev Number: 6 (DW_TAG_typedef)
    <f46>   DW_AT_name        : (indirect string, offset: 0xefb9a): uint32_t
    <f4a>   DW_AT_decl_file   : 5
    <f4b>   DW_AT_decl_line   : 48
    <f4c>   DW_AT_decl_column : 20
    <f4d>   DW_AT_type        : <0xee3>
 <1><f51>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <f52>   DW_AT_type        : <0xf45>
 <1><f56>: Abbrev Number: 6 (DW_TAG_typedef)
    <f57>   DW_AT_name        : (indirect string, offset: 0x74d85): uint64_t
    <f5b>   DW_AT_decl_file   : 5
    <f5c>   DW_AT_decl_line   : 60
    <f5d>   DW_AT_decl_column : 20
    <f5e>   DW_AT_type        : <0xefd>
 <1><f62>: Abbrev Number: 20 (DW_TAG_array_type)
    <f63>   DW_AT_type        : <0xf45>
    <f67>   DW_AT_sibling     : <0xf72>
 <2><f6b>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <f6c>   DW_AT_type        : <0xf1c>
    <f70>   DW_AT_upper_bound : 1
 <2><f71>: Abbrev Number: 0
 <1><f72>: Abbrev Number: 16 (DW_TAG_structure_type)
    <f73>   DW_AT_byte_size   : 24
    <f74>   DW_AT_decl_file   : 6
    <f75>   DW_AT_decl_line   : 372
    <f77>   DW_AT_decl_column : 9
    <f77>   DW_AT_sibling     : <0xfc9>
 <2><f7b>: Abbrev Number: 7 (DW_TAG_member)
    <f7c>   DW_AT_name        : CR
    <f7f>   DW_AT_decl_file   : 6
    <f7f>   DW_AT_decl_line   : 374
    <f81>   DW_AT_decl_column : 17
    <f81>   DW_AT_type        : <0xf51>
    <f85>   DW_AT_data_member_location: 0
 <2><f86>: Abbrev Number: 2 (DW_TAG_member)
    <f87>   DW_AT_name        : (indirect string, offset: 0x21111): NDTR
    <f8b>   DW_AT_decl_file   : 6
    <f8c>   DW_AT_decl_line   : 375
    <f8e>   DW_AT_decl_column : 17
    <f8f>   DW_AT_type        : <0xf51>
    <f93>   DW_AT_data_member_location: 4
 <2><f94>: Abbrev Number: 7 (DW_TAG_member)
    <f95>   DW_AT_name        : PAR
    <f99>   DW_AT_decl_file   : 6
    <f99>   DW_AT_decl_line   : 376
    <f9b>   DW_AT_decl_column : 17
    <f9b>   DW_AT_type        : <0xf51>
    <f9f>   DW_AT_data_member_location: 8
 <2><fa0>: Abbrev Number: 2 (DW_TAG_member)
    <fa1>   DW_AT_name        : (indirect string, offset: 0x69f27): M0AR
    <fa5>   DW_AT_decl_file   : 6
    <fa6>   DW_AT_decl_line   : 377
    <fa8>   DW_AT_decl_column : 17
    <fa9>   DW_AT_type        : <0xf51>
    <fad>   DW_AT_data_member_location: 12
 <2><fae>: Abbrev Number: 2 (DW_TAG_member)
    <faf>   DW_AT_name        : (indirect string, offset: 0x8b567): M1AR
    <fb3>   DW_AT_decl_file   : 6
    <fb4>   DW_AT_decl_line   : 378
    <fb6>   DW_AT_decl_column : 17
    <fb7>   DW_AT_type        : <0xf51>
    <fbb>   DW_AT_data_member_location: 16
 <2><fbc>: Abbrev Number: 7 (DW_TAG_member)
    <fbd>   DW_AT_name        : FCR
    <fc1>   DW_AT_decl_file   : 6
    <fc1>   DW_AT_decl_line   : 379
    <fc3>   DW_AT_decl_column : 17
    <fc3>   DW_AT_type        : <0xf51>
    <fc7>   DW_AT_data_member_location: 20
 <2><fc8>: Abbrev Number: 0
 <1><fc9>: Abbrev Number: 10 (DW_TAG_typedef)
    <fca>   DW_AT_name        : (indirect string, offset: 0x221bb): DMA_Stream_TypeDef
    <fce>   DW_AT_decl_file   : 6
    <fcf>   DW_AT_decl_line   : 380
    <fd1>   DW_AT_decl_column : 3
    <fd2>   DW_AT_type        : <0xf72>
 <1><fd6>: Abbrev Number: 20 (DW_TAG_array_type)
    <fd7>   DW_AT_type        : <0xf51>
    <fdb>   DW_AT_sibling     : <0xfe6>
 <2><fdf>: Abbrev Number: 21 (DW_TAG_subrange_type)
    <fe0>   DW_AT_type        : <0xf1c>
    <fe4>   DW_AT_upper_bound : 1
 <2><fe5>: Abbrev Number: 0
 <1><fe6>: Abbrev Number: 13 (DW_TAG_volatile_type)
    <fe7>   DW_AT_type        : <0xfd6>
 <1><feb>: Abbrev Number: 16 (DW_TAG_structure_type)
    <fec>   DW_AT_byte_size   : 40
    <fed>   DW_AT_decl_file   : 6
    <fee>   DW_AT_decl_line   : 579
    <ff0>   DW_AT_decl_column : 9
    <ff0>   DW_AT_sibling     : <0x106d>
 <2><ff4>: Abbrev Number: 2 (DW_TAG_member)
    <ff5>   DW_AT_name        : (indirect string, offset: 0x5905): MODER
    <ff9>   DW_AT_decl_file   : 6
    <ffa>   DW_AT_decl_line   : 581
    <ffc>   DW_AT_decl_column : 17
    <ffd>   DW_AT_type        : <0xf51>
    <1001>   DW_AT_data_member_location: 0
 <2><1002>: Abbrev Number: 2 (DW_TAG_member)
    <1003>   DW_AT_name        : (indirect string, offset: 0xc34bf): OTYPER
    <1007>   DW_AT_decl_file   : 6
    <1008>   DW_AT_decl_line   : 582
    <100a>   DW_AT_decl_column : 17
    <100b>   DW_AT_type        : <0xf51>
    <100f>   DW_AT_data_member_location: 4
 <2><1010>: Abbrev Number: 2 (DW_TAG_member)
    <1011>   DW_AT_name        : (indirect string, offset: 0xda7ea): OSPEEDR
    <1015>   DW_AT_decl_file   : 6
    <1016>   DW_AT_decl_line   : 583
    <1018>   DW_AT_decl_column : 17
    <1019>   DW_AT_type        : <0xf51>
    <101d>   DW_AT_data_member_location: 8
 <2><101e>: Abbrev Number: 2 (DW_TAG_member)
    <101f>   DW_AT_name        : (indirect string, offset: 0xa4136): PUPDR
    <1023>   DW_AT_decl_file   : 6
    <1024>   DW_AT_decl_line   : 584
    <1026>   DW_AT_decl_column : 17
    <1027>   DW_AT_type        : <0xf51>
    <102b>   DW_AT_data_member_location: 12
 <2><102c>: Abbrev Number: 7 (DW_TAG_member)
    <102d>   DW_AT_name        : IDR
    <1031>   DW_AT_decl_file   : 6
    <1031>   DW_AT_decl_line   : 585
    <1033>   DW_AT_decl_column : 17
    <1033>   DW_AT_type        : <0xf51>
    <1037>   DW_AT_data_member_location: 16
 <2><1038>: Abbrev Number: 7 (DW_TAG_member)
    <1039>   DW_AT_name        : ODR
    <103d>   DW_AT_decl_file   : 6
    <103d>   DW_AT_decl_line   : 586
    <103f>   DW_AT_decl_column : 17
    <103f>   DW_AT_type        : <0xf51>
    <1043>   DW_AT_data_member_location: 20
 <2><1044>: Abbrev Number: 2 (DW_TAG_member)
    <1045>   DW_AT_name        : (indirect string, offset: 0x3b4f4): BSRR
    <1049>   DW_AT_decl_file   : 6
    <104a>   DW_AT_decl_line   : 587
    <104c>   DW_AT_decl_column : 17
    <104d>   DW_AT_type        : <0xf51>
    <1051>   DW_AT_data_member_location: 24
 <2><1052>: Abbrev Number: 2 (DW_TAG_member)
    <1053>   DW_AT_name        : (indirect string, offset: 0xd7ab9): LCKR
    <1057>   DW_AT_decl_file   : 6
    <1058>   DW_AT_decl_line   : 588
    <105a>   DW_AT_decl_column : 17
    <105b>   DW_AT_type        : <0xf51>
    <105f>   DW_AT_data_member_location: 28
 <2><1060>: Abbrev Number: 7 (DW_TAG_member)
    <1061>   DW_AT_name        : AFR
    <1065>   DW_AT_decl_file   : 6
    <1065>   DW_AT_decl_line   : 589
    <1067>   DW_AT_decl_column : 17
    <1067>   DW_AT_type        : <0xfe6>
    <106b>   DW_AT_data_member_location: 32
 <2><106c>: Abbrev Number: 0
 <1><106d>: Abbrev Number: 10 (DW_TAG_typedef)
    <106e>   DW_AT_name        : (indirect string, offset: 0xf2e31): GPIO_TypeDef
    <1072>   DW_AT_decl_file   : 6
    <1073>   DW_AT_decl_line   : 590
    <1075>   DW_AT_decl_column : 3
    <1076>   DW_AT_type        : <0xfeb>
 <1><107a>: Abbrev Number: 16 (DW_TAG_structure_type)
    <107b>   DW_AT_byte_size   : 16
    <107c>   DW_AT_decl_file   : 6
    <107d>   DW_AT_decl_line   : 690
    <107f>   DW_AT_decl_column : 9
    <107f>   DW_AT_sibling     : <0x10b8>
 <2><1083>: Abbrev Number: 7 (DW_TAG_member)
    <1084>   DW_AT_name        : CR1
    <1088>   DW_AT_decl_file   : 6
    <1088>   DW_AT_decl_line   : 692
    <108a>   DW_AT_decl_column : 17
    <108a>   DW_AT_type        : <0xf51>
    <108e>   DW_AT_data_member_location: 0
 <2><108f>: Abbrev Number: 2 (DW_TAG_member)
    <1090>   DW_AT_name        : (indirect string, offset: 0x6819f): CSR1
    <1094>   DW_AT_decl_file   : 6
    <1095>   DW_AT_decl_line   : 693
    <1097>   DW_AT_decl_column : 17
    <1098>   DW_AT_type        : <0xf51>
    <109c>   DW_AT_data_member_location: 4
 <2><109d>: Abbrev Number: 7 (DW_TAG_member)
    <109e>   DW_AT_name        : CR2
    <10a2>   DW_AT_decl_file   : 6
    <10a2>   DW_AT_decl_line   : 694
    <10a4>   DW_AT_decl_column : 17
    <10a4>   DW_AT_type        : <0xf51>
    <10a8>   DW_AT_data_member_location: 8
 <2><10a9>: Abbrev Number: 2 (DW_TAG_member)
    <10aa>   DW_AT_name        : (indirect string, offset: 0x681a4): CSR2
    <10ae>   DW_AT_decl_file   : 6
    <10af>   DW_AT_decl_line   : 695
    <10b1>   DW_AT_decl_column : 17
    <10b2>   DW_AT_type        : <0xf51>
    <10b6>   DW_AT_data_member_location: 12
 <2><10b7>: Abbrev Number: 0
 <1><10b8>: Abbrev Number: 10 (DW_TAG_typedef)
    <10b9>   DW_AT_name        : (indirect string, offset: 0xb70ae): PWR_TypeDef
    <10bd>   DW_AT_decl_file   : 6
    <10be>   DW_AT_decl_line   : 696
    <10c0>   DW_AT_decl_column : 3
    <10c1>   DW_AT_type        : <0x107a>
 <1><10c5>: Abbrev Number: 16 (DW_TAG_structure_type)
    <10c6>   DW_AT_byte_size   : 148
    <10c7>   DW_AT_decl_file   : 6
    <10c8>   DW_AT_decl_line   : 703
    <10ca>   DW_AT_decl_column : 9
    <10ca>   DW_AT_sibling     : <0x1296>
 <2><10ce>: Abbrev Number: 7 (DW_TAG_member)
    <10cf>   DW_AT_name        : CR
    <10d2>   DW_AT_decl_file   : 6
    <10d2>   DW_AT_decl_line   : 705
    <10d4>   DW_AT_decl_column : 17
    <10d4>   DW_AT_type        : <0xf51>
    <10d8>   DW_AT_data_member_location: 0
 <2><10d9>: Abbrev Number: 2 (DW_TAG_member)
    <10da>   DW_AT_name        : (indirect string, offset: 0xb17bd): PLLCFGR
    <10de>   DW_AT_decl_file   : 6
    <10df>   DW_AT_decl_line   : 706
    <10e1>   DW_AT_decl_column : 17
    <10e2>   DW_AT_type        : <0xf51>
    <10e6>   DW_AT_data_member_location: 4
 <2><10e7>: Abbrev Number: 2 (DW_TAG_member)
    <10e8>   DW_AT_name        : (indirect string, offset: 0x47cd7): CFGR
    <10ec>   DW_AT_decl_file   : 6
    <10ed>   DW_AT_decl_line   : 707
    <10ef>   DW_AT_decl_column : 17
    <10f0>   DW_AT_type        : <0xf51>
    <10f4>   DW_AT_data_member_location: 8
 <2><10f5>: Abbrev Number: 7 (DW_TAG_member)
    <10f6>   DW_AT_name        : CIR
    <10fa>   DW_AT_decl_file   : 6
    <10fa>   DW_AT_decl_line   : 708
    <10fc>   DW_AT_decl_column : 17
    <10fc>   DW_AT_type        : <0xf51>
    <1100>   DW_AT_data_member_location: 12
 <2><1101>: Abbrev Number: 2 (DW_TAG_member)
    <1102>   DW_AT_name        : (indirect string, offset: 0xc8dda): AHB1RSTR
    <1106>   DW_AT_decl_file   : 6
    <1107>   DW_AT_decl_line   : 709
    <1109>   DW_AT_decl_column : 17
    <110a>   DW_AT_type        : <0xf51>
    <110e>   DW_AT_data_member_location: 16
