Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0x18c0 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 38 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x70639): GNU C17 13.3.1 20240614 -mcpu=cortex-m7 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fpv5 -g3 -O0 -std=gnu17 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0xddc9e): ../Core/Src/main.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x6e330): C:/Users/hans-/Nextcloud/Documents/DHBW/Labor/Labor_HWNahesProg_Echtzeitsysteme/Semester4/Solution/stepper/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 12 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x7c2c9): signed char
 <1><31>: Abbrev Number: 5 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x4838c): __uint8_t
    <36>   DW_AT_decl_file   : 4
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 12 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0xefde9): unsigned char
 <1><44>: Abbrev Number: 12 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0xb9f28): short int
 <1><4b>: Abbrev Number: 5 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0xcba99): __uint16_t
    <50>   DW_AT_decl_file   : 4
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 12 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0xee410): short unsigned int
 <1><5e>: Abbrev Number: 12 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0x150c4): long int
 <1><65>: Abbrev Number: 5 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x9ef84): __uint32_t
    <6a>   DW_AT_decl_file   : 4
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 12 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x5ed2c): long unsigned int
 <1><78>: Abbrev Number: 12 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x71137): long long int
 <1><7f>: Abbrev Number: 12 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x340ba): long long unsigned int
 <1><86>: Abbrev Number: 39 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 12 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0x14390): unsigned int
 <1><94>: Abbrev Number: 5 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x4838e): uint8_t
    <99>   DW_AT_decl_file   : 5
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 15 (DW_TAG_const_type)
    <a1>   DW_AT_type        : <0x94>
 <1><a5>: Abbrev Number: 5 (DW_TAG_typedef)
    <a6>   DW_AT_name        : (indirect string, offset: 0xcba9b): uint16_t
    <aa>   DW_AT_decl_file   : 5
    <ab>   DW_AT_decl_line   : 36
    <ac>   DW_AT_decl_column : 20
    <ad>   DW_AT_type        : <0x4b>
 <1><b1>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <b2>   DW_AT_type        : <0xa5>
 <1><b6>: Abbrev Number: 5 (DW_TAG_typedef)
    <b7>   DW_AT_name        : (indirect string, offset: 0xee057): uint32_t
    <bb>   DW_AT_decl_file   : 5
    <bc>   DW_AT_decl_line   : 48
    <bd>   DW_AT_decl_column : 20
    <be>   DW_AT_type        : <0x65>
 <1><c2>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <c3>   DW_AT_type        : <0xb6>
 <1><c7>: Abbrev Number: 16 (DW_TAG_array_type)
    <c8>   DW_AT_type        : <0xb6>
    <cc>   DW_AT_sibling     : <0xd7>
 <2><d0>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <d1>   DW_AT_type        : <0x8d>
    <d5>   DW_AT_upper_bound : 1
 <2><d6>: Abbrev Number: 0
 <1><d7>: Abbrev Number: 14 (DW_TAG_structure_type)
    <d8>   DW_AT_byte_size   : 24
    <d9>   DW_AT_decl_file   : 6
    <da>   DW_AT_decl_line   : 372
    <dc>   DW_AT_decl_column : 9
    <dc>   DW_AT_sibling     : <0x12e>
 <2><e0>: Abbrev Number: 4 (DW_TAG_member)
    <e1>   DW_AT_name        : CR
    <e4>   DW_AT_decl_file   : 6
    <e4>   DW_AT_decl_line   : 374
    <e6>   DW_AT_decl_column : 17
    <e6>   DW_AT_type        : <0xc2>
    <ea>   DW_AT_data_member_location: 0
 <2><eb>: Abbrev Number: 2 (DW_TAG_member)
    <ec>   DW_AT_name        : (indirect string, offset: 0x1d939): NDTR
    <f0>   DW_AT_decl_file   : 6
    <f1>   DW_AT_decl_line   : 375
    <f3>   DW_AT_decl_column : 17
    <f4>   DW_AT_type        : <0xc2>
    <f8>   DW_AT_data_member_location: 4
 <2><f9>: Abbrev Number: 4 (DW_TAG_member)
    <fa>   DW_AT_name        : PAR
    <fe>   DW_AT_decl_file   : 6
    <fe>   DW_AT_decl_line   : 376
    <100>   DW_AT_decl_column : 17
    <100>   DW_AT_type        : <0xc2>
    <104>   DW_AT_data_member_location: 8
 <2><105>: Abbrev Number: 2 (DW_TAG_member)
    <106>   DW_AT_name        : (indirect string, offset: 0x670d8): M0AR
    <10a>   DW_AT_decl_file   : 6
    <10b>   DW_AT_decl_line   : 377
    <10d>   DW_AT_decl_column : 17
    <10e>   DW_AT_type        : <0xc2>
    <112>   DW_AT_data_member_location: 12
 <2><113>: Abbrev Number: 2 (DW_TAG_member)
    <114>   DW_AT_name        : (indirect string, offset: 0x89014): M1AR
    <118>   DW_AT_decl_file   : 6
    <119>   DW_AT_decl_line   : 378
    <11b>   DW_AT_decl_column : 17
    <11c>   DW_AT_type        : <0xc2>
    <120>   DW_AT_data_member_location: 16
 <2><121>: Abbrev Number: 4 (DW_TAG_member)
    <122>   DW_AT_name        : FCR
    <126>   DW_AT_decl_file   : 6
    <126>   DW_AT_decl_line   : 379
    <128>   DW_AT_decl_column : 17
    <128>   DW_AT_type        : <0xc2>
    <12c>   DW_AT_data_member_location: 20
 <2><12d>: Abbrev Number: 0
 <1><12e>: Abbrev Number: 9 (DW_TAG_typedef)
    <12f>   DW_AT_name        : (indirect string, offset: 0x1ea0c): DMA_Stream_TypeDef
    <133>   DW_AT_decl_file   : 6
    <134>   DW_AT_decl_line   : 380
    <136>   DW_AT_decl_column : 3
    <136>   DW_AT_type        : <0xd7>
 <1><13a>: Abbrev Number: 16 (DW_TAG_array_type)
    <13b>   DW_AT_type        : <0xc2>
    <13f>   DW_AT_sibling     : <0x14a>
 <2><143>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <144>   DW_AT_type        : <0x8d>
    <148>   DW_AT_upper_bound : 1
 <2><149>: Abbrev Number: 0
 <1><14a>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <14b>   DW_AT_type        : <0x13a>
 <1><14f>: Abbrev Number: 14 (DW_TAG_structure_type)
    <150>   DW_AT_byte_size   : 40
    <151>   DW_AT_decl_file   : 6
    <152>   DW_AT_decl_line   : 579
    <154>   DW_AT_decl_column : 9
    <154>   DW_AT_sibling     : <0x1d1>
 <2><158>: Abbrev Number: 2 (DW_TAG_member)
    <159>   DW_AT_name        : (indirect string, offset: 0x1b33): MODER
    <15d>   DW_AT_decl_file   : 6
    <15e>   DW_AT_decl_line   : 581
    <160>   DW_AT_decl_column : 17
    <161>   DW_AT_type        : <0xc2>
    <165>   DW_AT_data_member_location: 0
 <2><166>: Abbrev Number: 2 (DW_TAG_member)
    <167>   DW_AT_name        : (indirect string, offset: 0xc14e7): OTYPER
    <16b>   DW_AT_decl_file   : 6
    <16c>   DW_AT_decl_line   : 582
    <16e>   DW_AT_decl_column : 17
    <16f>   DW_AT_type        : <0xc2>
    <173>   DW_AT_data_member_location: 4
 <2><174>: Abbrev Number: 2 (DW_TAG_member)
    <175>   DW_AT_name        : (indirect string, offset: 0xd8981): OSPEEDR
    <179>   DW_AT_decl_file   : 6
    <17a>   DW_AT_decl_line   : 583
    <17c>   DW_AT_decl_column : 17
    <17d>   DW_AT_type        : <0xc2>
    <181>   DW_AT_data_member_location: 8
 <2><182>: Abbrev Number: 2 (DW_TAG_member)
    <183>   DW_AT_name        : (indirect string, offset: 0xa1d76): PUPDR
    <187>   DW_AT_decl_file   : 6
    <188>   DW_AT_decl_line   : 584
    <18a>   DW_AT_decl_column : 17
    <18b>   DW_AT_type        : <0xc2>
    <18f>   DW_AT_data_member_location: 12
 <2><190>: Abbrev Number: 4 (DW_TAG_member)
    <191>   DW_AT_name        : IDR
    <195>   DW_AT_decl_file   : 6
    <195>   DW_AT_decl_line   : 585
    <197>   DW_AT_decl_column : 17
    <197>   DW_AT_type        : <0xc2>
    <19b>   DW_AT_data_member_location: 16
 <2><19c>: Abbrev Number: 4 (DW_TAG_member)
    <19d>   DW_AT_name        : ODR
    <1a1>   DW_AT_decl_file   : 6
    <1a1>   DW_AT_decl_line   : 586
    <1a3>   DW_AT_decl_column : 17
    <1a3>   DW_AT_type        : <0xc2>
    <1a7>   DW_AT_data_member_location: 20
 <2><1a8>: Abbrev Number: 2 (DW_TAG_member)
    <1a9>   DW_AT_name        : (indirect string, offset: 0x38128): BSRR
    <1ad>   DW_AT_decl_file   : 6
    <1ae>   DW_AT_decl_line   : 587
    <1b0>   DW_AT_decl_column : 17
    <1b1>   DW_AT_type        : <0xc2>
    <1b5>   DW_AT_data_member_location: 24
 <2><1b6>: Abbrev Number: 2 (DW_TAG_member)
    <1b7>   DW_AT_name        : (indirect string, offset: 0xd5bf2): LCKR
    <1bb>   DW_AT_decl_file   : 6
    <1bc>   DW_AT_decl_line   : 588
    <1be>   DW_AT_decl_column : 17
    <1bf>   DW_AT_type        : <0xc2>
    <1c3>   DW_AT_data_member_location: 28
 <2><1c4>: Abbrev Number: 4 (DW_TAG_member)
    <1c5>   DW_AT_name        : AFR
    <1c9>   DW_AT_decl_file   : 6
    <1c9>   DW_AT_decl_line   : 589
    <1cb>   DW_AT_decl_column : 17
    <1cb>   DW_AT_type        : <0x14a>
    <1cf>   DW_AT_data_member_location: 32
 <2><1d0>: Abbrev Number: 0
 <1><1d1>: Abbrev Number: 9 (DW_TAG_typedef)
    <1d2>   DW_AT_name        : (indirect string, offset: 0xf146d): GPIO_TypeDef
    <1d6>   DW_AT_decl_file   : 6
    <1d7>   DW_AT_decl_line   : 590
    <1d9>   DW_AT_decl_column : 3
    <1d9>   DW_AT_type        : <0x14f>
 <1><1dd>: Abbrev Number: 14 (DW_TAG_structure_type)
    <1de>   DW_AT_byte_size   : 16
    <1df>   DW_AT_decl_file   : 6
    <1e0>   DW_AT_decl_line   : 690
    <1e2>   DW_AT_decl_column : 9
    <1e2>   DW_AT_sibling     : <0x21b>
 <2><1e6>: Abbrev Number: 4 (DW_TAG_member)
    <1e7>   DW_AT_name        : CR1
    <1eb>   DW_AT_decl_file   : 6
    <1eb>   DW_AT_decl_line   : 692
    <1ed>   DW_AT_decl_column : 17
    <1ed>   DW_AT_type        : <0xc2>
    <1f1>   DW_AT_data_member_location: 0
 <2><1f2>: Abbrev Number: 2 (DW_TAG_member)
    <1f3>   DW_AT_name        : (indirect string, offset: 0x65302): CSR1
    <1f7>   DW_AT_decl_file   : 6
    <1f8>   DW_AT_decl_line   : 693
    <1fa>   DW_AT_decl_column : 17
    <1fb>   DW_AT_type        : <0xc2>
    <1ff>   DW_AT_data_member_location: 4
 <2><200>: Abbrev Number: 4 (DW_TAG_member)
    <201>   DW_AT_name        : CR2
    <205>   DW_AT_decl_file   : 6
    <205>   DW_AT_decl_line   : 694
    <207>   DW_AT_decl_column : 17
    <207>   DW_AT_type        : <0xc2>
    <20b>   DW_AT_data_member_location: 8
 <2><20c>: Abbrev Number: 2 (DW_TAG_member)
    <20d>   DW_AT_name        : (indirect string, offset: 0x65307): CSR2
    <211>   DW_AT_decl_file   : 6
    <212>   DW_AT_decl_line   : 695
    <214>   DW_AT_decl_column : 17
    <215>   DW_AT_type        : <0xc2>
    <219>   DW_AT_data_member_location: 12
 <2><21a>: Abbrev Number: 0
 <1><21b>: Abbrev Number: 9 (DW_TAG_typedef)
    <21c>   DW_AT_name        : (indirect string, offset: 0xb4ed9): PWR_TypeDef
    <220>   DW_AT_decl_file   : 6
    <221>   DW_AT_decl_line   : 696
    <223>   DW_AT_decl_column : 3
    <223>   DW_AT_type        : <0x1dd>
 <1><227>: Abbrev Number: 14 (DW_TAG_structure_type)
    <228>   DW_AT_byte_size   : 148
    <229>   DW_AT_decl_file   : 6
    <22a>   DW_AT_decl_line   : 703
    <22c>   DW_AT_decl_column : 9
    <22c>   DW_AT_sibling     : <0x3f8>
 <2><230>: Abbrev Number: 4 (DW_TAG_member)
    <231>   DW_AT_name        : CR
    <234>   DW_AT_decl_file   : 6
    <234>   DW_AT_decl_line   : 705
    <236>   DW_AT_decl_column : 17
    <236>   DW_AT_type        : <0xc2>
    <23a>   DW_AT_data_member_location: 0
 <2><23b>: Abbrev Number: 2 (DW_TAG_member)
    <23c>   DW_AT_name        : (indirect string, offset: 0xaf4c9): PLLCFGR
    <240>   DW_AT_decl_file   : 6
    <241>   DW_AT_decl_line   : 706
    <243>   DW_AT_decl_column : 17
    <244>   DW_AT_type        : <0xc2>
    <248>   DW_AT_data_member_location: 4
 <2><249>: Abbrev Number: 2 (DW_TAG_member)
    <24a>   DW_AT_name        : (indirect string, offset: 0x44c18): CFGR
    <24e>   DW_AT_decl_file   : 6
    <24f>   DW_AT_decl_line   : 707
    <251>   DW_AT_decl_column : 17
    <252>   DW_AT_type        : <0xc2>
    <256>   DW_AT_data_member_location: 8
 <2><257>: Abbrev Number: 4 (DW_TAG_member)
    <258>   DW_AT_name        : CIR
    <25c>   DW_AT_decl_file   : 6
    <25c>   DW_AT_decl_line   : 708
    <25e>   DW_AT_decl_column : 17
    <25e>   DW_AT_type        : <0xc2>
    <262>   DW_AT_data_member_location: 12
 <2><263>: Abbrev Number: 2 (DW_TAG_member)
    <264>   DW_AT_name        : (indirect string, offset: 0xc6e53): AHB1RSTR
    <268>   DW_AT_decl_file   : 6
    <269>   DW_AT_decl_line   : 709
    <26b>   DW_AT_decl_column : 17
    <26c>   DW_AT_type        : <0xc2>
    <270>   DW_AT_data_member_location: 16
 <2><271>: Abbrev Number: 2 (DW_TAG_member)
    <272>   DW_AT_name        : (indirect string, offset: 0x1cbb0): AHB2RSTR
    <276>   DW_AT_decl_file   : 6
    <277>   DW_AT_decl_line   : 710
    <279>   DW_AT_decl_column : 17
    <27a>   DW_AT_type        : <0xc2>
    <27e>   DW_AT_data_member_location: 20
 <2><27f>: Abbrev Number: 2 (DW_TAG_member)
    <280>   DW_AT_name        : (indirect string, offset: 0x6c096): AHB3RSTR
    <284>   DW_AT_decl_file   : 6
    <285>   DW_AT_decl_line   : 711
    <287>   DW_AT_decl_column : 17
    <288>   DW_AT_type        : <0xc2>
    <28c>   DW_AT_data_member_location: 24
 <2><28d>: Abbrev Number: 2 (DW_TAG_member)
    <28e>   DW_AT_name        : (indirect string, offset: 0xea8f2): RESERVED0
    <292>   DW_AT_decl_file   : 6
    <293>   DW_AT_decl_line   : 712
    <295>   DW_AT_decl_column : 17
    <296>   DW_AT_type        : <0xb6>
    <29a>   DW_AT_data_member_location: 28
 <2><29b>: Abbrev Number: 2 (DW_TAG_member)
    <29c>   DW_AT_name        : (indirect string, offset: 0x1c694): APB1RSTR
    <2a0>   DW_AT_decl_file   : 6
    <2a1>   DW_AT_decl_line   : 713
    <2a3>   DW_AT_decl_column : 17
    <2a4>   DW_AT_type        : <0xc2>
    <2a8>   DW_AT_data_member_location: 32
 <2><2a9>: Abbrev Number: 2 (DW_TAG_member)
    <2aa>   DW_AT_name        : (indirect string, offset: 0x6ba88): APB2RSTR
    <2ae>   DW_AT_decl_file   : 6
    <2af>   DW_AT_decl_line   : 714
    <2b1>   DW_AT_decl_column : 17
    <2b2>   DW_AT_type        : <0xc2>
    <2b6>   DW_AT_data_member_location: 36
 <2><2b7>: Abbrev Number: 2 (DW_TAG_member)
    <2b8>   DW_AT_name        : (indirect string, offset: 0xea8fc): RESERVED1
    <2bc>   DW_AT_decl_file   : 6
    <2bd>   DW_AT_decl_line   : 715
    <2bf>   DW_AT_decl_column : 17
    <2c0>   DW_AT_type        : <0xc7>
    <2c4>   DW_AT_data_member_location: 40
 <2><2c5>: Abbrev Number: 2 (DW_TAG_member)
    <2c6>   DW_AT_name        : (indirect string, offset: 0x14325): AHB1ENR
    <2ca>   DW_AT_decl_file   : 6
    <2cb>   DW_AT_decl_line   : 716
    <2cd>   DW_AT_decl_column : 17
    <2ce>   DW_AT_type        : <0xc2>
    <2d2>   DW_AT_data_member_location: 48
 <2><2d3>: Abbrev Number: 2 (DW_TAG_member)
    <2d4>   DW_AT_name        : (indirect string, offset: 0x41fd5): AHB2ENR
    <2d8>   DW_AT_decl_file   : 6
    <2d9>   DW_AT_decl_line   : 717
    <2db>   DW_AT_decl_column : 17
    <2dc>   DW_AT_type        : <0xc2>
    <2e0>   DW_AT_data_member_location: 52
 <2><2e1>: Abbrev Number: 2 (DW_TAG_member)
    <2e2>   DW_AT_name        : (indirect string, offset: 0x6f27a): AHB3ENR
    <2e6>   DW_AT_decl_file   : 6
    <2e7>   DW_AT_decl_line   : 718
    <2e9>   DW_AT_decl_column : 17
    <2ea>   DW_AT_type        : <0xc2>
    <2ee>   DW_AT_data_member_location: 56
 <2><2ef>: Abbrev Number: 2 (DW_TAG_member)
    <2f0>   DW_AT_name        : (indirect string, offset: 0xea906): RESERVED2
    <2f4>   DW_AT_decl_file   : 6
    <2f5>   DW_AT_decl_line   : 719
    <2f7>   DW_AT_decl_column : 17
    <2f8>   DW_AT_type        : <0xb6>
    <2fc>   DW_AT_data_member_location: 60
 <2><2fd>: Abbrev Number: 2 (DW_TAG_member)
    <2fe>   DW_AT_name        : (indirect string, offset: 0x8f474): APB1ENR
    <302>   DW_AT_decl_file   : 6
    <303>   DW_AT_decl_line   : 720
    <305>   DW_AT_decl_column : 17
    <306>   DW_AT_type        : <0xc2>
    <30a>   DW_AT_data_member_location: 64
 <2><30b>: Abbrev Number: 2 (DW_TAG_member)
    <30c>   DW_AT_name        : (indirect string, offset: 0xd2e75): APB2ENR
    <310>   DW_AT_decl_file   : 6
    <311>   DW_AT_decl_line   : 721
    <313>   DW_AT_decl_column : 17
    <314>   DW_AT_type        : <0xc2>
    <318>   DW_AT_data_member_location: 68
 <2><319>: Abbrev Number: 2 (DW_TAG_member)
    <31a>   DW_AT_name        : (indirect string, offset: 0x9460f): RESERVED3
    <31e>   DW_AT_decl_file   : 6
    <31f>   DW_AT_decl_line   : 722
    <321>   DW_AT_decl_column : 17
    <322>   DW_AT_type        : <0xc7>
    <326>   DW_AT_data_member_location: 72
 <2><327>: Abbrev Number: 2 (DW_TAG_member)
    <328>   DW_AT_name        : (indirect string, offset: 0xcb920): AHB1LPENR
    <32c>   DW_AT_decl_file   : 6
    <32d>   DW_AT_decl_line   : 723
    <32f>   DW_AT_decl_column : 17
    <330>   DW_AT_type        : <0xc2>
    <334>   DW_AT_data_member_location: 80
 <2><335>: Abbrev Number: 2 (DW_TAG_member)
    <336>   DW_AT_name        : (indirect string, offset: 0x37c0c): AHB2LPENR
    <33a>   DW_AT_decl_file   : 6
    <33b>   DW_AT_decl_line   : 724
    <33d>   DW_AT_decl_column : 17
    <33e>   DW_AT_type        : <0xc2>
    <342>   DW_AT_data_member_location: 84
 <2><343>: Abbrev Number: 2 (DW_TAG_member)
    <344>   DW_AT_name        : (indirect string, offset: 0xa95ac): AHB3LPENR
    <348>   DW_AT_decl_file   : 6
    <349>   DW_AT_decl_line   : 725
    <34b>   DW_AT_decl_column : 17
    <34c>   DW_AT_type        : <0xc2>
    <350>   DW_AT_data_member_location: 88
 <2><351>: Abbrev Number: 2 (DW_TAG_member)
    <352>   DW_AT_name        : (indirect string, offset: 0xea934): RESERVED4
    <356>   DW_AT_decl_file   : 6
    <357>   DW_AT_decl_line   : 726
    <359>   DW_AT_decl_column : 17
    <35a>   DW_AT_type        : <0xb6>
    <35e>   DW_AT_data_member_location: 92
 <2><35f>: Abbrev Number: 2 (DW_TAG_member)
    <360>   DW_AT_name        : (indirect string, offset: 0xd158b): APB1LPENR
    <364>   DW_AT_decl_file   : 6
    <365>   DW_AT_decl_line   : 727
    <367>   DW_AT_decl_column : 17
    <368>   DW_AT_type        : <0xc2>
    <36c>   DW_AT_data_member_location: 96
 <2><36d>: Abbrev Number: 2 (DW_TAG_member)
    <36e>   DW_AT_name        : (indirect string, offset: 0x293bb): APB2LPENR
    <372>   DW_AT_decl_file   : 6
    <373>   DW_AT_decl_line   : 728
    <375>   DW_AT_decl_column : 17
    <376>   DW_AT_type        : <0xc2>
    <37a>   DW_AT_data_member_location: 100
 <2><37b>: Abbrev Number: 2 (DW_TAG_member)
    <37c>   DW_AT_name        : (indirect string, offset: 0xea93e): RESERVED5
    <380>   DW_AT_decl_file   : 6
    <381>   DW_AT_decl_line   : 729
    <383>   DW_AT_decl_column : 17
    <384>   DW_AT_type        : <0xc7>
    <388>   DW_AT_data_member_location: 104
 <2><389>: Abbrev Number: 2 (DW_TAG_member)
    <38a>   DW_AT_name        : (indirect string, offset: 0x229fc): BDCR
    <38e>   DW_AT_decl_file   : 6
    <38f>   DW_AT_decl_line   : 730
    <391>   DW_AT_decl_column : 17
    <392>   DW_AT_type        : <0xc2>
    <396>   DW_AT_data_member_location: 112
 <2><397>: Abbrev Number: 4 (DW_TAG_member)
    <398>   DW_AT_name        : CSR
    <39c>   DW_AT_decl_file   : 6
    <39c>   DW_AT_decl_line   : 731
    <39e>   DW_AT_decl_column : 17
    <39e>   DW_AT_type        : <0xc2>
    <3a2>   DW_AT_data_member_location: 116
 <2><3a3>: Abbrev Number: 2 (DW_TAG_member)
    <3a4>   DW_AT_name        : (indirect string, offset: 0x94705): RESERVED6
    <3a8>   DW_AT_decl_file   : 6
    <3a9>   DW_AT_decl_line   : 732
    <3ab>   DW_AT_decl_column : 17
    <3ac>   DW_AT_type        : <0xc7>
    <3b0>   DW_AT_data_member_location: 120
 <2><3b1>: Abbrev Number: 2 (DW_TAG_member)
    <3b2>   DW_AT_name        : (indirect string, offset: 0x83432): SSCGR
    <3b6>   DW_AT_decl_file   : 6
    <3b7>   DW_AT_decl_line   : 733
    <3b9>   DW_AT_decl_column : 17
    <3ba>   DW_AT_type        : <0xc2>
    <3be>   DW_AT_data_member_location: 128
 <2><3bf>: Abbrev Number: 2 (DW_TAG_member)
    <3c0>   DW_AT_name        : (indirect string, offset: 0x51fe7): PLLI2SCFGR
    <3c4>   DW_AT_decl_file   : 6
    <3c5>   DW_AT_decl_line   : 734
    <3c7>   DW_AT_decl_column : 17
    <3c8>   DW_AT_type        : <0xc2>
    <3cc>   DW_AT_data_member_location: 132
 <2><3cd>: Abbrev Number: 2 (DW_TAG_member)
    <3ce>   DW_AT_name        : (indirect string, offset: 0x44c12): PLLSAICFGR
    <3d2>   DW_AT_decl_file   : 6
    <3d3>   DW_AT_decl_line   : 735
    <3d5>   DW_AT_decl_column : 17
    <3d6>   DW_AT_type        : <0xc2>
    <3da>   DW_AT_data_member_location: 136
 <2><3db>: Abbrev Number: 2 (DW_TAG_member)
    <3dc>   DW_AT_name        : (indirect string, offset: 0x18e47): DCKCFGR1
    <3e0>   DW_AT_decl_file   : 6
    <3e1>   DW_AT_decl_line   : 736
    <3e3>   DW_AT_decl_column : 17
    <3e4>   DW_AT_type        : <0xc2>
    <3e8>   DW_AT_data_member_location: 140
 <2><3e9>: Abbrev Number: 2 (DW_TAG_member)
    <3ea>   DW_AT_name        : (indirect string, offset: 0xadd7c): DCKCFGR2
    <3ee>   DW_AT_decl_file   : 6
    <3ef>   DW_AT_decl_line   : 737
    <3f1>   DW_AT_decl_column : 17
    <3f2>   DW_AT_type        : <0xc2>
    <3f6>   DW_AT_data_member_location: 144
 <2><3f7>: Abbrev Number: 0
 <1><3f8>: Abbrev Number: 9 (DW_TAG_typedef)
    <3f9>   DW_AT_name        : (indirect string, offset: 0x72a65): RCC_TypeDef
    <3fd>   DW_AT_decl_file   : 6
    <3fe>   DW_AT_decl_line   : 739
    <400>   DW_AT_decl_column : 3
    <400>   DW_AT_type        : <0x227>
 <1><404>: Abbrev Number: 14 (DW_TAG_structure_type)
    <405>   DW_AT_byte_size   : 36
    <406>   DW_AT_decl_file   : 6
    <407>   DW_AT_decl_line   : 870
    <409>   DW_AT_decl_column : 9
    <409>   DW_AT_sibling     : <0x482>
 <2><40d>: Abbrev Number: 4 (DW_TAG_member)
    <40e>   DW_AT_name        : CR1
    <412>   DW_AT_decl_file   : 6
    <412>   DW_AT_decl_line   : 872
    <414>   DW_AT_decl_column : 17
    <414>   DW_AT_type        : <0xc2>
    <418>   DW_AT_data_member_location: 0
 <2><419>: Abbrev Number: 4 (DW_TAG_member)
    <41a>   DW_AT_name        : CR2
    <41e>   DW_AT_decl_file   : 6
    <41e>   DW_AT_decl_line   : 873
    <420>   DW_AT_decl_column : 17
    <420>   DW_AT_type        : <0xc2>
    <424>   DW_AT_data_member_location: 4
 <2><425>: Abbrev Number: 4 (DW_TAG_member)
    <426>   DW_AT_name        : SR
    <429>   DW_AT_decl_file   : 6
    <429>   DW_AT_decl_line   : 874
    <42b>   DW_AT_decl_column : 17
    <42b>   DW_AT_type        : <0xc2>
    <42f>   DW_AT_data_member_location: 8
 <2><430>: Abbrev Number: 4 (DW_TAG_member)
    <431>   DW_AT_name        : DR
    <434>   DW_AT_decl_file   : 6
    <434>   DW_AT_decl_line   : 875
    <436>   DW_AT_decl_column : 17
    <436>   DW_AT_type        : <0xc2>
    <43a>   DW_AT_data_member_location: 12
 <2><43b>: Abbrev Number: 2 (DW_TAG_member)
    <43c>   DW_AT_name        : (indirect string, offset: 0x3c19f): CRCPR
    <440>   DW_AT_decl_file   : 6
    <441>   DW_AT_decl_line   : 876
    <443>   DW_AT_decl_column : 17
    <444>   DW_AT_type        : <0xc2>
    <448>   DW_AT_data_member_location: 16
 <2><449>: Abbrev Number: 2 (DW_TAG_member)
    <44a>   DW_AT_name        : (indirect string, offset: 0x941b9): RXCRCR
    <44e>   DW_AT_decl_file   : 6
    <44f>   DW_AT_decl_line   : 877
    <451>   DW_AT_decl_column : 17
    <452>   DW_AT_type        : <0xc2>
    <456>   DW_AT_data_member_location: 20
 <2><457>: Abbrev Number: 2 (DW_TAG_member)
    <458>   DW_AT_name        : (indirect string, offset: 0x7b94d): TXCRCR
    <45c>   DW_AT_decl_file   : 6
    <45d>   DW_AT_decl_line   : 878
    <45f>   DW_AT_decl_column : 17
    <460>   DW_AT_type        : <0xc2>
    <464>   DW_AT_data_member_location: 24
 <2><465>: Abbrev Number: 2 (DW_TAG_member)
    <466>   DW_AT_name        : (indirect string, offset: 0x51fea): I2SCFGR
    <46a>   DW_AT_decl_file   : 6
    <46b>   DW_AT_decl_line   : 879
    <46d>   DW_AT_decl_column : 17
    <46e>   DW_AT_type        : <0xc2>
    <472>   DW_AT_data_member_location: 28
 <2><473>: Abbrev Number: 2 (DW_TAG_member)
    <474>   DW_AT_name        : (indirect string, offset: 0x74b82): I2SPR
    <478>   DW_AT_decl_file   : 6
    <479>   DW_AT_decl_line   : 880
    <47b>   DW_AT_decl_column : 17
    <47c>   DW_AT_type        : <0xc2>
    <480>   DW_AT_data_member_location: 32
 <2><481>: Abbrev Number: 0
 <1><482>: Abbrev Number: 9 (DW_TAG_typedef)
    <483>   DW_AT_name        : (indirect string, offset: 0x39fac): SPI_TypeDef
    <487>   DW_AT_decl_file   : 6
    <488>   DW_AT_decl_line   : 881
    <48a>   DW_AT_decl_column : 3
    <48a>   DW_AT_type        : <0x404>
 <1><48e>: Abbrev Number: 14 (DW_TAG_structure_type)
    <48f>   DW_AT_byte_size   : 96
    <490>   DW_AT_decl_file   : 6
    <491>   DW_AT_decl_line   : 908
    <493>   DW_AT_decl_column : 9
    <493>   DW_AT_sibling     : <0x5d2>
 <2><497>: Abbrev Number: 4 (DW_TAG_member)
    <498>   DW_AT_name        : CR1
    <49c>   DW_AT_decl_file   : 6
    <49c>   DW_AT_decl_line   : 910
    <49e>   DW_AT_decl_column : 17
    <49e>   DW_AT_type        : <0xc2>
    <4a2>   DW_AT_data_member_location: 0
 <2><4a3>: Abbrev Number: 4 (DW_TAG_member)
    <4a4>   DW_AT_name        : CR2
    <4a8>   DW_AT_decl_file   : 6
    <4a8>   DW_AT_decl_line   : 911
    <4aa>   DW_AT_decl_column : 17
    <4aa>   DW_AT_type        : <0xc2>
    <4ae>   DW_AT_data_member_location: 4
 <2><4af>: Abbrev Number: 2 (DW_TAG_member)
    <4b0>   DW_AT_name        : (indirect string, offset: 0x48d39): SMCR
    <4b4>   DW_AT_decl_file   : 6
    <4b5>   DW_AT_decl_line   : 912
    <4b7>   DW_AT_decl_column : 17
    <4b8>   DW_AT_type        : <0xc2>
    <4bc>   DW_AT_data_member_location: 8
 <2><4bd>: Abbrev Number: 2 (DW_TAG_member)
    <4be>   DW_AT_name        : (indirect string, offset: 0x4ffa5): DIER
    <4c2>   DW_AT_decl_file   : 6
    <4c3>   DW_AT_decl_line   : 913
    <4c5>   DW_AT_decl_column : 17
    <4c6>   DW_AT_type        : <0xc2>
    <4ca>   DW_AT_data_member_location: 12
 <2><4cb>: Abbrev Number: 4 (DW_TAG_member)
    <4cc>   DW_AT_name        : SR
    <4cf>   DW_AT_decl_file   : 6
    <4cf>   DW_AT_decl_line   : 914
    <4d1>   DW_AT_decl_column : 17
    <4d1>   DW_AT_type        : <0xc2>
    <4d5>   DW_AT_data_member_location: 16
 <2><4d6>: Abbrev Number: 4 (DW_TAG_member)
    <4d7>   DW_AT_name        : EGR
    <4db>   DW_AT_decl_file   : 6
    <4db>   DW_AT_decl_line   : 915
    <4dd>   DW_AT_decl_column : 17
    <4dd>   DW_AT_type        : <0xc2>
    <4e1>   DW_AT_data_member_location: 20
 <2><4e2>: Abbrev Number: 2 (DW_TAG_member)
    <4e3>   DW_AT_name        : (indirect string, offset: 0x88a03): CCMR1
    <4e7>   DW_AT_decl_file   : 6
    <4e8>   DW_AT_decl_line   : 916
    <4ea>   DW_AT_decl_column : 17
    <4eb>   DW_AT_type        : <0xc2>
    <4ef>   DW_AT_data_member_location: 24
 <2><4f0>: Abbrev Number: 2 (DW_TAG_member)
    <4f1>   DW_AT_name        : (indirect string, offset: 0x1cbd7): CCMR2
    <4f5>   DW_AT_decl_file   : 6
    <4f6>   DW_AT_decl_line   : 917
    <4f8>   DW_AT_decl_column : 17
    <4f9>   DW_AT_type        : <0xc2>
    <4fd>   DW_AT_data_member_location: 28
 <2><4fe>: Abbrev Number: 2 (DW_TAG_member)
    <4ff>   DW_AT_name        : (indirect string, offset: 0x3c5fd): CCER
    <503>   DW_AT_decl_file   : 6
    <504>   DW_AT_decl_line   : 918
    <506>   DW_AT_decl_column : 17
    <507>   DW_AT_type        : <0xc2>
    <50b>   DW_AT_data_member_location: 32
 <2><50c>: Abbrev Number: 4 (DW_TAG_member)
    <50d>   DW_AT_name        : CNT
    <511>   DW_AT_decl_file   : 6
    <511>   DW_AT_decl_line   : 919
    <513>   DW_AT_decl_column : 17
    <513>   DW_AT_type        : <0xc2>
    <517>   DW_AT_data_member_location: 36
 <2><518>: Abbrev Number: 4 (DW_TAG_member)
    <519>   DW_AT_name        : PSC
    <51d>   DW_AT_decl_file   : 6
    <51d>   DW_AT_decl_line   : 920
    <51f>   DW_AT_decl_column : 17
    <51f>   DW_AT_type        : <0xc2>
    <523>   DW_AT_data_member_location: 40
 <2><524>: Abbrev Number: 4 (DW_TAG_member)
    <525>   DW_AT_name        : ARR
    <529>   DW_AT_decl_file   : 6
    <529>   DW_AT_decl_line   : 921
    <52b>   DW_AT_decl_column : 17
    <52b>   DW_AT_type        : <0xc2>
    <52f>   DW_AT_data_member_location: 44
 <2><530>: Abbrev Number: 4 (DW_TAG_member)
    <531>   DW_AT_name        : RCR
    <535>   DW_AT_decl_file   : 6
    <535>   DW_AT_decl_line   : 922
    <537>   DW_AT_decl_column : 17
    <537>   DW_AT_type        : <0xc2>
    <53b>   DW_AT_data_member_location: 48
 <2><53c>: Abbrev Number: 2 (DW_TAG_member)
    <53d>   DW_AT_name        : (indirect string, offset: 0x1dc56): CCR1
    <541>   DW_AT_decl_file   : 6
    <542>   DW_AT_decl_line   : 923
    <544>   DW_AT_decl_column : 17
    <545>   DW_AT_type        : <0xc2>
    <549>   DW_AT_data_member_location: 52
 <2><54a>: Abbrev Number: 2 (DW_TAG_member)
    <54b>   DW_AT_name        : (indirect string, offset: 0x681c1): CCR2
    <54f>   DW_AT_decl_file   : 6
    <550>   DW_AT_decl_line   : 924
    <552>   DW_AT_decl_column : 17
    <553>   DW_AT_type        : <0xc2>
    <557>   DW_AT_data_member_location: 56
 <2><558>: Abbrev Number: 2 (DW_TAG_member)
    <559>   DW_AT_name        : (indirect string, offset: 0x46f0a): CCR3
    <55d>   DW_AT_decl_file   : 6
    <55e>   DW_AT_decl_line   : 925
    <560>   DW_AT_decl_column : 17
    <561>   DW_AT_type        : <0xc2>
    <565>   DW_AT_data_member_location: 60
 <2><566>: Abbrev Number: 2 (DW_TAG_member)
    <567>   DW_AT_name        : (indirect string, offset: 0xfa3c): CCR4
    <56b>   DW_AT_decl_file   : 6
    <56c>   DW_AT_decl_line   : 926
    <56e>   DW_AT_decl_column : 17
    <56f>   DW_AT_type        : <0xc2>
    <573>   DW_AT_data_member_location: 64
 <2><574>: Abbrev Number: 2 (DW_TAG_member)
    <575>   DW_AT_name        : (indirect string, offset: 0xaaf8f): BDTR
    <579>   DW_AT_decl_file   : 6
    <57a>   DW_AT_decl_line   : 927
    <57c>   DW_AT_decl_column : 17
    <57d>   DW_AT_type        : <0xc2>
    <581>   DW_AT_data_member_location: 68
 <2><582>: Abbrev Number: 4 (DW_TAG_member)
    <583>   DW_AT_name        : DCR
    <587>   DW_AT_decl_file   : 6
    <587>   DW_AT_decl_line   : 928
    <589>   DW_AT_decl_column : 17
    <589>   DW_AT_type        : <0xc2>
    <58d>   DW_AT_data_member_location: 72
 <2><58e>: Abbrev Number: 2 (DW_TAG_member)
    <58f>   DW_AT_name        : (indirect string, offset: 0xb9955): DMAR
    <593>   DW_AT_decl_file   : 6
    <594>   DW_AT_decl_line   : 929
    <596>   DW_AT_decl_column : 17
    <597>   DW_AT_type        : <0xc2>
    <59b>   DW_AT_data_member_location: 76
 <2><59c>: Abbrev Number: 4 (DW_TAG_member)
    <59d>   DW_AT_name        : OR
    <5a0>   DW_AT_decl_file   : 6
    <5a0>   DW_AT_decl_line   : 930
    <5a2>   DW_AT_decl_column : 17
    <5a2>   DW_AT_type        : <0xc2>
    <5a6>   DW_AT_data_member_location: 80
 <2><5a7>: Abbrev Number: 2 (DW_TAG_member)
    <5a8>   DW_AT_name        : (indirect string, offset: 0xdddba): CCMR3
    <5ac>   DW_AT_decl_file   : 6
    <5ad>   DW_AT_decl_line   : 931
    <5af>   DW_AT_decl_column : 17
    <5b0>   DW_AT_type        : <0xc2>
    <5b4>   DW_AT_data_member_location: 84
 <2><5b5>: Abbrev Number: 2 (DW_TAG_member)
    <5b6>   DW_AT_name        : (indirect string, offset: 0x59a19): CCR5
    <5ba>   DW_AT_decl_file   : 6
    <5bb>   DW_AT_decl_line   : 932
    <5bd>   DW_AT_decl_column : 17
    <5be>   DW_AT_type        : <0xc2>
    <5c2>   DW_AT_data_member_location: 88
 <2><5c3>: Abbrev Number: 2 (DW_TAG_member)
    <5c4>   DW_AT_name        : (indirect string, offset: 0xb0c06): CCR6
    <5c8>   DW_AT_decl_file   : 6
    <5c9>   DW_AT_decl_line   : 933
    <5cb>   DW_AT_decl_column : 17
    <5cc>   DW_AT_type        : <0xc2>
    <5d0>   DW_AT_data_member_location: 92
 <2><5d1>: Abbrev Number: 0
 <1><5d2>: Abbrev Number: 9 (DW_TAG_typedef)
    <5d3>   DW_AT_name        : (indirect string, offset: 0xeb5a0): TIM_TypeDef
    <5d7>   DW_AT_decl_file   : 6
    <5d8>   DW_AT_decl_line   : 935
    <5da>   DW_AT_decl_column : 3
    <5da>   DW_AT_type        : <0x48e>
 <1><5de>: Abbrev Number: 14 (DW_TAG_structure_type)
    <5df>   DW_AT_byte_size   : 44
    <5e0>   DW_AT_decl_file   : 6
    <5e1>   DW_AT_decl_line   : 957
    <5e3>   DW_AT_decl_column : 9
    <5e3>   DW_AT_sibling     : <0x670>
 <2><5e7>: Abbrev Number: 4 (DW_TAG_member)
    <5e8>   DW_AT_name        : CR1
    <5ec>   DW_AT_decl_file   : 6
    <5ec>   DW_AT_decl_line   : 959
    <5ee>   DW_AT_decl_column : 17
    <5ee>   DW_AT_type        : <0xc2>
    <5f2>   DW_AT_data_member_location: 0
 <2><5f3>: Abbrev Number: 4 (DW_TAG_member)
    <5f4>   DW_AT_name        : CR2
    <5f8>   DW_AT_decl_file   : 6
    <5f8>   DW_AT_decl_line   : 960
    <5fa>   DW_AT_decl_column : 17
    <5fa>   DW_AT_type        : <0xc2>
    <5fe>   DW_AT_data_member_location: 4
 <2><5ff>: Abbrev Number: 4 (DW_TAG_member)
    <600>   DW_AT_name        : CR3
    <604>   DW_AT_decl_file   : 6
    <604>   DW_AT_decl_line   : 961
    <606>   DW_AT_decl_column : 17
    <606>   DW_AT_type        : <0xc2>
    <60a>   DW_AT_data_member_location: 8
 <2><60b>: Abbrev Number: 4 (DW_TAG_member)
    <60c>   DW_AT_name        : BRR
    <610>   DW_AT_decl_file   : 6
    <610>   DW_AT_decl_line   : 962
    <612>   DW_AT_decl_column : 17
    <612>   DW_AT_type        : <0xc2>
    <616>   DW_AT_data_member_location: 12
 <2><617>: Abbrev Number: 2 (DW_TAG_member)
    <618>   DW_AT_name        : (indirect string, offset: 0x44e2e): GTPR
    <61c>   DW_AT_decl_file   : 6
    <61d>   DW_AT_decl_line   : 963
    <61f>   DW_AT_decl_column : 17
    <620>   DW_AT_type        : <0xc2>
    <624>   DW_AT_data_member_location: 16
 <2><625>: Abbrev Number: 2 (DW_TAG_member)
    <626>   DW_AT_name        : (indirect string, offset: 0xdb828): RTOR
    <62a>   DW_AT_decl_file   : 6
    <62b>   DW_AT_decl_line   : 964
    <62d>   DW_AT_decl_column : 17
    <62e>   DW_AT_type        : <0xc2>
    <632>   DW_AT_data_member_location: 20
 <2><633>: Abbrev Number: 4 (DW_TAG_member)
    <634>   DW_AT_name        : RQR
    <638>   DW_AT_decl_file   : 6
    <638>   DW_AT_decl_line   : 965
    <63a>   DW_AT_decl_column : 17
    <63a>   DW_AT_type        : <0xc2>
    <63e>   DW_AT_data_member_location: 24
 <2><63f>: Abbrev Number: 4 (DW_TAG_member)
    <640>   DW_AT_name        : ISR
    <644>   DW_AT_decl_file   : 6
    <644>   DW_AT_decl_line   : 966
    <646>   DW_AT_decl_column : 17
    <646>   DW_AT_type        : <0xc2>
    <64a>   DW_AT_data_member_location: 28
 <2><64b>: Abbrev Number: 4 (DW_TAG_member)
    <64c>   DW_AT_name        : ICR
    <650>   DW_AT_decl_file   : 6
    <650>   DW_AT_decl_line   : 967
    <652>   DW_AT_decl_column : 17
    <652>   DW_AT_type        : <0xc2>
    <656>   DW_AT_data_member_location: 32
 <2><657>: Abbrev Number: 4 (DW_TAG_member)
    <658>   DW_AT_name        : RDR
    <65c>   DW_AT_decl_file   : 6
    <65c>   DW_AT_decl_line   : 968
    <65e>   DW_AT_decl_column : 17
    <65e>   DW_AT_type        : <0xc2>
    <662>   DW_AT_data_member_location: 36
 <2><663>: Abbrev Number: 4 (DW_TAG_member)
    <664>   DW_AT_name        : TDR
    <668>   DW_AT_decl_file   : 6
    <668>   DW_AT_decl_line   : 969
    <66a>   DW_AT_decl_column : 17
    <66a>   DW_AT_type        : <0xc2>
    <66e>   DW_AT_data_member_location: 40
 <2><66f>: Abbrev Number: 0
 <1><670>: Abbrev Number: 9 (DW_TAG_typedef)
    <671>   DW_AT_name        : (indirect string, offset: 0x13e6a): USART_TypeDef
    <675>   DW_AT_decl_file   : 6
    <676>   DW_AT_decl_line   : 970
    <678>   DW_AT_decl_column : 3
    <678>   DW_AT_type        : <0x5de>
 <1><67c>: Abbrev Number: 12 (DW_TAG_base_type)
    <67d>   DW_AT_byte_size   : 8
    <67e>   DW_AT_encoding    : 4	(float)
    <67f>   DW_AT_name        : (indirect string, offset: 0x16f7d): long double
 <1><683>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <684>   DW_AT_encoding    : 7	(unsigned)
    <684>   DW_AT_byte_size   : 1
    <684>   DW_AT_type        : <0x3d>
    <688>   DW_AT_decl_file   : 7
    <689>   DW_AT_decl_line   : 39
    <68a>   DW_AT_decl_column : 1
    <68a>   DW_AT_sibling     : <0x6a7>
 <2><68e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <68f>   DW_AT_name        : (indirect string, offset: 0x53650): HAL_OK
    <693>   DW_AT_const_value : 0
 <2><694>: Abbrev Number: 3 (DW_TAG_enumerator)
    <695>   DW_AT_name        : (indirect string, offset: 0x9bb39): HAL_ERROR
    <699>   DW_AT_const_value : 1
 <2><69a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <69b>   DW_AT_name        : (indirect string, offset: 0x2b905): HAL_BUSY
    <69f>   DW_AT_const_value : 2
 <2><6a0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6a1>   DW_AT_name        : (indirect string, offset: 0x48c5c): HAL_TIMEOUT
    <6a5>   DW_AT_const_value : 3
 <2><6a6>: Abbrev Number: 0
 <1><6a7>: Abbrev Number: 5 (DW_TAG_typedef)
    <6a8>   DW_AT_name        : (indirect string, offset: 0x2da8): HAL_StatusTypeDef
    <6ac>   DW_AT_decl_file   : 7
    <6ad>   DW_AT_decl_line   : 44
    <6ae>   DW_AT_decl_column : 3
    <6af>   DW_AT_type        : <0x683>
 <1><6b3>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <6b4>   DW_AT_encoding    : 7	(unsigned)
    <6b4>   DW_AT_byte_size   : 1
    <6b4>   DW_AT_type        : <0x3d>
    <6b8>   DW_AT_decl_file   : 7
    <6b9>   DW_AT_decl_line   : 50
    <6ba>   DW_AT_decl_column : 1
    <6ba>   DW_AT_sibling     : <0x6cb>
 <2><6be>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6bf>   DW_AT_name        : (indirect string, offset: 0xb8e3c): HAL_UNLOCKED
    <6c3>   DW_AT_const_value : 0
 <2><6c4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <6c5>   DW_AT_name        : (indirect string, offset: 0xf83ae): HAL_LOCKED
    <6c9>   DW_AT_const_value : 1
 <2><6ca>: Abbrev Number: 0
 <1><6cb>: Abbrev Number: 5 (DW_TAG_typedef)
    <6cc>   DW_AT_name        : (indirect string, offset: 0x932f4): HAL_LockTypeDef
    <6d0>   DW_AT_decl_file   : 7
    <6d1>   DW_AT_decl_line   : 53
    <6d2>   DW_AT_decl_column : 3
    <6d3>   DW_AT_type        : <0x6b3>
 <1><6d7>: Abbrev Number: 10 (DW_TAG_structure_type)
    <6d8>   DW_AT_byte_size   : 24
    <6d9>   DW_AT_decl_file   : 8
    <6da>   DW_AT_decl_line   : 45
    <6db>   DW_AT_decl_column : 9
    <6db>   DW_AT_sibling     : <0x72e>
 <2><6df>: Abbrev Number: 1 (DW_TAG_member)
    <6e0>   DW_AT_name        : (indirect string, offset: 0xa80ed): PLLState
    <6e4>   DW_AT_decl_file   : 8
    <6e5>   DW_AT_decl_line   : 47
    <6e6>   DW_AT_decl_column : 12
    <6e7>   DW_AT_type        : <0xb6>
    <6eb>   DW_AT_data_member_location: 0
 <2><6ec>: Abbrev Number: 1 (DW_TAG_member)
    <6ed>   DW_AT_name        : (indirect string, offset: 0xadff9): PLLSource
    <6f1>   DW_AT_decl_file   : 8
    <6f2>   DW_AT_decl_line   : 50
    <6f3>   DW_AT_decl_column : 12
    <6f4>   DW_AT_type        : <0xb6>
    <6f8>   DW_AT_data_member_location: 4
 <2><6f9>: Abbrev Number: 1 (DW_TAG_member)
    <6fa>   DW_AT_name        : (indirect string, offset: 0xce89b): PLLM
    <6fe>   DW_AT_decl_file   : 8
    <6ff>   DW_AT_decl_line   : 53
    <700>   DW_AT_decl_column : 12
    <701>   DW_AT_type        : <0xb6>
    <705>   DW_AT_data_member_location: 8
 <2><706>: Abbrev Number: 1 (DW_TAG_member)
    <707>   DW_AT_name        : (indirect string, offset: 0xce8a0): PLLN
    <70b>   DW_AT_decl_file   : 8
    <70c>   DW_AT_decl_line   : 56
    <70d>   DW_AT_decl_column : 12
    <70e>   DW_AT_type        : <0xb6>
    <712>   DW_AT_data_member_location: 12
 <2><713>: Abbrev Number: 1 (DW_TAG_member)
    <714>   DW_AT_name        : (indirect string, offset: 0xce8bd): PLLP
    <718>   DW_AT_decl_file   : 8
    <719>   DW_AT_decl_line   : 59
    <71a>   DW_AT_decl_column : 12
    <71b>   DW_AT_type        : <0xb6>
    <71f>   DW_AT_data_member_location: 16
 <2><720>: Abbrev Number: 1 (DW_TAG_member)
    <721>   DW_AT_name        : (indirect string, offset: 0x6b053): PLLQ
    <725>   DW_AT_decl_file   : 8
    <726>   DW_AT_decl_line   : 62
    <727>   DW_AT_decl_column : 12
    <728>   DW_AT_type        : <0xb6>
    <72c>   DW_AT_data_member_location: 20
 <2><72d>: Abbrev Number: 0
 <1><72e>: Abbrev Number: 5 (DW_TAG_typedef)
    <72f>   DW_AT_name        : (indirect string, offset: 0x96dc0): RCC_PLLInitTypeDef
    <733>   DW_AT_decl_file   : 8
    <734>   DW_AT_decl_line   : 69
    <735>   DW_AT_decl_column : 2
    <736>   DW_AT_type        : <0x6d7>
 <1><73a>: Abbrev Number: 10 (DW_TAG_structure_type)
    <73b>   DW_AT_byte_size   : 48
    <73c>   DW_AT_decl_file   : 9
    <73d>   DW_AT_decl_line   : 50
    <73e>   DW_AT_decl_column : 9
    <73e>   DW_AT_sibling     : <0x79e>
 <2><742>: Abbrev Number: 1 (DW_TAG_member)
    <743>   DW_AT_name        : (indirect string, offset: 0xcb121): OscillatorType
    <747>   DW_AT_decl_file   : 9
    <748>   DW_AT_decl_line   : 52
    <749>   DW_AT_decl_column : 12
    <74a>   DW_AT_type        : <0xb6>
    <74e>   DW_AT_data_member_location: 0
 <2><74f>: Abbrev Number: 1 (DW_TAG_member)
    <750>   DW_AT_name        : (indirect string, offset: 0xa9fa6): HSEState
    <754>   DW_AT_decl_file   : 9
    <755>   DW_AT_decl_line   : 55
    <756>   DW_AT_decl_column : 12
    <757>   DW_AT_type        : <0xb6>
    <75b>   DW_AT_data_member_location: 4
 <2><75c>: Abbrev Number: 1 (DW_TAG_member)
    <75d>   DW_AT_name        : (indirect string, offset: 0x9cb5a): LSEState
    <761>   DW_AT_decl_file   : 9
    <762>   DW_AT_decl_line   : 58
    <763>   DW_AT_decl_column : 12
    <764>   DW_AT_type        : <0xb6>
    <768>   DW_AT_data_member_location: 8
 <2><769>: Abbrev Number: 1 (DW_TAG_member)
    <76a>   DW_AT_name        : (indirect string, offset: 0x6e844): HSIState
    <76e>   DW_AT_decl_file   : 9
    <76f>   DW_AT_decl_line   : 61
    <770>   DW_AT_decl_column : 12
    <771>   DW_AT_type        : <0xb6>
    <775>   DW_AT_data_member_location: 12
 <2><776>: Abbrev Number: 1 (DW_TAG_member)
    <777>   DW_AT_name        : (indirect string, offset: 0xd65b5): HSICalibrationValue
    <77b>   DW_AT_decl_file   : 9
    <77c>   DW_AT_decl_line   : 64
    <77d>   DW_AT_decl_column : 12
    <77e>   DW_AT_type        : <0xb6>
    <782>   DW_AT_data_member_location: 16
 <2><783>: Abbrev Number: 1 (DW_TAG_member)
    <784>   DW_AT_name        : (indirect string, offset: 0x56a74): LSIState
    <788>   DW_AT_decl_file   : 9
    <789>   DW_AT_decl_line   : 67
    <78a>   DW_AT_decl_column : 12
    <78b>   DW_AT_type        : <0xb6>
    <78f>   DW_AT_data_member_location: 20
 <2><790>: Abbrev Number: 24 (DW_TAG_member)
    <791>   DW_AT_name        : PLL
    <795>   DW_AT_decl_file   : 9
    <796>   DW_AT_decl_line   : 70
    <797>   DW_AT_decl_column : 22
    <798>   DW_AT_type        : <0x72e>
    <79c>   DW_AT_data_member_location: 24
 <2><79d>: Abbrev Number: 0
 <1><79e>: Abbrev Number: 5 (DW_TAG_typedef)
    <79f>   DW_AT_name        : (indirect string, offset: 0x83957): RCC_OscInitTypeDef
    <7a3>   DW_AT_decl_file   : 9
    <7a4>   DW_AT_decl_line   : 72
    <7a5>   DW_AT_decl_column : 2
    <7a6>   DW_AT_type        : <0x73a>
 <1><7aa>: Abbrev Number: 10 (DW_TAG_structure_type)
    <7ab>   DW_AT_byte_size   : 20
    <7ac>   DW_AT_decl_file   : 9
    <7ad>   DW_AT_decl_line   : 77
    <7ae>   DW_AT_decl_column : 9
    <7ae>   DW_AT_sibling     : <0x7f4>
 <2><7b2>: Abbrev Number: 1 (DW_TAG_member)
    <7b3>   DW_AT_name        : (indirect string, offset: 0x4c0a0): ClockType
    <7b7>   DW_AT_decl_file   : 9
    <7b8>   DW_AT_decl_line   : 79
    <7b9>   DW_AT_decl_column : 12
    <7ba>   DW_AT_type        : <0xb6>
    <7be>   DW_AT_data_member_location: 0
 <2><7bf>: Abbrev Number: 1 (DW_TAG_member)
    <7c0>   DW_AT_name        : (indirect string, offset: 0x968f9): SYSCLKSource
    <7c4>   DW_AT_decl_file   : 9
    <7c5>   DW_AT_decl_line   : 82
    <7c6>   DW_AT_decl_column : 12
    <7c7>   DW_AT_type        : <0xb6>
    <7cb>   DW_AT_data_member_location: 4
 <2><7cc>: Abbrev Number: 1 (DW_TAG_member)
    <7cd>   DW_AT_name        : (indirect string, offset: 0xce206): AHBCLKDivider
    <7d1>   DW_AT_decl_file   : 9
    <7d2>   DW_AT_decl_line   : 85
    <7d3>   DW_AT_decl_column : 12
    <7d4>   DW_AT_type        : <0xb6>
    <7d8>   DW_AT_data_member_location: 8
 <2><7d9>: Abbrev Number: 1 (DW_TAG_member)
    <7da>   DW_AT_name        : (indirect string, offset: 0x985b): APB1CLKDivider
    <7de>   DW_AT_decl_file   : 9
    <7df>   DW_AT_decl_line   : 88
    <7e0>   DW_AT_decl_column : 12
    <7e1>   DW_AT_type        : <0xb6>
    <7e5>   DW_AT_data_member_location: 12
 <2><7e6>: Abbrev Number: 1 (DW_TAG_member)
    <7e7>   DW_AT_name        : (indirect string, offset: 0x71780): APB2CLKDivider
    <7eb>   DW_AT_decl_file   : 9
    <7ec>   DW_AT_decl_line   : 91
    <7ed>   DW_AT_decl_column : 12
    <7ee>   DW_AT_type        : <0xb6>
    <7f2>   DW_AT_data_member_location: 16
 <2><7f3>: Abbrev Number: 0
 <1><7f4>: Abbrev Number: 5 (DW_TAG_typedef)
    <7f5>   DW_AT_name        : (indirect string, offset: 0xc0d86): RCC_ClkInitTypeDef
    <7f9>   DW_AT_decl_file   : 9
    <7fa>   DW_AT_decl_line   : 94
    <7fb>   DW_AT_decl_column : 2
    <7fc>   DW_AT_type        : <0x7aa>
 <1><800>: Abbrev Number: 10 (DW_TAG_structure_type)
    <801>   DW_AT_byte_size   : 20
    <802>   DW_AT_decl_file   : 10
    <803>   DW_AT_decl_line   : 46
    <804>   DW_AT_decl_column : 9
    <804>   DW_AT_sibling     : <0x84a>
 <2><808>: Abbrev Number: 24 (DW_TAG_member)
    <809>   DW_AT_name        : Pin
    <80d>   DW_AT_decl_file   : 10
    <80e>   DW_AT_decl_line   : 48
    <80f>   DW_AT_decl_column : 12
    <810>   DW_AT_type        : <0xb6>
    <814>   DW_AT_data_member_location: 0
 <2><815>: Abbrev Number: 1 (DW_TAG_member)
    <816>   DW_AT_name        : (indirect string, offset: 0x6c026): Mode
    <81a>   DW_AT_decl_file   : 10
    <81b>   DW_AT_decl_line   : 51
    <81c>   DW_AT_decl_column : 12
    <81d>   DW_AT_type        : <0xb6>
    <821>   DW_AT_data_member_location: 4
 <2><822>: Abbrev Number: 1 (DW_TAG_member)
    <823>   DW_AT_name        : (indirect string, offset: 0x7f580): Pull
    <827>   DW_AT_decl_file   : 10
    <828>   DW_AT_decl_line   : 54
    <829>   DW_AT_decl_column : 12
    <82a>   DW_AT_type        : <0xb6>
    <82e>   DW_AT_data_member_location: 8
 <2><82f>: Abbrev Number: 1 (DW_TAG_member)
    <830>   DW_AT_name        : (indirect string, offset: 0x9233a): Speed
    <834>   DW_AT_decl_file   : 10
    <835>   DW_AT_decl_line   : 57
    <836>   DW_AT_decl_column : 12
    <837>   DW_AT_type        : <0xb6>
    <83b>   DW_AT_data_member_location: 12
 <2><83c>: Abbrev Number: 1 (DW_TAG_member)
    <83d>   DW_AT_name        : (indirect string, offset: 0x71741): Alternate
    <841>   DW_AT_decl_file   : 10
    <842>   DW_AT_decl_line   : 60
    <843>   DW_AT_decl_column : 12
    <844>   DW_AT_type        : <0xb6>
    <848>   DW_AT_data_member_location: 16
 <2><849>: Abbrev Number: 0
 <1><84a>: Abbrev Number: 5 (DW_TAG_typedef)
    <84b>   DW_AT_name        : (indirect string, offset: 0xc3731): GPIO_InitTypeDef
    <84f>   DW_AT_decl_file   : 10
    <850>   DW_AT_decl_line   : 62
    <851>   DW_AT_decl_column : 3
    <852>   DW_AT_type        : <0x800>
 <1><856>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <857>   DW_AT_encoding    : 7	(unsigned)
    <857>   DW_AT_byte_size   : 1
    <857>   DW_AT_type        : <0x3d>
    <85b>   DW_AT_decl_file   : 10
    <85c>   DW_AT_decl_line   : 68
    <85d>   DW_AT_decl_column : 1
    <85d>   DW_AT_sibling     : <0x86e>
 <2><861>: Abbrev Number: 3 (DW_TAG_enumerator)
    <862>   DW_AT_name        : (indirect string, offset: 0x339a1): GPIO_PIN_RESET
    <866>   DW_AT_const_value : 0
 <2><867>: Abbrev Number: 3 (DW_TAG_enumerator)
    <868>   DW_AT_name        : (indirect string, offset: 0x2bdc1): GPIO_PIN_SET
    <86c>   DW_AT_const_value : 1
 <2><86d>: Abbrev Number: 0
 <1><86e>: Abbrev Number: 5 (DW_TAG_typedef)
    <86f>   DW_AT_name        : (indirect string, offset: 0xf42f4): GPIO_PinState
    <873>   DW_AT_decl_file   : 10
    <874>   DW_AT_decl_line   : 71
    <875>   DW_AT_decl_column : 3
    <876>   DW_AT_type        : <0x856>
 <1><87a>: Abbrev Number: 10 (DW_TAG_structure_type)
    <87b>   DW_AT_byte_size   : 48
    <87c>   DW_AT_decl_file   : 11
    <87d>   DW_AT_decl_line   : 48
    <87e>   DW_AT_decl_column : 9
    <87e>   DW_AT_sibling     : <0x91f>
 <2><882>: Abbrev Number: 1 (DW_TAG_member)
    <883>   DW_AT_name        : (indirect string, offset: 0x80bb4): Channel
    <887>   DW_AT_decl_file   : 11
    <888>   DW_AT_decl_line   : 50
    <889>   DW_AT_decl_column : 12
    <88a>   DW_AT_type        : <0xb6>
    <88e>   DW_AT_data_member_location: 0
 <2><88f>: Abbrev Number: 1 (DW_TAG_member)
    <890>   DW_AT_name        : (indirect string, offset: 0x5bd24): Direction
    <894>   DW_AT_decl_file   : 11
    <895>   DW_AT_decl_line   : 53
    <896>   DW_AT_decl_column : 12
    <897>   DW_AT_type        : <0xb6>
    <89b>   DW_AT_data_member_location: 4
 <2><89c>: Abbrev Number: 1 (DW_TAG_member)
    <89d>   DW_AT_name        : (indirect string, offset: 0x108fc): PeriphInc
    <8a1>   DW_AT_decl_file   : 11
    <8a2>   DW_AT_decl_line   : 57
    <8a3>   DW_AT_decl_column : 12
    <8a4>   DW_AT_type        : <0xb6>
    <8a8>   DW_AT_data_member_location: 8
 <2><8a9>: Abbrev Number: 1 (DW_TAG_member)
    <8aa>   DW_AT_name        : (indirect string, offset: 0x2729b): MemInc
    <8ae>   DW_AT_decl_file   : 11
    <8af>   DW_AT_decl_line   : 60
    <8b0>   DW_AT_decl_column : 12
    <8b1>   DW_AT_type        : <0xb6>
    <8b5>   DW_AT_data_member_location: 12
 <2><8b6>: Abbrev Number: 1 (DW_TAG_member)
    <8b7>   DW_AT_name        : (indirect string, offset: 0x7b06e): PeriphDataAlignment
    <8bb>   DW_AT_decl_file   : 11
    <8bc>   DW_AT_decl_line   : 63
    <8bd>   DW_AT_decl_column : 12
    <8be>   DW_AT_type        : <0xb6>
    <8c2>   DW_AT_data_member_location: 16
 <2><8c3>: Abbrev Number: 1 (DW_TAG_member)
    <8c4>   DW_AT_name        : (indirect string, offset: 0xe1523): MemDataAlignment
    <8c8>   DW_AT_decl_file   : 11
    <8c9>   DW_AT_decl_line   : 66
    <8ca>   DW_AT_decl_column : 12
    <8cb>   DW_AT_type        : <0xb6>
    <8cf>   DW_AT_data_member_location: 20
 <2><8d0>: Abbrev Number: 1 (DW_TAG_member)
    <8d1>   DW_AT_name        : (indirect string, offset: 0x6c026): Mode
    <8d5>   DW_AT_decl_file   : 11
    <8d6>   DW_AT_decl_line   : 69
    <8d7>   DW_AT_decl_column : 12
    <8d8>   DW_AT_type        : <0xb6>
    <8dc>   DW_AT_data_member_location: 24
 <2><8dd>: Abbrev Number: 1 (DW_TAG_member)
    <8de>   DW_AT_name        : (indirect string, offset: 0xfec99): Priority
    <8e2>   DW_AT_decl_file   : 11
    <8e3>   DW_AT_decl_line   : 74
    <8e4>   DW_AT_decl_column : 12
    <8e5>   DW_AT_type        : <0xb6>
    <8e9>   DW_AT_data_member_location: 28
 <2><8ea>: Abbrev Number: 1 (DW_TAG_member)
    <8eb>   DW_AT_name        : (indirect string, offset: 0x6b25f): FIFOMode
    <8ef>   DW_AT_decl_file   : 11
    <8f0>   DW_AT_decl_line   : 77
    <8f1>   DW_AT_decl_column : 12
    <8f2>   DW_AT_type        : <0xb6>
    <8f6>   DW_AT_data_member_location: 32
 <2><8f7>: Abbrev Number: 1 (DW_TAG_member)
    <8f8>   DW_AT_name        : (indirect string, offset: 0xbde97): FIFOThreshold
    <8fc>   DW_AT_decl_file   : 11
    <8fd>   DW_AT_decl_line   : 82
    <8fe>   DW_AT_decl_column : 12
    <8ff>   DW_AT_type        : <0xb6>
    <903>   DW_AT_data_member_location: 36
 <2><904>: Abbrev Number: 1 (DW_TAG_member)
    <905>   DW_AT_name        : (indirect string, offset: 0xbb778): MemBurst
    <909>   DW_AT_decl_file   : 11
    <90a>   DW_AT_decl_line   : 85
    <90b>   DW_AT_decl_column : 12
    <90c>   DW_AT_type        : <0xb6>
    <910>   DW_AT_data_member_location: 40
 <2><911>: Abbrev Number: 1 (DW_TAG_member)
    <912>   DW_AT_name        : (indirect string, offset: 0x54e0a): PeriphBurst
    <916>   DW_AT_decl_file   : 11
    <917>   DW_AT_decl_line   : 91
    <918>   DW_AT_decl_column : 12
    <919>   DW_AT_type        : <0xb6>
    <91d>   DW_AT_data_member_location: 44
 <2><91e>: Abbrev Number: 0
 <1><91f>: Abbrev Number: 5 (DW_TAG_typedef)
    <920>   DW_AT_name        : (indirect string, offset: 0x42e1b): DMA_InitTypeDef
    <924>   DW_AT_decl_file   : 11
    <925>   DW_AT_decl_line   : 96
    <926>   DW_AT_decl_column : 2
    <927>   DW_AT_type        : <0x87a>
 <1><92b>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <92c>   DW_AT_encoding    : 7	(unsigned)
    <92c>   DW_AT_byte_size   : 1
    <92c>   DW_AT_type        : <0x3d>
    <930>   DW_AT_decl_file   : 11
    <931>   DW_AT_decl_line   : 102
    <932>   DW_AT_decl_column : 1
    <932>   DW_AT_sibling     : <0x95b>
 <2><936>: Abbrev Number: 3 (DW_TAG_enumerator)
    <937>   DW_AT_name        : (indirect string, offset: 0xba43e): HAL_DMA_STATE_RESET
    <93b>   DW_AT_const_value : 0
 <2><93c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <93d>   DW_AT_name        : (indirect string, offset: 0x444ab): HAL_DMA_STATE_READY
    <941>   DW_AT_const_value : 1
 <2><942>: Abbrev Number: 3 (DW_TAG_enumerator)
    <943>   DW_AT_name        : (indirect string, offset: 0xad8f8): HAL_DMA_STATE_BUSY
    <947>   DW_AT_const_value : 2
 <2><948>: Abbrev Number: 3 (DW_TAG_enumerator)
    <949>   DW_AT_name        : (indirect string, offset: 0xf4857): HAL_DMA_STATE_TIMEOUT
    <94d>   DW_AT_const_value : 3
 <2><94e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <94f>   DW_AT_name        : (indirect string, offset: 0xd579e): HAL_DMA_STATE_ERROR
    <953>   DW_AT_const_value : 4
 <2><954>: Abbrev Number: 3 (DW_TAG_enumerator)
    <955>   DW_AT_name        : (indirect string, offset: 0x38928): HAL_DMA_STATE_ABORT
    <959>   DW_AT_const_value : 5
 <2><95a>: Abbrev Number: 0
 <1><95b>: Abbrev Number: 5 (DW_TAG_typedef)
    <95c>   DW_AT_name        : (indirect string, offset: 0xc38af): HAL_DMA_StateTypeDef
    <960>   DW_AT_decl_file   : 11
    <961>   DW_AT_decl_line   : 109
    <962>   DW_AT_decl_column : 2
    <963>   DW_AT_type        : <0x92b>
 <1><967>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <968>   DW_AT_type        : <0x95b>
 <1><96c>: Abbrev Number: 25 (DW_TAG_structure_type)
    <96d>   DW_AT_name        : (indirect string, offset: 0xd453e): __DMA_HandleTypeDef
    <971>   DW_AT_byte_size   : 96
    <972>   DW_AT_decl_file   : 11
    <973>   DW_AT_decl_line   : 137
    <974>   DW_AT_decl_column : 16
    <974>   DW_AT_sibling     : <0xa2f>
 <2><978>: Abbrev Number: 1 (DW_TAG_member)
    <979>   DW_AT_name        : (indirect string, offset: 0xf03b4): Instance
    <97d>   DW_AT_decl_file   : 11
    <97e>   DW_AT_decl_line   : 139
    <97f>   DW_AT_decl_column : 31
    <980>   DW_AT_type        : <0xa2f>
    <984>   DW_AT_data_member_location: 0
 <2><985>: Abbrev Number: 1 (DW_TAG_member)
    <986>   DW_AT_name        : (indirect string, offset: 0xff54d): Init
    <98a>   DW_AT_decl_file   : 11
    <98b>   DW_AT_decl_line   : 141
    <98c>   DW_AT_decl_column : 30
    <98d>   DW_AT_type        : <0x91f>
    <991>   DW_AT_data_member_location: 4
 <2><992>: Abbrev Number: 1 (DW_TAG_member)
    <993>   DW_AT_name        : (indirect string, offset: 0xb2891): Lock
    <997>   DW_AT_decl_file   : 11
    <998>   DW_AT_decl_line   : 143
    <999>   DW_AT_decl_column : 30
    <99a>   DW_AT_type        : <0x6cb>
    <99e>   DW_AT_data_member_location: 52
 <2><99f>: Abbrev Number: 1 (DW_TAG_member)
    <9a0>   DW_AT_name        : (indirect string, offset: 0x100b19): State
    <9a4>   DW_AT_decl_file   : 11
    <9a5>   DW_AT_decl_line   : 145
    <9a6>   DW_AT_decl_column : 30
    <9a7>   DW_AT_type        : <0x967>
    <9ab>   DW_AT_data_member_location: 53
 <2><9ac>: Abbrev Number: 1 (DW_TAG_member)
    <9ad>   DW_AT_name        : (indirect string, offset: 0xec8fe): Parent
    <9b1>   DW_AT_decl_file   : 11
    <9b2>   DW_AT_decl_line   : 147
    <9b3>   DW_AT_decl_column : 31
    <9b4>   DW_AT_type        : <0xa34>
    <9b8>   DW_AT_data_member_location: 56
 <2><9b9>: Abbrev Number: 1 (DW_TAG_member)
    <9ba>   DW_AT_name        : (indirect string, offset: 0xf748b): XferCpltCallback
    <9be>   DW_AT_decl_file   : 11
    <9bf>   DW_AT_decl_line   : 149
    <9c0>   DW_AT_decl_column : 33
    <9c1>   DW_AT_type        : <0xa46>
    <9c5>   DW_AT_data_member_location: 60
 <2><9c6>: Abbrev Number: 1 (DW_TAG_member)
    <9c7>   DW_AT_name        : (indirect string, offset: 0xc23ae): XferHalfCpltCallback
    <9cb>   DW_AT_decl_file   : 11
    <9cc>   DW_AT_decl_line   : 151
    <9cd>   DW_AT_decl_column : 33
    <9ce>   DW_AT_type        : <0xa46>
    <9d2>   DW_AT_data_member_location: 64
 <2><9d3>: Abbrev Number: 1 (DW_TAG_member)
    <9d4>   DW_AT_name        : (indirect string, offset: 0xe413d): XferM1CpltCallback
    <9d8>   DW_AT_decl_file   : 11
    <9d9>   DW_AT_decl_line   : 153
    <9da>   DW_AT_decl_column : 33
    <9db>   DW_AT_type        : <0xa46>
    <9df>   DW_AT_data_member_location: 68
 <2><9e0>: Abbrev Number: 1 (DW_TAG_member)
    <9e1>   DW_AT_name        : (indirect string, offset: 0x7732c): XferM1HalfCpltCallback
    <9e5>   DW_AT_decl_file   : 11
    <9e6>   DW_AT_decl_line   : 155
    <9e7>   DW_AT_decl_column : 33
    <9e8>   DW_AT_type        : <0xa46>
    <9ec>   DW_AT_data_member_location: 72
 <2><9ed>: Abbrev Number: 1 (DW_TAG_member)
    <9ee>   DW_AT_name        : (indirect string, offset: 0x23ca3): XferErrorCallback
    <9f2>   DW_AT_decl_file   : 11
    <9f3>   DW_AT_decl_line   : 157
    <9f4>   DW_AT_decl_column : 33
    <9f5>   DW_AT_type        : <0xa46>
    <9f9>   DW_AT_data_member_location: 76
 <2><9fa>: Abbrev Number: 1 (DW_TAG_member)
    <9fb>   DW_AT_name        : (indirect string, offset: 0xe84c3): XferAbortCallback
    <9ff>   DW_AT_decl_file   : 11
    <a00>   DW_AT_decl_line   : 159
    <a01>   DW_AT_decl_column : 33
    <a02>   DW_AT_type        : <0xa46>
    <a06>   DW_AT_data_member_location: 80
 <2><a07>: Abbrev Number: 1 (DW_TAG_member)
    <a08>   DW_AT_name        : (indirect string, offset: 0xf2bb7): ErrorCode
    <a0c>   DW_AT_decl_file   : 11
    <a0d>   DW_AT_decl_line   : 161
    <a0e>   DW_AT_decl_column : 30
    <a0f>   DW_AT_type        : <0xc2>
    <a13>   DW_AT_data_member_location: 84
 <2><a14>: Abbrev Number: 1 (DW_TAG_member)
    <a15>   DW_AT_name        : (indirect string, offset: 0x6ecc3): StreamBaseAddress
    <a19>   DW_AT_decl_file   : 11
    <a1a>   DW_AT_decl_line   : 163
    <a1b>   DW_AT_decl_column : 30
    <a1c>   DW_AT_type        : <0xb6>
    <a20>   DW_AT_data_member_location: 88
 <2><a21>: Abbrev Number: 1 (DW_TAG_member)
    <a22>   DW_AT_name        : (indirect string, offset: 0xd18fe): StreamIndex
    <a26>   DW_AT_decl_file   : 11
    <a27>   DW_AT_decl_line   : 165
    <a28>   DW_AT_decl_column : 30
    <a29>   DW_AT_type        : <0xb6>
    <a2d>   DW_AT_data_member_location: 92
 <2><a2e>: Abbrev Number: 0
 <1><a2f>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a30>   DW_AT_byte_size   : 4
    <a30>   DW_AT_type        : <0x12e>
 <1><a34>: Abbrev Number: 40 (DW_TAG_pointer_type)
    <a35>   DW_AT_byte_size   : 4
 <1><a36>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <a37>   DW_AT_prototyped  : 1
    <a37>   DW_AT_sibling     : <0xa41>
 <2><a3b>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <a3c>   DW_AT_type        : <0xa41>
 <2><a40>: Abbrev Number: 0
 <1><a41>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a42>   DW_AT_byte_size   : 4
    <a42>   DW_AT_type        : <0x96c>
 <1><a46>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a47>   DW_AT_byte_size   : 4
    <a47>   DW_AT_type        : <0xa36>
 <1><a4b>: Abbrev Number: 5 (DW_TAG_typedef)
    <a4c>   DW_AT_name        : (indirect string, offset: 0xd4540): DMA_HandleTypeDef
    <a50>   DW_AT_decl_file   : 11
    <a51>   DW_AT_decl_line   : 167
    <a52>   DW_AT_decl_column : 2
    <a53>   DW_AT_type        : <0x96c>
 <1><a57>: Abbrev Number: 10 (DW_TAG_structure_type)
    <a58>   DW_AT_byte_size   : 16
    <a59>   DW_AT_decl_file   : 12
    <a5a>   DW_AT_decl_line   : 47
    <a5b>   DW_AT_decl_column : 9
    <a5b>   DW_AT_sibling     : <0xaef>
 <2><a5f>: Abbrev Number: 1 (DW_TAG_member)
    <a60>   DW_AT_name        : (indirect string, offset: 0x4cb5): Enable
    <a64>   DW_AT_decl_file   : 12
    <a65>   DW_AT_decl_line   : 49
    <a66>   DW_AT_decl_column : 26
    <a67>   DW_AT_type        : <0x94>
    <a6b>   DW_AT_data_member_location: 0
 <2><a6c>: Abbrev Number: 1 (DW_TAG_member)
    <a6d>   DW_AT_name        : (indirect string, offset: 0x103efc): Number
    <a71>   DW_AT_decl_file   : 12
    <a72>   DW_AT_decl_line   : 51
    <a73>   DW_AT_decl_column : 26
    <a74>   DW_AT_type        : <0x94>
    <a78>   DW_AT_data_member_location: 1
 <2><a79>: Abbrev Number: 1 (DW_TAG_member)
    <a7a>   DW_AT_name        : (indirect string, offset: 0x6ecc9): BaseAddress
    <a7e>   DW_AT_decl_file   : 12
    <a7f>   DW_AT_decl_line   : 53
    <a80>   DW_AT_decl_column : 26
    <a81>   DW_AT_type        : <0xb6>
    <a85>   DW_AT_data_member_location: 4
 <2><a86>: Abbrev Number: 1 (DW_TAG_member)
    <a87>   DW_AT_name        : (indirect string, offset: 0xf077e): Size
    <a8b>   DW_AT_decl_file   : 12
    <a8c>   DW_AT_decl_line   : 54
    <a8d>   DW_AT_decl_column : 26
    <a8e>   DW_AT_type        : <0x94>
    <a92>   DW_AT_data_member_location: 8
 <2><a93>: Abbrev Number: 1 (DW_TAG_member)
    <a94>   DW_AT_name        : (indirect string, offset: 0xadec): SubRegionDisable
    <a98>   DW_AT_decl_file   : 12
    <a99>   DW_AT_decl_line   : 56
    <a9a>   DW_AT_decl_column : 26
    <a9b>   DW_AT_type        : <0x94>
    <a9f>   DW_AT_data_member_location: 9
 <2><aa0>: Abbrev Number: 1 (DW_TAG_member)
    <aa1>   DW_AT_name        : (indirect string, offset: 0x25dab): TypeExtField
    <aa5>   DW_AT_decl_file   : 12
    <aa6>   DW_AT_decl_line   : 58
    <aa7>   DW_AT_decl_column : 26
    <aa8>   DW_AT_type        : <0x94>
    <aac>   DW_AT_data_member_location: 10
 <2><aad>: Abbrev Number: 1 (DW_TAG_member)
    <aae>   DW_AT_name        : (indirect string, offset: 0xf6147): AccessPermission
    <ab2>   DW_AT_decl_file   : 12
    <ab3>   DW_AT_decl_line   : 60
    <ab4>   DW_AT_decl_column : 26
    <ab5>   DW_AT_type        : <0x94>
    <ab9>   DW_AT_data_member_location: 11
 <2><aba>: Abbrev Number: 1 (DW_TAG_member)
    <abb>   DW_AT_name        : (indirect string, offset: 0x4d4e2): DisableExec
    <abf>   DW_AT_decl_file   : 12
    <ac0>   DW_AT_decl_line   : 62
    <ac1>   DW_AT_decl_column : 26
    <ac2>   DW_AT_type        : <0x94>
    <ac6>   DW_AT_data_member_location: 12
 <2><ac7>: Abbrev Number: 1 (DW_TAG_member)
    <ac8>   DW_AT_name        : (indirect string, offset: 0xbe7bd): IsShareable
    <acc>   DW_AT_decl_file   : 12
    <acd>   DW_AT_decl_line   : 64
    <ace>   DW_AT_decl_column : 26
    <acf>   DW_AT_type        : <0x94>
    <ad3>   DW_AT_data_member_location: 13
 <2><ad4>: Abbrev Number: 1 (DW_TAG_member)
    <ad5>   DW_AT_name        : (indirect string, offset: 0xe7f51): IsCacheable
    <ad9>   DW_AT_decl_file   : 12
    <ada>   DW_AT_decl_line   : 66
    <adb>   DW_AT_decl_column : 26
    <adc>   DW_AT_type        : <0x94>
    <ae0>   DW_AT_data_member_location: 14
 <2><ae1>: Abbrev Number: 1 (DW_TAG_member)
    <ae2>   DW_AT_name        : (indirect string, offset: 0x66cf8): IsBufferable
    <ae6>   DW_AT_decl_file   : 12
    <ae7>   DW_AT_decl_line   : 68
    <ae8>   DW_AT_decl_column : 26
    <ae9>   DW_AT_type        : <0x94>
    <aed>   DW_AT_data_member_location: 15
 <2><aee>: Abbrev Number: 0
 <1><aef>: Abbrev Number: 5 (DW_TAG_typedef)
    <af0>   DW_AT_name        : (indirect string, offset: 0xece3b): MPU_Region_InitTypeDef
    <af4>   DW_AT_decl_file   : 12
    <af5>   DW_AT_decl_line   : 70
    <af6>   DW_AT_decl_column : 2
    <af7>   DW_AT_type        : <0xa57>
 <1><afb>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <afc>   DW_AT_byte_size   : 4
    <afc>   DW_AT_type        : <0x94>
 <1><b00>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <b01>   DW_AT_byte_size   : 4
    <b01>   DW_AT_type        : <0xa4b>
 <1><b05>: Abbrev Number: 10 (DW_TAG_structure_type)
    <b06>   DW_AT_byte_size   : 52
    <b07>   DW_AT_decl_file   : 13
    <b08>   DW_AT_decl_line   : 46
    <b09>   DW_AT_decl_column : 9
    <b09>   DW_AT_sibling     : <0xbb7>
 <2><b0d>: Abbrev Number: 1 (DW_TAG_member)
    <b0e>   DW_AT_name        : (indirect string, offset: 0x6c026): Mode
    <b12>   DW_AT_decl_file   : 13
    <b13>   DW_AT_decl_line   : 48
    <b14>   DW_AT_decl_column : 12
    <b15>   DW_AT_type        : <0xb6>
    <b19>   DW_AT_data_member_location: 0
 <2><b1a>: Abbrev Number: 1 (DW_TAG_member)
    <b1b>   DW_AT_name        : (indirect string, offset: 0x5bd24): Direction
    <b1f>   DW_AT_decl_file   : 13
    <b20>   DW_AT_decl_line   : 51
    <b21>   DW_AT_decl_column : 12
    <b22>   DW_AT_type        : <0xb6>
    <b26>   DW_AT_data_member_location: 4
 <2><b27>: Abbrev Number: 1 (DW_TAG_member)
    <b28>   DW_AT_name        : (indirect string, offset: 0xbf7d8): DataSize
    <b2c>   DW_AT_decl_file   : 13
    <b2d>   DW_AT_decl_line   : 54
    <b2e>   DW_AT_decl_column : 12
    <b2f>   DW_AT_type        : <0xb6>
    <b33>   DW_AT_data_member_location: 8
 <2><b34>: Abbrev Number: 1 (DW_TAG_member)
    <b35>   DW_AT_name        : (indirect string, offset: 0x34225): CLKPolarity
    <b39>   DW_AT_decl_file   : 13
    <b3a>   DW_AT_decl_line   : 57
    <b3b>   DW_AT_decl_column : 12
    <b3c>   DW_AT_type        : <0xb6>
    <b40>   DW_AT_data_member_location: 12
 <2><b41>: Abbrev Number: 1 (DW_TAG_member)
    <b42>   DW_AT_name        : (indirect string, offset: 0xa8ae3): CLKPhase
    <b46>   DW_AT_decl_file   : 13
    <b47>   DW_AT_decl_line   : 60
    <b48>   DW_AT_decl_column : 12
    <b49>   DW_AT_type        : <0xb6>
    <b4d>   DW_AT_data_member_location: 16
 <2><b4e>: Abbrev Number: 24 (DW_TAG_member)
    <b4f>   DW_AT_name        : NSS
    <b53>   DW_AT_decl_file   : 13
    <b54>   DW_AT_decl_line   : 63
    <b55>   DW_AT_decl_column : 12
    <b56>   DW_AT_type        : <0xb6>
    <b5a>   DW_AT_data_member_location: 20
 <2><b5b>: Abbrev Number: 1 (DW_TAG_member)
    <b5c>   DW_AT_name        : (indirect string, offset: 0x216a1): BaudRatePrescaler
    <b60>   DW_AT_decl_file   : 13
    <b61>   DW_AT_decl_line   : 67
    <b62>   DW_AT_decl_column : 12
    <b63>   DW_AT_type        : <0xb6>
    <b67>   DW_AT_data_member_location: 24
 <2><b68>: Abbrev Number: 1 (DW_TAG_member)
    <b69>   DW_AT_name        : (indirect string, offset: 0xa259b): FirstBit
    <b6d>   DW_AT_decl_file   : 13
    <b6e>   DW_AT_decl_line   : 73
    <b6f>   DW_AT_decl_column : 12
    <b70>   DW_AT_type        : <0xb6>
    <b74>   DW_AT_data_member_location: 28
 <2><b75>: Abbrev Number: 1 (DW_TAG_member)
    <b76>   DW_AT_name        : (indirect string, offset: 0x908de): TIMode
    <b7a>   DW_AT_decl_file   : 13
    <b7b>   DW_AT_decl_line   : 76
    <b7c>   DW_AT_decl_column : 12
    <b7d>   DW_AT_type        : <0xb6>
    <b81>   DW_AT_data_member_location: 32
 <2><b82>: Abbrev Number: 1 (DW_TAG_member)
    <b83>   DW_AT_name        : (indirect string, offset: 0xb2fa4): CRCCalculation
    <b87>   DW_AT_decl_file   : 13
    <b88>   DW_AT_decl_line   : 79
    <b89>   DW_AT_decl_column : 12
    <b8a>   DW_AT_type        : <0xb6>
    <b8e>   DW_AT_data_member_location: 36
 <2><b8f>: Abbrev Number: 1 (DW_TAG_member)
    <b90>   DW_AT_name        : (indirect string, offset: 0x86141): CRCPolynomial
    <b94>   DW_AT_decl_file   : 13
    <b95>   DW_AT_decl_line   : 82
    <b96>   DW_AT_decl_column : 12
    <b97>   DW_AT_type        : <0xb6>
    <b9b>   DW_AT_data_member_location: 40
 <2><b9c>: Abbrev Number: 1 (DW_TAG_member)
    <b9d>   DW_AT_name        : (indirect string, offset: 0xb0510): CRCLength
    <ba1>   DW_AT_decl_file   : 13
    <ba2>   DW_AT_decl_line   : 85
    <ba3>   DW_AT_decl_column : 12
    <ba4>   DW_AT_type        : <0xb6>
    <ba8>   DW_AT_data_member_location: 44
 <2><ba9>: Abbrev Number: 1 (DW_TAG_member)
    <baa>   DW_AT_name        : (indirect string, offset: 0x75cb7): NSSPMode
    <bae>   DW_AT_decl_file   : 13
    <baf>   DW_AT_decl_line   : 89
    <bb0>   DW_AT_decl_column : 12
    <bb1>   DW_AT_type        : <0xb6>
    <bb5>   DW_AT_data_member_location: 48
 <2><bb6>: Abbrev Number: 0
 <1><bb7>: Abbrev Number: 5 (DW_TAG_typedef)
    <bb8>   DW_AT_name        : (indirect string, offset: 0x2ea93): SPI_InitTypeDef
    <bbc>   DW_AT_decl_file   : 13
    <bbd>   DW_AT_decl_line   : 95
    <bbe>   DW_AT_decl_column : 3
    <bbf>   DW_AT_type        : <0xb05>
 <1><bc3>: Abbrev Number: 19 (DW_TAG_enumeration_type)
    <bc4>   DW_AT_encoding    : 7	(unsigned)
    <bc4>   DW_AT_byte_size   : 1
    <bc4>   DW_AT_type        : <0x3d>
    <bc8>   DW_AT_decl_file   : 13
    <bc9>   DW_AT_decl_line   : 101
    <bca>   DW_AT_decl_column : 1
    <bca>   DW_AT_sibling     : <0xbff>
 <2><bce>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bcf>   DW_AT_name        : (indirect string, offset: 0xa5d31): HAL_SPI_STATE_RESET
    <bd3>   DW_AT_const_value : 0
 <2><bd4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bd5>   DW_AT_name        : (indirect string, offset: 0x302fc): HAL_SPI_STATE_READY
    <bd9>   DW_AT_const_value : 1
 <2><bda>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bdb>   DW_AT_name        : (indirect string, offset: 0xd24fe): HAL_SPI_STATE_BUSY
    <bdf>   DW_AT_const_value : 2
 <2><be0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <be1>   DW_AT_name        : (indirect string, offset: 0x86e46): HAL_SPI_STATE_BUSY_TX
    <be5>   DW_AT_const_value : 3
 <2><be6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <be7>   DW_AT_name        : (indirect string, offset: 0x85c80): HAL_SPI_STATE_BUSY_RX
    <beb>   DW_AT_const_value : 4
 <2><bec>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bed>   DW_AT_name        : (indirect string, offset: 0x2669e): HAL_SPI_STATE_BUSY_TX_RX
    <bf1>   DW_AT_const_value : 5
 <2><bf2>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bf3>   DW_AT_name        : (indirect string, offset: 0xc146b): HAL_SPI_STATE_ERROR
    <bf7>   DW_AT_const_value : 6
 <2><bf8>: Abbrev Number: 3 (DW_TAG_enumerator)
    <bf9>   DW_AT_name        : (indirect string, offset: 0x4304c): HAL_SPI_STATE_ABORT
    <bfd>   DW_AT_const_value : 7
 <2><bfe>: Abbrev Number: 0
 <1><bff>: Abbrev Number: 5 (DW_TAG_typedef)
    <c00>   DW_AT_name        : (indirect string, offset: 0xe1320): HAL_SPI_StateTypeDef
    <c04>   DW_AT_decl_file   : 13
    <c05>   DW_AT_decl_line   : 110
    <c06>   DW_AT_decl_column : 3
    <c07>   DW_AT_type        : <0xbc3>
 <1><c0b>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <c0c>   DW_AT_type        : <0xbff>
 <1><c10>: Abbrev Number: 25 (DW_TAG_structure_type)
    <c11>   DW_AT_name        : (indirect string, offset: 0xdd7d6): __SPI_HandleTypeDef
    <c15>   DW_AT_byte_size   : 100
    <c16>   DW_AT_decl_file   : 13
    <c17>   DW_AT_decl_line   : 115
    <c18>   DW_AT_decl_column : 16
    <c18>   DW_AT_sibling     : <0xced>
 <2><c1c>: Abbrev Number: 1 (DW_TAG_member)
    <c1d>   DW_AT_name        : (indirect string, offset: 0xf03b4): Instance
    <c21>   DW_AT_decl_file   : 13
    <c22>   DW_AT_decl_line   : 117
    <c23>   DW_AT_decl_column : 31
    <c24>   DW_AT_type        : <0xced>
    <c28>   DW_AT_data_member_location: 0
 <2><c29>: Abbrev Number: 1 (DW_TAG_member)
    <c2a>   DW_AT_name        : (indirect string, offset: 0xff54d): Init
    <c2e>   DW_AT_decl_file   : 13
    <c2f>   DW_AT_decl_line   : 119
    <c30>   DW_AT_decl_column : 30
    <c31>   DW_AT_type        : <0xbb7>
    <c35>   DW_AT_data_member_location: 4
 <2><c36>: Abbrev Number: 1 (DW_TAG_member)
    <c37>   DW_AT_name        : (indirect string, offset: 0x766ae): pTxBuffPtr
    <c3b>   DW_AT_decl_file   : 13
    <c3c>   DW_AT_decl_line   : 121
    <c3d>   DW_AT_decl_column : 31
    <c3e>   DW_AT_type        : <0xafb>
    <c42>   DW_AT_data_member_location: 56
 <2><c43>: Abbrev Number: 1 (DW_TAG_member)
    <c44>   DW_AT_name        : (indirect string, offset: 0x689d8): TxXferSize
    <c48>   DW_AT_decl_file   : 13
    <c49>   DW_AT_decl_line   : 123
    <c4a>   DW_AT_decl_column : 30
    <c4b>   DW_AT_type        : <0xa5>
    <c4f>   DW_AT_data_member_location: 60
 <2><c50>: Abbrev Number: 1 (DW_TAG_member)
    <c51>   DW_AT_name        : (indirect string, offset: 0xffb3a): TxXferCount
    <c55>   DW_AT_decl_file   : 13
    <c56>   DW_AT_decl_line   : 125
    <c57>   DW_AT_decl_column : 30
    <c58>   DW_AT_type        : <0xb1>
    <c5c>   DW_AT_data_member_location: 62
 <2><c5d>: Abbrev Number: 1 (DW_TAG_member)
    <c5e>   DW_AT_name        : (indirect string, offset: 0xe73ef): pRxBuffPtr
    <c62>   DW_AT_decl_file   : 13
    <c63>   DW_AT_decl_line   : 127
    <c64>   DW_AT_decl_column : 31
    <c65>   DW_AT_type        : <0xafb>
    <c69>   DW_AT_data_member_location: 64
 <2><c6a>: Abbrev Number: 1 (DW_TAG_member)
    <c6b>   DW_AT_name        : (indirect string, offset: 0x75bae): RxXferSize
    <c6f>   DW_AT_decl_file   : 13
    <c70>   DW_AT_decl_line   : 129
    <c71>   DW_AT_decl_column : 30
    <c72>   DW_AT_type        : <0xa5>
    <c76>   DW_AT_data_member_location: 68
 <2><c77>: Abbrev Number: 1 (DW_TAG_member)
    <c78>   DW_AT_name        : (indirect string, offset: 0xff60d): RxXferCount
    <c7c>   DW_AT_decl_file   : 13
    <c7d>   DW_AT_decl_line   : 131
    <c7e>   DW_AT_decl_column : 30
    <c7f>   DW_AT_type        : <0xb1>
    <c83>   DW_AT_data_member_location: 70
 <2><c84>: Abbrev Number: 1 (DW_TAG_member)
    <c85>   DW_AT_name        : (indirect string, offset: 0xf077b): CRCSize
    <c89>   DW_AT_decl_file   : 13
    <c8a>   DW_AT_decl_line   : 133
    <c8b>   DW_AT_decl_column : 30
    <c8c>   DW_AT_type        : <0xb6>
    <c90>   DW_AT_data_member_location: 72
 <2><c91>: Abbrev Number: 1 (DW_TAG_member)
    <c92>   DW_AT_name        : (indirect string, offset: 0xd6acd): RxISR
    <c96>   DW_AT_decl_file   : 13
    <c97>   DW_AT_decl_line   : 135
    <c98>   DW_AT_decl_column : 10
    <c99>   DW_AT_type        : <0xd02>
    <c9d>   DW_AT_data_member_location: 76
 <2><c9e>: Abbrev Number: 1 (DW_TAG_member)
    <c9f>   DW_AT_name        : (indirect string, offset: 0x7c2b5): TxISR
    <ca3>   DW_AT_decl_file   : 13
    <ca4>   DW_AT_decl_line   : 137
    <ca5>   DW_AT_decl_column : 10
    <ca6>   DW_AT_type        : <0xd02>
    <caa>   DW_AT_data_member_location: 80
 <2><cab>: Abbrev Number: 1 (DW_TAG_member)
    <cac>   DW_AT_name        : (indirect string, offset: 0xf1f19): hdmatx
    <cb0>   DW_AT_decl_file   : 13
    <cb1>   DW_AT_decl_line   : 139
    <cb2>   DW_AT_decl_column : 31
    <cb3>   DW_AT_type        : <0xb00>
    <cb7>   DW_AT_data_member_location: 84
 <2><cb8>: Abbrev Number: 1 (DW_TAG_member)
    <cb9>   DW_AT_name        : (indirect string, offset: 0xf0fd5): hdmarx
    <cbd>   DW_AT_decl_file   : 13
    <cbe>   DW_AT_decl_line   : 141
    <cbf>   DW_AT_decl_column : 31
    <cc0>   DW_AT_type        : <0xb00>
    <cc4>   DW_AT_data_member_location: 88
 <2><cc5>: Abbrev Number: 1 (DW_TAG_member)
    <cc6>   DW_AT_name        : (indirect string, offset: 0xb2891): Lock
    <cca>   DW_AT_decl_file   : 13
    <ccb>   DW_AT_decl_line   : 143
    <ccc>   DW_AT_decl_column : 30
    <ccd>   DW_AT_type        : <0x6cb>
    <cd1>   DW_AT_data_member_location: 92
 <2><cd2>: Abbrev Number: 1 (DW_TAG_member)
    <cd3>   DW_AT_name        : (indirect string, offset: 0x100b19): State
    <cd7>   DW_AT_decl_file   : 13
    <cd8>   DW_AT_decl_line   : 145
    <cd9>   DW_AT_decl_column : 30
    <cda>   DW_AT_type        : <0xc0b>
    <cde>   DW_AT_data_member_location: 93
 <2><cdf>: Abbrev Number: 1 (DW_TAG_member)
    <ce0>   DW_AT_name        : (indirect string, offset: 0xf2bb7): ErrorCode
    <ce4>   DW_AT_decl_file   : 13
    <ce5>   DW_AT_decl_line   : 147
    <ce6>   DW_AT_decl_column : 30
    <ce7>   DW_AT_type        : <0xc2>
    <ceb>   DW_AT_data_member_location: 96
 <2><cec>: Abbrev Number: 0
 <1><ced>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <cee>   DW_AT_byte_size   : 4
    <cee>   DW_AT_type        : <0x482>
 <1><cf2>: Abbrev Number: 26 (DW_TAG_subroutine_type)
    <cf3>   DW_AT_prototyped  : 1
    <cf3>   DW_AT_sibling     : <0xcfd>
 <2><cf7>: Abbrev Number: 6 (DW_TAG_formal_parameter)
    <cf8>   DW_AT_type        : <0xcfd>
 <2><cfc>: Abbrev Number: 0
 <1><cfd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <cfe>   DW_AT_byte_size   : 4
    <cfe>   DW_AT_type        : <0xc10>
 <1><d02>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <d03>   DW_AT_byte_size   : 4
    <d03>   DW_AT_type        : <0xcf2>
 <1><d07>: Abbrev Number: 5 (DW_TAG_typedef)
    <d08>   DW_AT_name        : (indirect string, offset: 0xdd7d8): SPI_HandleTypeDef
    <d0c>   DW_AT_decl_file   : 13
    <d0d>   DW_AT_decl_line   : 162
    <d0e>   DW_AT_decl_column : 3
    <d0f>   DW_AT_type        : <0xc10>
 <1><d13>: Abbrev Number: 10 (DW_TAG_structure_type)
    <d14>   DW_AT_byte_size   : 24
    <d15>   DW_AT_decl_file   : 14
    <d16>   DW_AT_decl_line   : 46
    <d17>   DW_AT_decl_column : 9
    <d17>   DW_AT_sibling     : <0xd6a>
 <2><d1b>: Abbrev Number: 1 (DW_TAG_member)
    <d1c>   DW_AT_name        : (indirect string, offset: 0x1002a4): Prescaler
    <d20>   DW_AT_decl_file   : 14
    <d21>   DW_AT_decl_line   : 48
    <d22>   DW_AT_decl_column : 12
    <d23>   DW_AT_type        : <0xb6>
    <d27>   DW_AT_data_member_location: 0
 <2><d28>: Abbrev Number: 1 (DW_TAG_member)
    <d29>   DW_AT_name        : (indirect string, offset: 0xe2584): CounterMode
    <d2d>   DW_AT_decl_file   : 14
    <d2e>   DW_AT_decl_line   : 51
    <d2f>   DW_AT_decl_column : 12
    <d30>   DW_AT_type        : <0xb6>
    <d34>   DW_AT_data_member_location: 4
 <2><d35>: Abbrev Number: 1 (DW_TAG_member)
    <d36>   DW_AT_name        : (indirect string, offset: 0x104a5e): Period
    <d3a>   DW_AT_decl_file   : 14
    <d3b>   DW_AT_decl_line   : 54
    <d3c>   DW_AT_decl_column : 12
    <d3d>   DW_AT_type        : <0xb6>
    <d41>   DW_AT_data_member_location: 8
 <2><d42>: Abbrev Number: 1 (DW_TAG_member)
    <d43>   DW_AT_name        : (indirect string, offset: 0x64bb9): ClockDivision
    <d47>   DW_AT_decl_file   : 14
    <d48>   DW_AT_decl_line   : 58
    <d49>   DW_AT_decl_column : 12
    <d4a>   DW_AT_type        : <0xb6>
    <d4e>   DW_AT_data_member_location: 12
 <2><d4f>: Abbrev Number: 1 (DW_TAG_member)
    <d50>   DW_AT_name        : (indirect string, offset: 0xaf0f9): RepetitionCounter
    <d54>   DW_AT_decl_file   : 14
    <d55>   DW_AT_decl_line   : 61
    <d56>   DW_AT_decl_column : 12
    <d57>   DW_AT_type        : <0xb6>
    <d5b>   DW_AT_data_member_location: 16
 <2><d5c>: Abbrev Number: 1 (DW_TAG_member)
    <d5d>   DW_AT_name        : (indirect string, offset: 0xe5d29): AutoReloadPreload
    <d61>   DW_AT_decl_file   : 14
    <d62>   DW_AT_decl_line   : 72
    <d63>   DW_AT_decl_column : 12
    <d64>   DW_AT_type        : <0xb6>
    <d68>   DW_AT_data_member_location: 20
 <2><d69>: Abbrev Number: 0
 <1><d6a>: Abbrev Number: 5 (DW_TAG_typedef)
    <d6b>   DW_AT_name        : (indirect string, offset: 0x55760): TIM_Base_InitTypeDef
    <d6f>   DW_AT_decl_file   : 14
    <d70>   DW_AT_decl_line   : 74
    <d71>   DW_AT_decl_column : 3
    <d72>   DW_AT_type        : <0xd13>
 <1><d76>: Abbrev Number: 10 (DW_TAG_structure_type)
    <d77>   DW_AT_byte_size   : 28
    <d78>   DW_AT_decl_file   : 14
    <d79>   DW_AT_decl_line   : 79
    <d7a>   DW_AT_decl_column : 9
    <d7a>   DW_AT_sibling     : <0xdda>
 <2><d7e>: Abbrev Number: 1 (DW_TAG_member)
    <d7f>   DW_AT_name        : (indirect string, offset: 0x6c024): OCMode
    <d83>   DW_AT_decl_file   : 14
    <d84>   DW_AT_decl_line   : 81
    <d85>   DW_AT_decl_column : 12
    <d86>   DW_AT_type        : <0xb6>
    <d8a>   DW_AT_data_member_location: 0
 <2><d8b>: Abbrev Number: 1 (DW_TAG_member)
    <d8c>   DW_AT_name        : (indirect string, offset: 0xd077b): Pulse
    <d90>   DW_AT_decl_file   : 14
    <d91>   DW_AT_decl_line   : 84
    <d92>   DW_AT_decl_column : 12
    <d93>   DW_AT_type        : <0xb6>
    <d97>   DW_AT_data_member_location: 4
 <2><d98>: Abbrev Number: 1 (DW_TAG_member)
    <d99>   DW_AT_name        : (indirect string, offset: 0xa510a): OCPolarity
    <d9d>   DW_AT_decl_file   : 14
    <d9e>   DW_AT_decl_line   : 87
    <d9f>   DW_AT_decl_column : 12
    <da0>   DW_AT_type        : <0xb6>
    <da4>   DW_AT_data_member_location: 8
 <2><da5>: Abbrev Number: 1 (DW_TAG_member)
    <da6>   DW_AT_name        : (indirect string, offset: 0x2ad3a): OCNPolarity
    <daa>   DW_AT_decl_file   : 14
    <dab>   DW_AT_decl_line   : 90
    <dac>   DW_AT_decl_column : 12
    <dad>   DW_AT_type        : <0xb6>
    <db1>   DW_AT_data_member_location: 12
 <2><db2>: Abbrev Number: 1 (DW_TAG_member)
    <db3>   DW_AT_name        : (indirect string, offset: 0x23a25): OCFastMode
    <db7>   DW_AT_decl_file   : 14
    <db8>   DW_AT_decl_line   : 94
    <db9>   DW_AT_decl_column : 12
    <dba>   DW_AT_type        : <0xb6>
    <dbe>   DW_AT_data_member_location: 16
 <2><dbf>: Abbrev Number: 1 (DW_TAG_member)
    <dc0>   DW_AT_name        : (indirect string, offset: 0x60602): OCIdleState
    <dc4>   DW_AT_decl_file   : 14
    <dc5>   DW_AT_decl_line   : 99
    <dc6>   DW_AT_decl_column : 12
    <dc7>   DW_AT_type        : <0xb6>
    <dcb>   DW_AT_data_member_location: 20
 <2><dcc>: Abbrev Number: 1 (DW_TAG_member)
    <dcd>   DW_AT_name        : (indirect string, offset: 0x21947): OCNIdleState
    <dd1>   DW_AT_decl_file   : 14
    <dd2>   DW_AT_decl_line   : 103
    <dd3>   DW_AT_decl_column : 12
    <dd4>   DW_AT_type        : <0xb6>
    <dd8>   DW_AT_data_member_location: 24
 <2><dd9>: Abbrev Number: 0
 <1><dda>: Abbrev Number: 5 (DW_TAG_typedef)
    <ddb>   DW_AT_name        : (indirect string, offset: 0x17f8f): TIM_OC_InitTypeDef
    <ddf>   DW_AT_decl_file   : 14
    <de0>   DW_AT_decl_line   : 106
    <de1>   DW_AT_decl_column : 3
    <de2>   DW_AT_type        : <0xd76>
 <1><de6>: Abbrev Number: 15 (DW_TAG_const_type)
    <de7>   DW_AT_type        : <0xdda>
 <1><deb>: Abbrev Number: 10 (DW_TAG_structure_type)
    <dec>   DW_AT_byte_size   : 16
    <ded>   DW_AT_decl_file   : 14
    <dee>   DW_AT_decl_line   : 198
    <def>   DW_AT_decl_column : 9
    <def>   DW_AT_sibling     : <0xe28>
 <2><df3>: Abbrev Number: 1 (DW_TAG_member)
    <df4>   DW_AT_name        : (indirect string, offset: 0x24ff5): ClockSource
    <df8>   DW_AT_decl_file   : 14
    <df9>   DW_AT_decl_line   : 200
    <dfa>   DW_AT_decl_column : 12
    <dfb>   DW_AT_type        : <0xb6>
    <dff>   DW_AT_data_member_location: 0
 <2><e00>: Abbrev Number: 1 (DW_TAG_member)
    <e01>   DW_AT_name        : (indirect string, offset: 0x88dd7): ClockPolarity
    <e05>   DW_AT_decl_file   : 14
    <e06>   DW_AT_decl_line   : 202
    <e07>   DW_AT_decl_column : 12
    <e08>   DW_AT_type        : <0xb6>
    <e0c>   DW_AT_data_member_location: 4
 <2><e0d>: Abbrev Number: 1 (DW_TAG_member)
    <e0e>   DW_AT_name        : (indirect string, offset: 0xdb8d8): ClockPrescaler
    <e12>   DW_AT_decl_file   : 14
    <e13>   DW_AT_decl_line   : 204
    <e14>   DW_AT_decl_column : 12
    <e15>   DW_AT_type        : <0xb6>
    <e19>   DW_AT_data_member_location: 8
 <2><e1a>: Abbrev Number: 1 (DW_TAG_member)
    <e1b>   DW_AT_name        : (indirect string, offset: 0xa13af): ClockFilter
    <e1f>   DW_AT_decl_file   : 14
    <e20>   DW_AT_decl_line   : 206
    <e21>   DW_AT_decl_column : 12
    <e22>   DW_AT_type        : <0xb6>
    <e26>   DW_AT_data_member_location: 12
 <2><e27>: Abbrev Number: 0
 <1><e28>: Abbrev Number: 5 (DW_TAG_typedef)
    <e29>   DW_AT_name        : (indirect string, offset: 0x7f08): TIM_ClockConfigTypeDef
    <e2d>   DW_AT_decl_file   : 14
    <e2e>   DW_AT_decl_line   : 208
    <e2f>   DW_AT_decl_column : 3
    <e30>   DW_AT_type        : <0xdeb>
 <1><e34>: Abbrev Number: 15 (DW_TAG_const_type)
    <e35>   DW_AT_type        : <0xe28>
 <1><e39>: Abbrev Number: 10 (DW_TAG_structure_type)
    <e3a>   DW_AT_byte_size   : 12
    <e3b>   DW_AT_decl_file   : 14
    <e3c>   DW_AT_decl_line   : 233
    <e3d>   DW_AT_decl_column : 9
    <e3d>   DW_AT_sibling     : <0xe69>
 <2><e41>: Abbrev Number: 1 (DW_TAG_member)
    <e42>   DW_AT_name        : (indirect string, offset: 0x93271): MasterOutputTrigger
    <e46>   DW_AT_decl_file   : 14
    <e47>   DW_AT_decl_line   : 235
    <e48>   DW_AT_decl_column : 13
    <e49>   DW_AT_type        : <0xb6>
    <e4d>   DW_AT_data_member_location: 0
 <2><e4e>: Abbrev Number: 1 (DW_TAG_member)
    <e4f>   DW_AT_name        : (indirect string, offset: 0xb2229): MasterOutputTrigger2
    <e53>   DW_AT_decl_file   : 14
    <e54>   DW_AT_decl_line   : 237
    <e55>   DW_AT_decl_column : 13
    <e56>   DW_AT_type        : <0xb6>
    <e5a>   DW_AT_data_member_location: 4
 <2><e5b>: Abbrev Number: 1 (DW_TAG_member)
    <e5c>   DW_AT_name        : (indirect string, offset: 0x822af): MasterSlaveMode
    <e60>   DW_AT_decl_file   : 14
    <e61>   DW_AT_decl_line   : 239
    <e62>   DW_AT_decl_column : 13
    <e63>   DW_AT_type        : <0xb6>
    <e67>   DW_AT_data_member_location: 8
 <2><e68>: Abbrev Number: 0
 <1><e69>: Abbrev Number: 5 (DW_TAG_typedef)
    <e6a>   DW_AT_name        : (indirect string, offset: 0xb4ec1): TIM_MasterConfigTypeDef
    <e6e>   DW_AT_decl_file   : 14
    <e6f>   DW_AT_decl_line   : 246
    <e70>   DW_AT_decl_column : 3
    <e71>   DW_AT_type        : <0xe39>
 <1><e75>: Abbrev Number: 15 (DW_TAG_const_type)
    <e76>   DW_AT_type        : <0xe69>
 <1><e7a>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <e7b>   DW_AT_encoding    : 7	(unsigned)
    <e7b>   DW_AT_byte_size   : 1
    <e7b>   DW_AT_type        : <0x3d>
    <e7f>   DW_AT_decl_file   : 14
    <e7f>   DW_AT_decl_line   : 301
    <e81>   DW_AT_decl_column : 1
    <e81>   DW_AT_sibling     : <0xea4>
 <2><e85>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e86>   DW_AT_name        : (indirect string, offset: 0x9c5ee): HAL_TIM_STATE_RESET
    <e8a>   DW_AT_const_value : 0
 <2><e8b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e8c>   DW_AT_name        : (indirect string, offset: 0x8d9a): HAL_TIM_STATE_READY
    <e90>   DW_AT_const_value : 1
 <2><e91>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e92>   DW_AT_name        : (indirect string, offset: 0x3ea39): HAL_TIM_STATE_BUSY
    <e96>   DW_AT_const_value : 2
 <2><e97>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e98>   DW_AT_name        : (indirect string, offset: 0x956a1): HAL_TIM_STATE_TIMEOUT
    <e9c>   DW_AT_const_value : 3
 <2><e9d>: Abbrev Number: 3 (DW_TAG_enumerator)
    <e9e>   DW_AT_name        : (indirect string, offset: 0x99bb8): HAL_TIM_STATE_ERROR
    <ea2>   DW_AT_const_value : 4
 <2><ea3>: Abbrev Number: 0
 <1><ea4>: Abbrev Number: 9 (DW_TAG_typedef)
    <ea5>   DW_AT_name        : (indirect string, offset: 0xa4c4c): HAL_TIM_StateTypeDef
    <ea9>   DW_AT_decl_file   : 14
    <eaa>   DW_AT_decl_line   : 307
    <eac>   DW_AT_decl_column : 3
    <eac>   DW_AT_type        : <0xe7a>
 <1><eb0>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <eb1>   DW_AT_type        : <0xea4>
 <1><eb5>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <eb6>   DW_AT_encoding    : 7	(unsigned)
    <eb6>   DW_AT_byte_size   : 1
    <eb6>   DW_AT_type        : <0x3d>
    <eba>   DW_AT_decl_file   : 14
    <eba>   DW_AT_decl_line   : 313
    <ebc>   DW_AT_decl_column : 1
    <ebc>   DW_AT_sibling     : <0xed3>
 <2><ec0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ec1>   DW_AT_name        : (indirect string, offset: 0xdd92): HAL_TIM_CHANNEL_STATE_RESET
    <ec5>   DW_AT_const_value : 0
 <2><ec6>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ec7>   DW_AT_name        : (indirect string, offset: 0xbff0d): HAL_TIM_CHANNEL_STATE_READY
    <ecb>   DW_AT_const_value : 1
 <2><ecc>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ecd>   DW_AT_name        : (indirect string, offset: 0x774fe): HAL_TIM_CHANNEL_STATE_BUSY
    <ed1>   DW_AT_const_value : 2
 <2><ed2>: Abbrev Number: 0
 <1><ed3>: Abbrev Number: 9 (DW_TAG_typedef)
    <ed4>   DW_AT_name        : (indirect string, offset: 0x34668): HAL_TIM_ChannelStateTypeDef
    <ed8>   DW_AT_decl_file   : 14
    <ed9>   DW_AT_decl_line   : 317
    <edb>   DW_AT_decl_column : 3
    <edb>   DW_AT_type        : <0xeb5>
 <1><edf>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <ee0>   DW_AT_type        : <0xed3>
 <1><ee4>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <ee5>   DW_AT_encoding    : 7	(unsigned)
    <ee5>   DW_AT_byte_size   : 1
    <ee5>   DW_AT_type        : <0x3d>
    <ee9>   DW_AT_decl_file   : 14
    <ee9>   DW_AT_decl_line   : 323
    <eeb>   DW_AT_decl_column : 1
    <eeb>   DW_AT_sibling     : <0xf02>
 <2><eef>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ef0>   DW_AT_name        : (indirect string, offset: 0x50af): HAL_DMA_BURST_STATE_RESET
    <ef4>   DW_AT_const_value : 0
 <2><ef5>: Abbrev Number: 3 (DW_TAG_enumerator)
    <ef6>   DW_AT_name        : (indirect string, offset: 0x8893d): HAL_DMA_BURST_STATE_READY
    <efa>   DW_AT_const_value : 1
 <2><efb>: Abbrev Number: 3 (DW_TAG_enumerator)
    <efc>   DW_AT_name        : (indirect string, offset: 0x5358d): HAL_DMA_BURST_STATE_BUSY
    <f00>   DW_AT_const_value : 2
 <2><f01>: Abbrev Number: 0
 <1><f02>: Abbrev Number: 9 (DW_TAG_typedef)
    <f03>   DW_AT_name        : (indirect string, offset: 0x61e20): HAL_TIM_DMABurstStateTypeDef
    <f07>   DW_AT_decl_file   : 14
    <f08>   DW_AT_decl_line   : 327
    <f0a>   DW_AT_decl_column : 3
    <f0a>   DW_AT_type        : <0xee4>
 <1><f0e>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <f0f>   DW_AT_type        : <0xf02>
 <1><f13>: Abbrev Number: 20 (DW_TAG_enumeration_type)
    <f14>   DW_AT_encoding    : 7	(unsigned)
    <f14>   DW_AT_byte_size   : 1
    <f14>   DW_AT_type        : <0x3d>
    <f18>   DW_AT_decl_file   : 14
    <f18>   DW_AT_decl_line   : 333
    <f1a>   DW_AT_decl_column : 1
    <f1a>   DW_AT_sibling     : <0xf49>
 <2><f1e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f1f>   DW_AT_name        : (indirect string, offset: 0x8c785): HAL_TIM_ACTIVE_CHANNEL_1
    <f23>   DW_AT_const_value : 1
 <2><f24>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f25>   DW_AT_name        : (indirect string, offset: 0x8c79e): HAL_TIM_ACTIVE_CHANNEL_2
    <f29>   DW_AT_const_value : 2
 <2><f2a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f2b>   DW_AT_name        : (indirect string, offset: 0x8c7b7): HAL_TIM_ACTIVE_CHANNEL_3
    <f2f>   DW_AT_const_value : 4
 <2><f30>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f31>   DW_AT_name        : (indirect string, offset: 0x8c7d0): HAL_TIM_ACTIVE_CHANNEL_4
    <f35>   DW_AT_const_value : 8
 <2><f36>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f37>   DW_AT_name        : (indirect string, offset: 0x8c7e9): HAL_TIM_ACTIVE_CHANNEL_5
    <f3b>   DW_AT_const_value : 16
 <2><f3c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f3d>   DW_AT_name        : (indirect string, offset: 0x8c802): HAL_TIM_ACTIVE_CHANNEL_6
    <f41>   DW_AT_const_value : 32
 <2><f42>: Abbrev Number: 3 (DW_TAG_enumerator)
    <f43>   DW_AT_name        : (indirect string, offset: 0x663d4): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <f47>   DW_AT_const_value : 0
 <2><f48>: Abbrev Number: 0
 <1><f49>: Abbrev Number: 9 (DW_TAG_typedef)
    <f4a>   DW_AT_name        : (indirect string, offset: 0x80ba6): HAL_TIM_ActiveChannel
    <f4e>   DW_AT_decl_file   : 14
    <f4f>   DW_AT_decl_line   : 341
    <f51>   DW_AT_decl_column : 3
    <f51>   DW_AT_type        : <0xf13>
 <1><f55>: Abbrev Number: 14 (DW_TAG_structure_type)
    <f56>   DW_AT_byte_size   : 76
    <f57>   DW_AT_decl_file   : 14
    <f58>   DW_AT_decl_line   : 349
    <f5a>   DW_AT_decl_column : 9
    <f5a>   DW_AT_sibling     : <0xfdd>
 <2><f5e>: Abbrev Number: 2 (DW_TAG_member)
    <f5f>   DW_AT_name        : (indirect string, offset: 0xf03b4): Instance
    <f63>   DW_AT_decl_file   : 14
    <f64>   DW_AT_decl_line   : 352
    <f66>   DW_AT_decl_column : 39
    <f67>   DW_AT_type        : <0xfdd>
    <f6b>   DW_AT_data_member_location: 0
 <2><f6c>: Abbrev Number: 2 (DW_TAG_member)
    <f6d>   DW_AT_name        : (indirect string, offset: 0xff54d): Init
    <f71>   DW_AT_decl_file   : 14
    <f72>   DW_AT_decl_line   : 353
    <f74>   DW_AT_decl_column : 38
    <f75>   DW_AT_type        : <0xd6a>
    <f79>   DW_AT_data_member_location: 4
 <2><f7a>: Abbrev Number: 2 (DW_TAG_member)
    <f7b>   DW_AT_name        : (indirect string, offset: 0x80bb4): Channel
    <f7f>   DW_AT_decl_file   : 14
    <f80>   DW_AT_decl_line   : 354
    <f82>   DW_AT_decl_column : 38
    <f83>   DW_AT_type        : <0xf49>
    <f87>   DW_AT_data_member_location: 28
 <2><f88>: Abbrev Number: 2 (DW_TAG_member)
    <f89>   DW_AT_name        : (indirect string, offset: 0x95cfd): hdma
    <f8d>   DW_AT_decl_file   : 14
    <f8e>   DW_AT_decl_line   : 355
    <f90>   DW_AT_decl_column : 39
    <f91>   DW_AT_type        : <0xfe2>
    <f95>   DW_AT_data_member_location: 32
 <2><f96>: Abbrev Number: 2 (DW_TAG_member)
    <f97>   DW_AT_name        : (indirect string, offset: 0xb2891): Lock
    <f9b>   DW_AT_decl_file   : 14
    <f9c>   DW_AT_decl_line   : 357
    <f9e>   DW_AT_decl_column : 38
    <f9f>   DW_AT_type        : <0x6cb>
    <fa3>   DW_AT_data_member_location: 60
 <2><fa4>: Abbrev Number: 2 (DW_TAG_member)
    <fa5>   DW_AT_name        : (indirect string, offset: 0x100b19): State
    <fa9>   DW_AT_decl_file   : 14
    <faa>   DW_AT_decl_line   : 358
    <fac>   DW_AT_decl_column : 38
    <fad>   DW_AT_type        : <0xeb0>
    <fb1>   DW_AT_data_member_location: 61
 <2><fb2>: Abbrev Number: 2 (DW_TAG_member)
    <fb3>   DW_AT_name        : (indirect string, offset: 0x1007a3): ChannelState
    <fb7>   DW_AT_decl_file   : 14
    <fb8>   DW_AT_decl_line   : 359
    <fba>   DW_AT_decl_column : 38
    <fbb>   DW_AT_type        : <0x1002>
    <fbf>   DW_AT_data_member_location: 62
 <2><fc0>: Abbrev Number: 2 (DW_TAG_member)
    <fc1>   DW_AT_name        : (indirect string, offset: 0x100da0): ChannelNState
    <fc5>   DW_AT_decl_file   : 14
    <fc6>   DW_AT_decl_line   : 360
    <fc8>   DW_AT_decl_column : 38
    <fc9>   DW_AT_type        : <0x1017>
    <fcd>   DW_AT_data_member_location: 68
 <2><fce>: Abbrev Number: 2 (DW_TAG_member)
    <fcf>   DW_AT_name        : (indirect string, offset: 0x100362): DMABurstState
    <fd3>   DW_AT_decl_file   : 14
    <fd4>   DW_AT_decl_line   : 361
    <fd6>   DW_AT_decl_column : 38
    <fd7>   DW_AT_type        : <0xf0e>
    <fdb>   DW_AT_data_member_location: 72
 <2><fdc>: Abbrev Number: 0
 <1><fdd>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <fde>   DW_AT_byte_size   : 4
    <fde>   DW_AT_type        : <0x5d2>
 <1><fe2>: Abbrev Number: 16 (DW_TAG_array_type)
    <fe3>   DW_AT_type        : <0xb00>
    <fe7>   DW_AT_sibling     : <0xff2>
 <2><feb>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <fec>   DW_AT_type        : <0x8d>
    <ff0>   DW_AT_upper_bound : 6
 <2><ff1>: Abbrev Number: 0
 <1><ff2>: Abbrev Number: 16 (DW_TAG_array_type)
    <ff3>   DW_AT_type        : <0xedf>
    <ff7>   DW_AT_sibling     : <0x1002>
 <2><ffb>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <ffc>   DW_AT_type        : <0x8d>
    <1000>   DW_AT_upper_bound : 5
 <2><1001>: Abbrev Number: 0
 <1><1002>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <1003>   DW_AT_type        : <0xff2>
 <1><1007>: Abbrev Number: 16 (DW_TAG_array_type)
    <1008>   DW_AT_type        : <0xedf>
    <100c>   DW_AT_sibling     : <0x1017>
 <2><1010>: Abbrev Number: 17 (DW_TAG_subrange_type)
    <1011>   DW_AT_type        : <0x8d>
    <1015>   DW_AT_upper_bound : 3
 <2><1016>: Abbrev Number: 0
 <1><1017>: Abbrev Number: 8 (DW_TAG_volatile_type)
    <1018>   DW_AT_type        : <0x1007>
 <1><101c>: Abbrev Number: 9 (DW_TAG_typedef)
    <101d>   DW_AT_name        : (indirect string, offset: 0x550d3): TIM_HandleTypeDef
    <1021>   DW_AT_decl_file   : 14
    <1022>   DW_AT_decl_line   : 393
    <1024>   DW_AT_decl_column : 3
    <1024>   DW_AT_type        : <0xf55>
 <1><1028>: Abbrev Number: 10 (DW_TAG_structure_type)
    <1029>   DW_AT_byte_size   : 32
    <102a>   DW_AT_decl_file   : 15
    <102b>   DW_AT_decl_line   : 46
    <102c>   DW_AT_decl_column : 9
    <102c>   DW_AT_sibling     : <0x1099>
 <2><1030>: Abbrev Number: 1 (DW_TAG_member)
    <1031>   DW_AT_name        : (indirect string, offset: 0xe3e75): BaudRate
    <1035>   DW_AT_decl_file   : 15
    <1036>   DW_AT_decl_line   : 48
    <1037>   DW_AT_decl_column : 12
    <1038>   DW_AT_type        : <0xb6>
    <103c>   DW_AT_data_member_location: 0
 <2><103d>: Abbrev Number: 1 (DW_TAG_member)
    <103e>   DW_AT_name        : (indirect string, offset: 0x71f8): WordLength
    <1042>   DW_AT_decl_file   : 15
    <1043>   DW_AT_decl_line   : 60
    <1044>   DW_AT_decl_column : 12
    <1045>   DW_AT_type        : <0xb6>
    <1049>   DW_AT_data_member_location: 4
 <2><104a>: Abbrev Number: 1 (DW_TAG_member)
    <104b>   DW_AT_name        : (indirect string, offset: 0xe426b): StopBits
    <104f>   DW_AT_decl_file   : 15
    <1050>   DW_AT_decl_line   : 63
    <1051>   DW_AT_decl_column : 12
    <1052>   DW_AT_type        : <0xb6>
    <1056>   DW_AT_data_member_location: 8
 <2><1057>: Abbrev Number: 1 (DW_TAG_member)
    <1058>   DW_AT_name        : (indirect string, offset: 0x59339): Parity
    <105c>   DW_AT_decl_file   : 15
    <105d>   DW_AT_decl_line   : 66
    <105e>   DW_AT_decl_column : 12
    <105f>   DW_AT_type        : <0xb6>
    <1063>   DW_AT_data_member_location: 12
 <2><1064>: Abbrev Number: 1 (DW_TAG_member)
    <1065>   DW_AT_name        : (indirect string, offset: 0x6c026): Mode
    <1069>   DW_AT_decl_file   : 15
    <106a>   DW_AT_decl_line   : 73
    <106b>   DW_AT_decl_column : 12
    <106c>   DW_AT_type        : <0xb6>
    <1070>   DW_AT_data_member_location: 16
 <2><1071>: Abbrev Number: 1 (DW_TAG_member)
    <1072>   DW_AT_name        : (indirect string, offset: 0x93c31): HwFlowCtl
    <1076>   DW_AT_decl_file   : 15
    <1077>   DW_AT_decl_line   : 76
    <1078>   DW_AT_decl_column : 12
    <1079>   DW_AT_type        : <0xb6>
    <107d>   DW_AT_data_member_location: 20
 <2><107e>: Abbrev Number: 1 (DW_TAG_member)
    <107f>   DW_AT_name        : (indirect string, offset: 0xd12d7): OverSampling
    <1083>   DW_AT_decl_file   : 15
    <1084>   DW_AT_decl_line   : 80
    <1085>   DW_AT_decl_column : 12
    <1086>   DW_AT_type        : <0xb6>
    <108a>   DW_AT_data_member_location: 24
 <2><108b>: Abbrev Number: 1 (DW_TAG_member)
