Contents of the .debug_info section:

  Compilation Unit @ offset 0:
   Length:        0xeb5 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0
   Pointer Size:  4
 <0><c>: Abbrev Number: 29 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0x2452): GNU C17 13.3.1 20240614 -mcpu=cortex-m7 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fpv5 -g3 -O0 -std=gnu17 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x110b): C:/Users/hans-/Nextcloud/Documents/DHBW/Labor/Labor_HWNahesProg_Echtzeitsysteme/Semester4/Solution/libs/LibL6474/src/LibL6474x.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x11a): C:/Users/hans-/Nextcloud/Documents/DHBW/Labor/Labor_HWNahesProg_Echtzeitsysteme/Semester4/Solution/stepper/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0
    <22>   DW_AT_stmt_list   : 0
    <26>   DW_AT_macros      : 0
 <1><2a>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <2b>   DW_AT_name        : (indirect string, offset: 0x118c): L6474x_State
    <2f>   DW_AT_encoding    : 7	(unsigned)
    <30>   DW_AT_byte_size   : 1
    <30>   DW_AT_type        : <0x53>
    <34>   DW_AT_decl_file   : 2
    <35>   DW_AT_decl_line   : 26
    <36>   DW_AT_decl_column : 14
    <36>   DW_AT_sibling     : <0x53>
 <2><3a>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3b>   DW_AT_name        : (indirect string, offset: 0x2af3): stRESET
    <3f>   DW_AT_const_value : 0
 <2><40>: Abbrev Number: 1 (DW_TAG_enumerator)
    <41>   DW_AT_name        : (indirect string, offset: 0x2954): stDISABLED
    <45>   DW_AT_const_value : 1
 <2><46>: Abbrev Number: 1 (DW_TAG_enumerator)
    <47>   DW_AT_name        : (indirect string, offset: 0x242): stENABLED
    <4b>   DW_AT_const_value : 2
 <2><4c>: Abbrev Number: 1 (DW_TAG_enumerator)
    <4d>   DW_AT_name        : (indirect string, offset: 0x2a24): stINVALID
    <51>   DW_AT_const_value : 4
 <2><52>: Abbrev Number: 0
 <1><53>: Abbrev Number: 17 (DW_TAG_base_type)
    <54>   DW_AT_byte_size   : 1
    <55>   DW_AT_encoding    : 8	(unsigned char)
    <56>   DW_AT_name        : (indirect string, offset: 0x3069): unsigned char
 <1><5a>: Abbrev Number: 13 (DW_TAG_typedef)
    <5b>   DW_AT_name        : (indirect string, offset: 0x2b11): L6474x_State_t
    <5f>   DW_AT_decl_file   : 2
    <60>   DW_AT_decl_line   : 54
    <61>   DW_AT_decl_column : 3
    <61>   DW_AT_type        : <0x2a>
 <1><65>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <66>   DW_AT_name        : (indirect string, offset: 0xece): L6474x_StepMode
    <6a>   DW_AT_encoding    : 7	(unsigned)
    <6b>   DW_AT_byte_size   : 1
    <6b>   DW_AT_type        : <0x53>
    <6f>   DW_AT_decl_file   : 2
    <70>   DW_AT_decl_line   : 63
    <71>   DW_AT_decl_column : 14
    <71>   DW_AT_sibling     : <0x94>
 <2><75>: Abbrev Number: 1 (DW_TAG_enumerator)
    <76>   DW_AT_name        : (indirect string, offset: 0x1511): smFULL
    <7a>   DW_AT_const_value : 0
 <2><7b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <7c>   DW_AT_name        : (indirect string, offset: 0x218b): smHALF
    <80>   DW_AT_const_value : 1
 <2><81>: Abbrev Number: 1 (DW_TAG_enumerator)
    <82>   DW_AT_name        : (indirect string, offset: 0x3ae1): smMICRO4
    <86>   DW_AT_const_value : 2
 <2><87>: Abbrev Number: 1 (DW_TAG_enumerator)
    <88>   DW_AT_name        : (indirect string, offset: 0x27b9): smMICRO8
    <8c>   DW_AT_const_value : 3
 <2><8d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <8e>   DW_AT_name        : (indirect string, offset: 0x16ed): smMICRO16
    <92>   DW_AT_const_value : 4
 <2><93>: Abbrev Number: 0
 <1><94>: Abbrev Number: 13 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x2fb3): L6474x_StepMode_t
    <99>   DW_AT_decl_file   : 2
    <9a>   DW_AT_decl_line   : 91
    <9b>   DW_AT_decl_column : 3
    <9b>   DW_AT_type        : <0x65>
 <1><9f>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <a0>   DW_AT_name        : (indirect string, offset: 0x1ecd): L6474x_ErrorCode
    <a4>   DW_AT_encoding    : 5	(signed)
    <a5>   DW_AT_byte_size   : 1
    <a5>   DW_AT_type        : <0xe6>
    <a9>   DW_AT_decl_file   : 2
    <aa>   DW_AT_decl_line   : 116
    <ab>   DW_AT_decl_column : 14
    <ab>   DW_AT_sibling     : <0xe6>
 <2><af>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b0>   DW_AT_name        : (indirect string, offset: 0x324d): errcNONE
    <b4>   DW_AT_const_value : 0
 <2><b5>: Abbrev Number: 11 (DW_TAG_enumerator)
    <b6>   DW_AT_name        : (indirect string, offset: 0x533): errcINV_ARG
    <ba>   DW_AT_const_value : -1
 <2><bb>: Abbrev Number: 11 (DW_TAG_enumerator)
    <bc>   DW_AT_name        : (indirect string, offset: 0x2b3a): errcNULL_ARG
    <c0>   DW_AT_const_value : -2
 <2><c1>: Abbrev Number: 11 (DW_TAG_enumerator)
    <c2>   DW_AT_name        : (indirect string, offset: 0x2a39): errcINV_STATE
    <c6>   DW_AT_const_value : -3
 <2><c7>: Abbrev Number: 11 (DW_TAG_enumerator)
    <c8>   DW_AT_name        : (indirect string, offset: 0x2eec): errcINTERNAL
    <cc>   DW_AT_const_value : -4
 <2><cd>: Abbrev Number: 11 (DW_TAG_enumerator)
    <ce>   DW_AT_name        : (indirect string, offset: 0x1505): errcLOCKING
    <d2>   DW_AT_const_value : -5
 <2><d3>: Abbrev Number: 11 (DW_TAG_enumerator)
    <d4>   DW_AT_name        : (indirect string, offset: 0x10d7): errcDEVICE_STATE
    <d8>   DW_AT_const_value : -6
 <2><d9>: Abbrev Number: 11 (DW_TAG_enumerator)
    <da>   DW_AT_name        : (indirect string, offset: 0x2832): errcPENDING
    <de>   DW_AT_const_value : -7
 <2><df>: Abbrev Number: 11 (DW_TAG_enumerator)
    <e0>   DW_AT_name        : (indirect string, offset: 0x1abd): errcFORBIDDEN
    <e4>   DW_AT_const_value : -8
 <2><e5>: Abbrev Number: 0
 <1><e6>: Abbrev Number: 17 (DW_TAG_base_type)
    <e7>   DW_AT_byte_size   : 1
    <e8>   DW_AT_encoding    : 6	(signed char)
    <e9>   DW_AT_name        : (indirect string, offset: 0x2e4e): signed char
 <1><ed>: Abbrev Number: 24 (DW_TAG_structure_type)
    <ee>   DW_AT_name        : (indirect string, offset: 0xb23): L6474_Status
    <f2>   DW_AT_byte_size   : 9
    <f3>   DW_AT_decl_file   : 2
    <f4>   DW_AT_decl_line   : 176
    <f5>   DW_AT_decl_column : 16
    <f6>   DW_AT_sibling     : <0x170>
 <2><fa>: Abbrev Number: 6 (DW_TAG_member)
    <fb>   DW_AT_name        : (indirect string, offset: 0x3b84): HIGHZ
    <ff>   DW_AT_decl_file   : 2
    <100>   DW_AT_decl_line   : 182
    <101>   DW_AT_decl_column : 16
    <102>   DW_AT_type        : <0x53>
    <106>   DW_AT_data_member_location: 0
 <2><107>: Abbrev Number: 25 (DW_TAG_member)
    <108>   DW_AT_name        : DIR
    <10c>   DW_AT_decl_file   : 2
    <10d>   DW_AT_decl_line   : 187
    <10e>   DW_AT_decl_column : 16
    <10f>   DW_AT_type        : <0x53>
    <113>   DW_AT_data_member_location: 1
 <2><114>: Abbrev Number: 6 (DW_TAG_member)
    <115>   DW_AT_name        : (indirect string, offset: 0x2058): NOTPERF_CMD
    <119>   DW_AT_decl_file   : 2
    <11a>   DW_AT_decl_line   : 192
    <11b>   DW_AT_decl_column : 16
    <11c>   DW_AT_type        : <0x53>
    <120>   DW_AT_data_member_location: 2
 <2><121>: Abbrev Number: 6 (DW_TAG_member)
    <122>   DW_AT_name        : (indirect string, offset: 0x329a): WRONG_CMD
    <126>   DW_AT_decl_file   : 2
    <127>   DW_AT_decl_line   : 197
    <128>   DW_AT_decl_column : 16
    <129>   DW_AT_type        : <0x53>
    <12d>   DW_AT_data_member_location: 3
 <2><12e>: Abbrev Number: 6 (DW_TAG_member)
    <12f>   DW_AT_name        : (indirect string, offset: 0x3295): UVLO
    <133>   DW_AT_decl_file   : 2
    <134>   DW_AT_decl_line   : 202
    <135>   DW_AT_decl_column : 16
    <136>   DW_AT_type        : <0x53>
    <13a>   DW_AT_data_member_location: 4
 <2><13b>: Abbrev Number: 6 (DW_TAG_member)
    <13c>   DW_AT_name        : (indirect string, offset: 0xe7d): TH_WARN
    <140>   DW_AT_decl_file   : 2
    <141>   DW_AT_decl_line   : 207
    <142>   DW_AT_decl_column : 16
    <143>   DW_AT_type        : <0x53>
    <147>   DW_AT_data_member_location: 5
 <2><148>: Abbrev Number: 6 (DW_TAG_member)
    <149>   DW_AT_name        : (indirect string, offset: 0x1c37): TH_SD
    <14d>   DW_AT_decl_file   : 2
    <14e>   DW_AT_decl_line   : 212
    <14f>   DW_AT_decl_column : 16
    <150>   DW_AT_type        : <0x53>
    <154>   DW_AT_data_member_location: 6
 <2><155>: Abbrev Number: 25 (DW_TAG_member)
    <156>   DW_AT_name        : OCD
    <15a>   DW_AT_decl_file   : 2
    <15b>   DW_AT_decl_line   : 217
    <15c>   DW_AT_decl_column : 16
    <15d>   DW_AT_type        : <0x53>
    <161>   DW_AT_data_member_location: 7
 <2><162>: Abbrev Number: 6 (DW_TAG_member)
    <163>   DW_AT_name        : (indirect string, offset: 0x8103b): ONGOING
    <167>   DW_AT_decl_file   : 2
    <168>   DW_AT_decl_line   : 222
    <169>   DW_AT_decl_column : 16
    <16a>   DW_AT_type        : <0x53>
    <16e>   DW_AT_data_member_location: 8
 <2><16f>: Abbrev Number: 0
 <1><170>: Abbrev Number: 13 (DW_TAG_typedef)
    <171>   DW_AT_name        : (indirect string, offset: 0x2f1e): L6474_Status_t
    <175>   DW_AT_decl_file   : 2
    <176>   DW_AT_decl_line   : 223
    <177>   DW_AT_decl_column : 3
    <177>   DW_AT_type        : <0xed>
 <1><17b>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <17c>   DW_AT_name        : (indirect string, offset: 0x39a2): L6474x_OCD_TH
    <180>   DW_AT_encoding    : 7	(unsigned)
    <181>   DW_AT_byte_size   : 1
    <181>   DW_AT_type        : <0x53>
    <185>   DW_AT_decl_file   : 2
    <186>   DW_AT_decl_line   : 231
    <187>   DW_AT_decl_column : 14
    <187>   DW_AT_sibling     : <0x1ec>
 <2><18b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <18c>   DW_AT_name        : (indirect string, offset: 0xc18): ocdth375mA
    <190>   DW_AT_const_value : 0
 <2><191>: Abbrev Number: 1 (DW_TAG_enumerator)
    <192>   DW_AT_name        : (indirect string, offset: 0x2a2e): ocdth750mA
    <196>   DW_AT_const_value : 1
 <2><197>: Abbrev Number: 1 (DW_TAG_enumerator)
    <198>   DW_AT_name        : (indirect string, offset: 0x2984): ocdth1125mA
    <19c>   DW_AT_const_value : 2
 <2><19d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <19e>   DW_AT_name        : (indirect string, offset: 0x9e0): ocdth1500mA
    <1a2>   DW_AT_const_value : 3
 <2><1a3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1a4>   DW_AT_name        : (indirect string, offset: 0x24c): ocdth1875mA
    <1a8>   DW_AT_const_value : 4
 <2><1a9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1aa>   DW_AT_name        : (indirect string, offset: 0x25a5): ocdth2250mA
    <1ae>   DW_AT_const_value : 5
 <2><1af>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1b0>   DW_AT_name        : (indirect string, offset: 0x37d): ocdth2625mA
    <1b4>   DW_AT_const_value : 6
 <2><1b5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1b6>   DW_AT_name        : (indirect string, offset: 0x1c3): ocdth3000mA
    <1ba>   DW_AT_const_value : 7
 <2><1bb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1bc>   DW_AT_name        : (indirect string, offset: 0x3d70): ocdth3375mA
    <1c0>   DW_AT_const_value : 8
 <2><1c1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1c2>   DW_AT_name        : (indirect string, offset: 0x1eaa): ocdth3750mA
    <1c6>   DW_AT_const_value : 9
 <2><1c7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1c8>   DW_AT_name        : (indirect string, offset: 0x1dd9): ocdth4125mA
    <1cc>   DW_AT_const_value : 10
 <2><1cd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1ce>   DW_AT_name        : (indirect string, offset: 0x25fc): ocdth4500mA
    <1d2>   DW_AT_const_value : 11
 <2><1d3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1d4>   DW_AT_name        : (indirect string, offset: 0x34b5): ocdth4875mA
    <1d8>   DW_AT_const_value : 12
 <2><1d9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1da>   DW_AT_name        : (indirect string, offset: 0x195a): ocdth5250mA
    <1de>   DW_AT_const_value : 13
 <2><1df>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1e0>   DW_AT_name        : (indirect string, offset: 0xff5): ocdth5625mA
    <1e4>   DW_AT_const_value : 14
 <2><1e5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <1e6>   DW_AT_name        : (indirect string, offset: 0x34d8): ocdth6000mA
    <1ea>   DW_AT_const_value : 15
 <2><1eb>: Abbrev Number: 0
 <1><1ec>: Abbrev Number: 13 (DW_TAG_typedef)
    <1ed>   DW_AT_name        : (indirect string, offset: 0x2b47): L6474x_OCD_TH_t
    <1f1>   DW_AT_decl_file   : 2
    <1f2>   DW_AT_decl_line   : 250
    <1f3>   DW_AT_decl_column : 3
    <1f3>   DW_AT_type        : <0x17b>
 <1><1f7>: Abbrev Number: 18 (DW_TAG_typedef)
    <1f8>   DW_AT_name        : (indirect string, offset: 0x33f0): L6474_Handle_t
    <1fc>   DW_AT_decl_file   : 2
    <1fc>   DW_AT_decl_line   : 258
    <1fe>   DW_AT_decl_column : 30
    <1ff>   DW_AT_type        : <0x203>
 <1><203>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <204>   DW_AT_byte_size   : 4
    <204>   DW_AT_type        : <0x208>
 <1><208>: Abbrev Number: 24 (DW_TAG_structure_type)
    <209>   DW_AT_name        : (indirect string, offset: 0x2947): L6474_Handle
    <20d>   DW_AT_byte_size   : 24
    <20e>   DW_AT_decl_file   : 1
    <20f>   DW_AT_decl_line   : 146
    <210>   DW_AT_decl_column : 8
    <211>   DW_AT_sibling     : <0x264>
 <2><215>: Abbrev Number: 6 (DW_TAG_member)
    <216>   DW_AT_name        : (indirect string, offset: 0x1016d0): state
    <21a>   DW_AT_decl_file   : 1
    <21b>   DW_AT_decl_line   : 149
    <21c>   DW_AT_decl_column : 21
    <21d>   DW_AT_type        : <0x5a>
    <221>   DW_AT_data_member_location: 0
 <2><222>: Abbrev Number: 6 (DW_TAG_member)
    <223>   DW_AT_name        : (indirect string, offset: 0x18c5): pending
    <227>   DW_AT_decl_file   : 1
    <228>   DW_AT_decl_line   : 150
    <229>   DW_AT_decl_column : 21
    <22a>   DW_AT_type        : <0x324>
    <22e>   DW_AT_data_member_location: 4
 <2><22f>: Abbrev Number: 25 (DW_TAG_member)
    <230>   DW_AT_name        : pIO
    <234>   DW_AT_decl_file   : 1
    <235>   DW_AT_decl_line   : 151
    <236>   DW_AT_decl_column : 21
    <237>   DW_AT_type        : <0x2dd>
    <23b>   DW_AT_data_member_location: 8
 <2><23c>: Abbrev Number: 6 (DW_TAG_member)
    <23d>   DW_AT_name        : (indirect string, offset: 0x2bd2): pGPO
    <241>   DW_AT_decl_file   : 1
    <242>   DW_AT_decl_line   : 152
    <243>   DW_AT_decl_column : 21
    <244>   DW_AT_type        : <0x2dd>
    <248>   DW_AT_data_member_location: 12
 <2><249>: Abbrev Number: 6 (DW_TAG_member)
    <24a>   DW_AT_name        : (indirect string, offset: 0x399d): pPWM
    <24e>   DW_AT_decl_file   : 1
    <24f>   DW_AT_decl_line   : 153
    <250>   DW_AT_decl_column : 21
    <251>   DW_AT_type        : <0x2dd>
    <255>   DW_AT_data_member_location: 16
 <2><256>: Abbrev Number: 6 (DW_TAG_member)
    <257>   DW_AT_name        : (indirect string, offset: 0x75a): platform
    <25b>   DW_AT_decl_file   : 1
    <25c>   DW_AT_decl_line   : 154
    <25d>   DW_AT_decl_column : 21
    <25e>   DW_AT_type        : <0x50d>
    <262>   DW_AT_data_member_location: 20
 <2><263>: Abbrev Number: 0
 <1><264>: Abbrev Number: 30 (DW_TAG_structure_type)
    <265>   DW_AT_name        : (indirect string, offset: 0xccc): L6474x_Platform
    <269>   DW_AT_byte_size   : 28
    <26a>   DW_AT_decl_file   : 2
    <26b>   DW_AT_decl_line   : 267
    <26d>   DW_AT_decl_column : 16
    <26e>   DW_AT_sibling     : <0x2ce>
 <2><272>: Abbrev Number: 10 (DW_TAG_member)
    <273>   DW_AT_name        : (indirect string, offset: 0xf84): malloc
    <277>   DW_AT_decl_file   : 2
    <277>   DW_AT_decl_line   : 285
    <279>   DW_AT_decl_column : 10
    <27a>   DW_AT_type        : <0x2e6>
    <27e>   DW_AT_data_member_location: 0
 <2><27f>: Abbrev Number: 10 (DW_TAG_member)
    <280>   DW_AT_name        : (indirect string, offset: 0x1895): free
    <284>   DW_AT_decl_file   : 2
    <284>   DW_AT_decl_line   : 303
    <286>   DW_AT_decl_column : 10
    <287>   DW_AT_type        : <0x301>
    <28b>   DW_AT_data_member_location: 4
 <2><28c>: Abbrev Number: 10 (DW_TAG_member)
    <28d>   DW_AT_name        : (indirect string, offset: 0xbb0): transfer
    <291>   DW_AT_decl_file   : 2
    <291>   DW_AT_decl_line   : 321
    <293>   DW_AT_decl_column : 10
    <294>   DW_AT_type        : <0x346>
    <298>   DW_AT_data_member_location: 8
 <2><299>: Abbrev Number: 10 (DW_TAG_member)
    <29a>   DW_AT_name        : (indirect string, offset: 0x3024): reset
    <29e>   DW_AT_decl_file   : 2
    <29e>   DW_AT_decl_line   : 337
    <2a0>   DW_AT_decl_column : 10
    <2a1>   DW_AT_type        : <0x35b>
    <2a5>   DW_AT_data_member_location: 12
 <2><2a6>: Abbrev Number: 10 (DW_TAG_member)
    <2a7>   DW_AT_name        : (indirect string, offset: 0x36f5): sleep
    <2ab>   DW_AT_decl_file   : 2
    <2ab>   DW_AT_decl_line   : 352
    <2ad>   DW_AT_decl_column : 10
    <2ae>   DW_AT_type        : <0x36b>
    <2b2>   DW_AT_data_member_location: 16
 <2><2b3>: Abbrev Number: 10 (DW_TAG_member)
    <2b4>   DW_AT_name        : (indirect string, offset: 0x2098): stepAsync
    <2b8>   DW_AT_decl_file   : 2
    <2b8>   DW_AT_decl_line   : 407
    <2ba>   DW_AT_decl_column : 10
    <2bb>   DW_AT_type        : <0x3a3>
    <2bf>   DW_AT_data_member_location: 20
 <2><2c0>: Abbrev Number: 10 (DW_TAG_member)
    <2c1>   DW_AT_name        : (indirect string, offset: 0x293c): cancelStep
    <2c5>   DW_AT_decl_file   : 2
    <2c5>   DW_AT_decl_line   : 415
    <2c7>   DW_AT_decl_column : 10
    <2c8>   DW_AT_type        : <0x3b7>
    <2cc>   DW_AT_data_member_location: 24
 <2><2cd>: Abbrev Number: 0
 <1><2ce>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <2cf>   DW_AT_prototyped  : 1
    <2cf>   DW_AT_type        : <0x2dd>
    <2d3>   DW_AT_sibling     : <0x2dd>
 <2><2d7>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2d8>   DW_AT_type        : <0x2df>
 <2><2dc>: Abbrev Number: 0
 <1><2dd>: Abbrev Number: 31 (DW_TAG_pointer_type)
    <2de>   DW_AT_byte_size   : 4
 <1><2df>: Abbrev Number: 17 (DW_TAG_base_type)
    <2e0>   DW_AT_byte_size   : 4
    <2e1>   DW_AT_encoding    : 7	(unsigned)
    <2e2>   DW_AT_name        : (indirect string, offset: 0x2d14): unsigned int
 <1><2e6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <2e7>   DW_AT_byte_size   : 4
    <2e7>   DW_AT_type        : <0x2ce>
 <1><2eb>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <2ec>   DW_AT_prototyped  : 1
    <2ec>   DW_AT_sibling     : <0x2f6>
 <2><2f0>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <2f1>   DW_AT_type        : <0x2fb>
 <2><2f5>: Abbrev Number: 0
 <1><2f6>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <2f7>   DW_AT_byte_size   : 4
    <2f7>   DW_AT_type        : <0x300>
 <1><2fb>: Abbrev Number: 15 (DW_TAG_const_type)
    <2fc>   DW_AT_type        : <0x2f6>
 <1><300>: Abbrev Number: 32 (DW_TAG_const_type)
 <1><301>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <302>   DW_AT_byte_size   : 4
    <302>   DW_AT_type        : <0x2eb>
 <1><306>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <307>   DW_AT_prototyped  : 1
    <307>   DW_AT_type        : <0x324>
    <30b>   DW_AT_sibling     : <0x324>
 <2><30f>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <310>   DW_AT_type        : <0x2dd>
 <2><314>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <315>   DW_AT_type        : <0x330>
 <2><319>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <31a>   DW_AT_type        : <0x341>
 <2><31e>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <31f>   DW_AT_type        : <0x2df>
 <2><323>: Abbrev Number: 0
 <1><324>: Abbrev Number: 33 (DW_TAG_base_type)
    <325>   DW_AT_byte_size   : 4
    <326>   DW_AT_encoding    : 5	(signed)
    <327>   DW_AT_name        : int
 <1><32b>: Abbrev Number: 15 (DW_TAG_const_type)
    <32c>   DW_AT_type        : <0x324>
 <1><330>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <331>   DW_AT_byte_size   : 4
    <331>   DW_AT_type        : <0x335>
 <1><335>: Abbrev Number: 17 (DW_TAG_base_type)
    <336>   DW_AT_byte_size   : 1
    <337>   DW_AT_encoding    : 8	(unsigned char)
    <338>   DW_AT_name        : (indirect string, offset: 0xd2a02): char
 <1><33c>: Abbrev Number: 15 (DW_TAG_const_type)
    <33d>   DW_AT_type        : <0x335>
 <1><341>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <342>   DW_AT_byte_size   : 4
    <342>   DW_AT_type        : <0x33c>
 <1><346>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <347>   DW_AT_byte_size   : 4
    <347>   DW_AT_type        : <0x306>
 <1><34b>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <34c>   DW_AT_prototyped  : 1
    <34c>   DW_AT_sibling     : <0x35b>
 <2><350>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <351>   DW_AT_type        : <0x2dd>
 <2><355>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <356>   DW_AT_type        : <0x32b>
 <2><35a>: Abbrev Number: 0
 <1><35b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <35c>   DW_AT_byte_size   : 4
    <35c>   DW_AT_type        : <0x34b>
 <1><360>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <361>   DW_AT_prototyped  : 1
    <361>   DW_AT_sibling     : <0x36b>
 <2><365>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <366>   DW_AT_type        : <0x2df>
 <2><36a>: Abbrev Number: 0
 <1><36b>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <36c>   DW_AT_byte_size   : 4
    <36c>   DW_AT_type        : <0x360>
 <1><370>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <371>   DW_AT_prototyped  : 1
    <371>   DW_AT_type        : <0x324>
    <375>   DW_AT_sibling     : <0x393>
 <2><379>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <37a>   DW_AT_type        : <0x2dd>
 <2><37e>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <37f>   DW_AT_type        : <0x324>
 <2><383>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <384>   DW_AT_type        : <0x2df>
 <2><388>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <389>   DW_AT_type        : <0x393>
 <2><38d>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <38e>   DW_AT_type        : <0x1f7>
 <2><392>: Abbrev Number: 0
 <1><393>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <394>   DW_AT_byte_size   : 4
    <394>   DW_AT_type        : <0x398>
 <1><398>: Abbrev Number: 20 (DW_TAG_subroutine_type)
    <399>   DW_AT_prototyped  : 1
    <399>   DW_AT_sibling     : <0x3a3>
 <2><39d>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <39e>   DW_AT_type        : <0x1f7>
 <2><3a2>: Abbrev Number: 0
 <1><3a3>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3a4>   DW_AT_byte_size   : 4
    <3a4>   DW_AT_type        : <0x370>
 <1><3a8>: Abbrev Number: 19 (DW_TAG_subroutine_type)
    <3a9>   DW_AT_prototyped  : 1
    <3a9>   DW_AT_type        : <0x324>
    <3ad>   DW_AT_sibling     : <0x3b7>
 <2><3b1>: Abbrev Number: 8 (DW_TAG_formal_parameter)
    <3b2>   DW_AT_type        : <0x2dd>
 <2><3b6>: Abbrev Number: 0
 <1><3b7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <3b8>   DW_AT_byte_size   : 4
    <3b8>   DW_AT_type        : <0x3a8>
 <1><3bc>: Abbrev Number: 18 (DW_TAG_typedef)
    <3bd>   DW_AT_name        : (indirect string, offset: 0x377f): L6474x_Platform_t
    <3c1>   DW_AT_decl_file   : 2
    <3c1>   DW_AT_decl_line   : 442
    <3c3>   DW_AT_decl_column : 3
    <3c4>   DW_AT_type        : <0x264>
 <1><3c8>: Abbrev Number: 34 (DW_TAG_enumeration_type)
    <3c9>   DW_AT_encoding    : 7	(unsigned)
    <3ca>   DW_AT_byte_size   : 1
    <3cb>   DW_AT_type        : <0x53>
    <3cf>   DW_AT_decl_file   : 2
    <3d0>   DW_AT_decl_line   : 453
    <3d2>   DW_AT_decl_column : 1
    <3d3>   DW_AT_sibling     : <0x3fc>
 <2><3d7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3d8>   DW_AT_name        : (indirect string, offset: 0x38ed): L6474_PROP_TORQUE
    <3dc>   DW_AT_const_value : 9
 <2><3dd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3de>   DW_AT_name        : (indirect string, offset: 0x3bde): L6474_PROP_TON
    <3e2>   DW_AT_const_value : 15
 <2><3e3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3e4>   DW_AT_name        : (indirect string, offset: 0x124a): L6474_PROP_TOFF
    <3e8>   DW_AT_const_value : 16
 <2><3e9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3ea>   DW_AT_name        : (indirect string, offset: 0x3470): L6474_PROP_ADC_OUT
    <3ee>   DW_AT_const_value : 18
 <2><3ef>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3f0>   DW_AT_name        : (indirect string, offset: 0x36c): L6474_PROP_OCDTH
    <3f4>   DW_AT_const_value : 19
 <2><3f5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <3f6>   DW_AT_name        : (indirect string, offset: 0x324): L6474_PROP_TFAST
    <3fa>   DW_AT_const_value : 14
 <2><3fb>: Abbrev Number: 0
 <1><3fc>: Abbrev Number: 18 (DW_TAG_typedef)
    <3fd>   DW_AT_name        : (indirect string, offset: 0x3534): L6474_Property_t
    <401>   DW_AT_decl_file   : 2
    <401>   DW_AT_decl_line   : 483
    <403>   DW_AT_decl_column : 3
    <404>   DW_AT_type        : <0x3c8>
 <1><408>: Abbrev Number: 35 (DW_TAG_structure_type)
    <409>   DW_AT_byte_size   : 6
    <40a>   DW_AT_decl_file   : 2
    <40b>   DW_AT_decl_line   : 492
    <40d>   DW_AT_decl_column : 9
    <40e>   DW_AT_sibling     : <0x461>
 <2><412>: Abbrev Number: 10 (DW_TAG_member)
    <413>   DW_AT_name        : (indirect string, offset: 0x934): stepMode
    <417>   DW_AT_decl_file   : 2
    <417>   DW_AT_decl_line   : 498
    <419>   DW_AT_decl_column : 20
    <41a>   DW_AT_type        : <0x94>
    <41e>   DW_AT_data_member_location: 0
 <2><41f>: Abbrev Number: 10 (DW_TAG_member)
    <420>   DW_AT_name        : (indirect string, offset: 0x3483): OcdTh
    <424>   DW_AT_decl_file   : 2
    <424>   DW_AT_decl_line   : 503
    <426>   DW_AT_decl_column : 20
    <427>   DW_AT_type        : <0x1ec>
    <42b>   DW_AT_data_member_location: 1
 <2><42c>: Abbrev Number: 10 (DW_TAG_member)
    <42d>   DW_AT_name        : (indirect string, offset: 0x2e5a): TimeOnMin
    <431>   DW_AT_decl_file   : 2
    <431>   DW_AT_decl_line   : 508
    <433>   DW_AT_decl_column : 20
    <434>   DW_AT_type        : <0x335>
    <438>   DW_AT_data_member_location: 2
 <2><439>: Abbrev Number: 10 (DW_TAG_member)
    <43a>   DW_AT_name        : (indirect string, offset: 0x1ba4): TimeOffMin
    <43e>   DW_AT_decl_file   : 2
    <43e>   DW_AT_decl_line   : 513
    <440>   DW_AT_decl_column : 20
    <441>   DW_AT_type        : <0x335>
    <445>   DW_AT_data_member_location: 3
 <2><446>: Abbrev Number: 10 (DW_TAG_member)
    <447>   DW_AT_name        : (indirect string, offset: 0x21ca): TorqueVal
    <44b>   DW_AT_decl_file   : 2
    <44b>   DW_AT_decl_line   : 518
    <44d>   DW_AT_decl_column : 20
    <44e>   DW_AT_type        : <0x335>
    <452>   DW_AT_data_member_location: 4
 <2><453>: Abbrev Number: 10 (DW_TAG_member)
    <454>   DW_AT_name        : (indirect string, offset: 0xd72): TFast
    <458>   DW_AT_decl_file   : 2
    <458>   DW_AT_decl_line   : 523
    <45a>   DW_AT_decl_column : 20
    <45b>   DW_AT_type        : <0x335>
    <45f>   DW_AT_data_member_location: 5
 <2><460>: Abbrev Number: 0
 <1><461>: Abbrev Number: 18 (DW_TAG_typedef)
    <462>   DW_AT_name        : (indirect string, offset: 0x2306): L6474_BaseParameter_t
    <466>   DW_AT_decl_file   : 2
    <466>   DW_AT_decl_line   : 525
    <468>   DW_AT_decl_column : 3
    <469>   DW_AT_type        : <0x408>
 <1><46d>: Abbrev Number: 14 (DW_TAG_enumeration_type)
    <46e>   DW_AT_name        : (indirect string, offset: 0xcb9): L6474x_AccessFlags
    <472>   DW_AT_encoding    : 7	(unsigned)
    <473>   DW_AT_byte_size   : 1
    <473>   DW_AT_type        : <0x53>
    <477>   DW_AT_decl_file   : 1
    <478>   DW_AT_decl_line   : 124
    <479>   DW_AT_decl_column : 14
    <479>   DW_AT_sibling     : <0x496>
 <2><47d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <47e>   DW_AT_name        : (indirect string, offset: 0x3127): afNONE
    <482>   DW_AT_const_value : 0
 <2><483>: Abbrev Number: 1 (DW_TAG_enumerator)
    <484>   DW_AT_name        : (indirect string, offset: 0x2f17): afREAD
    <488>   DW_AT_const_value : 1
 <2><489>: Abbrev Number: 1 (DW_TAG_enumerator)
    <48a>   DW_AT_name        : (indirect string, offset: 0x363b): afWRITE
    <48e>   DW_AT_const_value : 2
 <2><48f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <490>   DW_AT_name        : (indirect string, offset: 0xbf4): afWRITE_HighZ
    <494>   DW_AT_const_value : 4
 <2><495>: Abbrev Number: 0
 <1><496>: Abbrev Number: 13 (DW_TAG_typedef)
    <497>   DW_AT_name        : (indirect string, offset: 0x30d5): L6474x_AccessFlags_t
    <49b>   DW_AT_decl_file   : 1
    <49c>   DW_AT_decl_line   : 131
    <49d>   DW_AT_decl_column : 3
    <49d>   DW_AT_type        : <0x46d>
 <1><4a1>: Abbrev Number: 24 (DW_TAG_structure_type)
    <4a2>   DW_AT_name        : (indirect string, offset: 0x3328): L6474x_ParameterDescriptor
    <4a6>   DW_AT_byte_size   : 16
    <4a7>   DW_AT_decl_file   : 1
    <4a8>   DW_AT_decl_line   : 134
    <4a9>   DW_AT_decl_column : 16
    <4aa>   DW_AT_sibling     : <0x4fd>
 <2><4ae>: Abbrev Number: 6 (DW_TAG_member)
    <4af>   DW_AT_name        : (indirect string, offset: 0x25f4): command
    <4b3>   DW_AT_decl_file   : 1
    <4b4>   DW_AT_decl_line   : 137
    <4b5>   DW_AT_decl_column : 23
    <4b6>   DW_AT_type        : <0x53>
    <4ba>   DW_AT_data_member_location: 0
 <2><4bb>: Abbrev Number: 6 (DW_TAG_member)
    <4bc>   DW_AT_name        : (indirect string, offset: 0x3196): defined
    <4c0>   DW_AT_decl_file   : 1
    <4c1>   DW_AT_decl_line   : 138
    <4c2>   DW_AT_decl_column : 23
    <4c3>   DW_AT_type        : <0x53>
    <4c7>   DW_AT_data_member_location: 1
 <2><4c8>: Abbrev Number: 6 (DW_TAG_member)
    <4c9>   DW_AT_name        : (indirect string, offset: 0x2d5b): length
    <4cd>   DW_AT_decl_file   : 1
    <4ce>   DW_AT_decl_line   : 139
    <4cf>   DW_AT_decl_column : 23
    <4d0>   DW_AT_type        : <0x53>
    <4d4>   DW_AT_data_member_location: 2
 <2><4d5>: Abbrev Number: 6 (DW_TAG_member)
    <4d6>   DW_AT_name        : (indirect string, offset: 0x2668): mask
    <4da>   DW_AT_decl_file   : 1
    <4db>   DW_AT_decl_line   : 140
    <4dc>   DW_AT_decl_column : 23
    <4dd>   DW_AT_type        : <0x2df>
    <4e1>   DW_AT_data_member_location: 4
 <2><4e2>: Abbrev Number: 6 (DW_TAG_member)
    <4e3>   DW_AT_name        : (indirect string, offset: 0xa382a): name
    <4e7>   DW_AT_decl_file   : 1
    <4e8>   DW_AT_decl_line   : 141
    <4e9>   DW_AT_decl_column : 23
    <4ea>   DW_AT_type        : <0x330>
    <4ee>   DW_AT_data_member_location: 8
 <2><4ef>: Abbrev Number: 6 (DW_TAG_member)
    <4f0>   DW_AT_name        : (indirect string, offset: 0xfb467): flags
    <4f4>   DW_AT_decl_file   : 1
    <4f5>   DW_AT_decl_line   : 142
    <4f6>   DW_AT_decl_column : 23
    <4f7>   DW_AT_type        : <0x496>
    <4fb>   DW_AT_data_member_location: 12
 <2><4fc>: Abbrev Number: 0
 <1><4fd>: Abbrev Number: 13 (DW_TAG_typedef)
    <4fe>   DW_AT_name        : (indirect string, offset: 0x3219): L6474x_ParameterDescriptor_t
    <502>   DW_AT_decl_file   : 1
    <503>   DW_AT_decl_line   : 143
    <504>   DW_AT_decl_column : 3
    <504>   DW_AT_type        : <0x4a1>
 <1><508>: Abbrev Number: 15 (DW_TAG_const_type)
    <509>   DW_AT_type        : <0x4fd>
 <1><50d>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <50e>   DW_AT_byte_size   : 4
    <50e>   DW_AT_type        : <0x3bc>
 <1><512>: Abbrev Number: 21 (DW_TAG_array_type)
    <513>   DW_AT_type        : <0x508>
    <517>   DW_AT_sibling     : <0x522>
 <2><51b>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <51c>   DW_AT_type        : <0x2df>
    <520>   DW_AT_upper_bound : 30
 <2><521>: Abbrev Number: 0
 <1><522>: Abbrev Number: 15 (DW_TAG_const_type)
    <523>   DW_AT_type        : <0x512>
 <1><527>: Abbrev Number: 12 (DW_TAG_variable)
    <528>   DW_AT_name        : (indirect string, offset: 0x18b4): L6474_Parameters
    <52c>   DW_AT_decl_file   : 1
    <52c>   DW_AT_decl_line   : 158
    <52d>   DW_AT_decl_column : 43
    <52e>   DW_AT_type        : <0x522>
    <532>   DW_AT_location    : 5 byte block: 3 cc d 1 8 	(DW_OP_addr: 8010dcc)
 <1><538>: Abbrev Number: 5 (DW_TAG_subprogram)
    <539>   DW_AT_external    : 1
    <539>   DW_AT_name        : (indirect string, offset: 0xc70): L6474_StepIncremental
    <53d>   DW_AT_decl_file   : 1
    <53d>   DW_AT_decl_line   : 1252
    <53f>   DW_AT_decl_column : 5
    <540>   DW_AT_prototyped  : 1
    <540>   DW_AT_type        : <0x324>
    <544>   DW_AT_low_pc      : 0x8001a70
    <548>   DW_AT_high_pc     : 0xc8
    <54c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <54e>   DW_AT_call_all_tail_calls: 1
    <54e>   DW_AT_sibling     : <0x57e>
 <2><552>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <553>   DW_AT_name        : h
    <555>   DW_AT_decl_file   : 1
    <555>   DW_AT_decl_line   : 1252
    <557>   DW_AT_decl_column : 42
    <558>   DW_AT_type        : <0x1f7>
    <55c>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><55f>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <560>   DW_AT_name        : (indirect string, offset: 0xe3b): steps
    <564>   DW_AT_decl_file   : 1
    <564>   DW_AT_decl_line   : 1252
    <566>   DW_AT_decl_column : 49
    <567>   DW_AT_type        : <0x324>
    <56b>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><56e>: Abbrev Number: 3 (DW_TAG_variable)
    <56f>   DW_AT_name        : ret
    <573>   DW_AT_decl_file   : 1
    <573>   DW_AT_decl_line   : 1279
    <575>   DW_AT_decl_column : 6
    <576>   DW_AT_type        : <0x324>
    <57a>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><57d>: Abbrev Number: 0
 <1><57e>: Abbrev Number: 5 (DW_TAG_subprogram)
    <57f>   DW_AT_external    : 1
    <57f>   DW_AT_name        : (indirect string, offset: 0x1594): L6474_StopMovement
    <583>   DW_AT_decl_file   : 1
    <583>   DW_AT_decl_line   : 1211
    <585>   DW_AT_decl_column : 5
    <586>   DW_AT_prototyped  : 1
    <586>   DW_AT_type        : <0x324>
    <58a>   DW_AT_low_pc      : 0
    <58e>   DW_AT_high_pc     : 0x86
    <592>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <594>   DW_AT_call_all_tail_calls: 1
    <594>   DW_AT_sibling     : <0x5a6>
 <2><598>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <599>   DW_AT_name        : h
    <59b>   DW_AT_decl_file   : 1
    <59b>   DW_AT_decl_line   : 1211
    <59d>   DW_AT_decl_column : 39
    <59e>   DW_AT_type        : <0x1f7>
    <5a2>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><5a5>: Abbrev Number: 0
 <1><5a6>: Abbrev Number: 26 (DW_TAG_subprogram)
    <5a7>   DW_AT_external    : 1
    <5a7>   DW_AT_name        : (indirect string, offset: 0x2917): L6474_GetState
    <5ab>   DW_AT_decl_file   : 1
    <5ab>   DW_AT_decl_line   : 1196
    <5ad>   DW_AT_decl_column : 5
    <5ad>   DW_AT_prototyped  : 1
    <5ad>   DW_AT_type        : <0x324>
    <5b1>   DW_AT_low_pc      : 0
    <5b5>   DW_AT_high_pc     : 0x38
    <5b9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <5bb>   DW_AT_call_all_calls: 1
    <5bb>   DW_AT_sibling     : <0x5dc>
 <2><5bf>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <5c0>   DW_AT_name        : h
    <5c2>   DW_AT_decl_file   : 1
    <5c2>   DW_AT_decl_line   : 1196
    <5c4>   DW_AT_decl_column : 35
    <5c5>   DW_AT_type        : <0x1f7>
    <5c9>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><5cc>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <5cd>   DW_AT_name        : (indirect string, offset: 0x1016d0): state
    <5d1>   DW_AT_decl_file   : 1
    <5d1>   DW_AT_decl_line   : 1196
    <5d3>   DW_AT_decl_column : 54
    <5d4>   DW_AT_type        : <0x5dc>
    <5d8>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><5db>: Abbrev Number: 0
 <1><5dc>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <5dd>   DW_AT_byte_size   : 4
    <5dd>   DW_AT_type        : <0x5a>
 <1><5e1>: Abbrev Number: 5 (DW_TAG_subprogram)
    <5e2>   DW_AT_external    : 1
    <5e2>   DW_AT_name        : (indirect string, offset: 0x194a): L6474_GetStatus
    <5e6>   DW_AT_decl_file   : 1
    <5e6>   DW_AT_decl_line   : 1152
    <5e8>   DW_AT_decl_column : 5
    <5e9>   DW_AT_prototyped  : 1
    <5e9>   DW_AT_type        : <0x324>
    <5ed>   DW_AT_low_pc      : 0
    <5f1>   DW_AT_high_pc     : 0x11a
    <5f5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <5f7>   DW_AT_call_all_tail_calls: 1
    <5f7>   DW_AT_sibling     : <0x627>
 <2><5fb>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <5fc>   DW_AT_name        : h
    <5fe>   DW_AT_decl_file   : 1
    <5fe>   DW_AT_decl_line   : 1152
    <600>   DW_AT_decl_column : 36
    <601>   DW_AT_type        : <0x1f7>
    <605>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><608>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <609>   DW_AT_name        : (indirect string, offset: 0x100b65): status
    <60d>   DW_AT_decl_file   : 1
    <60d>   DW_AT_decl_line   : 1152
    <60f>   DW_AT_decl_column : 55
    <610>   DW_AT_type        : <0x627>
    <614>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><617>: Abbrev Number: 3 (DW_TAG_variable)
    <618>   DW_AT_name        : val
    <61c>   DW_AT_decl_file   : 1
    <61c>   DW_AT_decl_line   : 1155
    <61e>   DW_AT_decl_column : 6
    <61f>   DW_AT_type        : <0x324>
    <623>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><626>: Abbrev Number: 0
 <1><627>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <628>   DW_AT_byte_size   : 4
    <628>   DW_AT_type        : <0x170>
 <1><62c>: Abbrev Number: 5 (DW_TAG_subprogram)
    <62d>   DW_AT_external    : 1
    <62d>   DW_AT_name        : (indirect string, offset: 0x3b3d): L6474_SetAlarmEnables
    <631>   DW_AT_decl_file   : 1
    <631>   DW_AT_decl_line   : 1120
    <633>   DW_AT_decl_column : 5
    <634>   DW_AT_prototyped  : 1
    <634>   DW_AT_type        : <0x324>
    <638>   DW_AT_low_pc      : 0
    <63c>   DW_AT_high_pc     : 0x72
    <640>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <642>   DW_AT_call_all_tail_calls: 1
    <642>   DW_AT_sibling     : <0x672>
 <2><646>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <647>   DW_AT_name        : h
    <649>   DW_AT_decl_file   : 1
    <649>   DW_AT_decl_line   : 1120
    <64b>   DW_AT_decl_column : 42
    <64c>   DW_AT_type        : <0x1f7>
    <650>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><653>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <654>   DW_AT_name        : (indirect string, offset: 0x102f59): bits
    <658>   DW_AT_decl_file   : 1
    <658>   DW_AT_decl_line   : 1120
    <65a>   DW_AT_decl_column : 49
    <65b>   DW_AT_type        : <0x324>
    <65f>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><662>: Abbrev Number: 3 (DW_TAG_variable)
    <663>   DW_AT_name        : val
    <667>   DW_AT_decl_file   : 1
    <667>   DW_AT_decl_line   : 1123
    <669>   DW_AT_decl_column : 6
    <66a>   DW_AT_type        : <0x324>
    <66e>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><671>: Abbrev Number: 0
 <1><672>: Abbrev Number: 5 (DW_TAG_subprogram)
    <673>   DW_AT_external    : 1
    <673>   DW_AT_name        : (indirect string, offset: 0xc86): L6474_GetProperty
    <677>   DW_AT_decl_file   : 1
    <677>   DW_AT_decl_line   : 1087
    <679>   DW_AT_decl_column : 5
    <67a>   DW_AT_prototyped  : 1
    <67a>   DW_AT_type        : <0x324>
    <67e>   DW_AT_low_pc      : 0
    <682>   DW_AT_high_pc     : 0x7c
    <686>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <688>   DW_AT_call_all_tail_calls: 1
    <688>   DW_AT_sibling     : <0x6c7>
 <2><68c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <68d>   DW_AT_name        : h
    <68f>   DW_AT_decl_file   : 1
    <68f>   DW_AT_decl_line   : 1087
    <691>   DW_AT_decl_column : 38
    <692>   DW_AT_type        : <0x1f7>
    <696>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><699>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <69a>   DW_AT_name        : (indirect string, offset: 0x3358): prop
    <69e>   DW_AT_decl_file   : 1
    <69e>   DW_AT_decl_line   : 1087
    <6a0>   DW_AT_decl_column : 58
    <6a1>   DW_AT_type        : <0x3fc>
    <6a5>   DW_AT_location    : 2 byte block: 91 6b 	(DW_OP_fbreg: -21)
 <2><6a8>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <6a9>   DW_AT_name        : (indirect string, offset: 0xfe493): value
    <6ad>   DW_AT_decl_file   : 1
    <6ad>   DW_AT_decl_line   : 1087
    <6af>   DW_AT_decl_column : 69
    <6b0>   DW_AT_type        : <0x6c7>
    <6b4>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><6b7>: Abbrev Number: 3 (DW_TAG_variable)
    <6b8>   DW_AT_name        : val
    <6bc>   DW_AT_decl_file   : 1
    <6bc>   DW_AT_decl_line   : 1090
    <6be>   DW_AT_decl_column : 6
    <6bf>   DW_AT_type        : <0x324>
    <6c3>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><6c6>: Abbrev Number: 0
 <1><6c7>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <6c8>   DW_AT_byte_size   : 4
    <6c8>   DW_AT_type        : <0x324>
 <1><6cc>: Abbrev Number: 5 (DW_TAG_subprogram)
    <6cd>   DW_AT_external    : 1
    <6cd>   DW_AT_name        : (indirect string, offset: 0x4f9): L6474_SetProperty
    <6d1>   DW_AT_decl_file   : 1
    <6d1>   DW_AT_decl_line   : 1055
    <6d3>   DW_AT_decl_column : 5
    <6d4>   DW_AT_prototyped  : 1
    <6d4>   DW_AT_type        : <0x324>
    <6d8>   DW_AT_low_pc      : 0
    <6dc>   DW_AT_high_pc     : 0x78
    <6e0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <6e2>   DW_AT_call_all_tail_calls: 1
    <6e2>   DW_AT_sibling     : <0x721>
 <2><6e6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <6e7>   DW_AT_name        : h
    <6e9>   DW_AT_decl_file   : 1
    <6e9>   DW_AT_decl_line   : 1055
    <6eb>   DW_AT_decl_column : 38
    <6ec>   DW_AT_type        : <0x1f7>
    <6f0>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><6f3>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <6f4>   DW_AT_name        : (indirect string, offset: 0x3358): prop
    <6f8>   DW_AT_decl_file   : 1
    <6f8>   DW_AT_decl_line   : 1055
    <6fa>   DW_AT_decl_column : 58
    <6fb>   DW_AT_type        : <0x3fc>
    <6ff>   DW_AT_location    : 2 byte block: 91 6b 	(DW_OP_fbreg: -21)
 <2><702>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <703>   DW_AT_name        : (indirect string, offset: 0xfe493): value
    <707>   DW_AT_decl_file   : 1
    <707>   DW_AT_decl_line   : 1055
    <709>   DW_AT_decl_column : 68
    <70a>   DW_AT_type        : <0x324>
    <70e>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><711>: Abbrev Number: 3 (DW_TAG_variable)
    <712>   DW_AT_name        : val
    <716>   DW_AT_decl_file   : 1
    <716>   DW_AT_decl_line   : 1058
    <718>   DW_AT_decl_column : 6
    <719>   DW_AT_type        : <0x324>
    <71d>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><720>: Abbrev Number: 0
 <1><721>: Abbrev Number: 5 (DW_TAG_subprogram)
    <722>   DW_AT_external    : 1
    <722>   DW_AT_name        : (indirect string, offset: 0x389): L6474_GetAlarmEnables
    <726>   DW_AT_decl_file   : 1
    <726>   DW_AT_decl_line   : 1022
    <728>   DW_AT_decl_column : 5
    <729>   DW_AT_prototyped  : 1
    <729>   DW_AT_type        : <0x324>
    <72d>   DW_AT_low_pc      : 0
    <731>   DW_AT_high_pc     : 0x7c
    <735>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <737>   DW_AT_call_all_tail_calls: 1
    <737>   DW_AT_sibling     : <0x767>
 <2><73b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <73c>   DW_AT_name        : h
    <73e>   DW_AT_decl_file   : 1
    <73e>   DW_AT_decl_line   : 1022
    <740>   DW_AT_decl_column : 42
    <741>   DW_AT_type        : <0x1f7>
    <745>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><748>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <749>   DW_AT_name        : (indirect string, offset: 0x102f59): bits
    <74d>   DW_AT_decl_file   : 1
    <74d>   DW_AT_decl_line   : 1022
    <74f>   DW_AT_decl_column : 50
    <750>   DW_AT_type        : <0x6c7>
    <754>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><757>: Abbrev Number: 3 (DW_TAG_variable)
    <758>   DW_AT_name        : val
    <75c>   DW_AT_decl_file   : 1
    <75c>   DW_AT_decl_line   : 1025
    <75e>   DW_AT_decl_column : 6
    <75f>   DW_AT_type        : <0x324>
    <763>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><766>: Abbrev Number: 0
 <1><767>: Abbrev Number: 5 (DW_TAG_subprogram)
    <768>   DW_AT_external    : 1
    <768>   DW_AT_name        : (indirect string, offset: 0x19cc): L6474_SetPositionMark
    <76c>   DW_AT_decl_file   : 1
    <76c>   DW_AT_decl_line   : 990
    <76e>   DW_AT_decl_column : 5
    <76f>   DW_AT_prototyped  : 1
    <76f>   DW_AT_type        : <0x324>
    <773>   DW_AT_low_pc      : 0
    <777>   DW_AT_high_pc     : 0x72
    <77b>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <77d>   DW_AT_call_all_tail_calls: 1
    <77d>   DW_AT_sibling     : <0x7ad>
 <2><781>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <782>   DW_AT_name        : h
    <784>   DW_AT_decl_file   : 1
    <784>   DW_AT_decl_line   : 990
    <786>   DW_AT_decl_column : 42
    <787>   DW_AT_type        : <0x1f7>
    <78b>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><78e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <78f>   DW_AT_name        : (indirect string, offset: 0x100bdd): position
    <793>   DW_AT_decl_file   : 1
    <793>   DW_AT_decl_line   : 990
    <795>   DW_AT_decl_column : 49
    <796>   DW_AT_type        : <0x324>
    <79a>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><79d>: Abbrev Number: 3 (DW_TAG_variable)
    <79e>   DW_AT_name        : val
    <7a2>   DW_AT_decl_file   : 1
    <7a2>   DW_AT_decl_line   : 993
    <7a4>   DW_AT_decl_column : 6
    <7a5>   DW_AT_type        : <0x324>
    <7a9>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><7ac>: Abbrev Number: 0
 <1><7ad>: Abbrev Number: 5 (DW_TAG_subprogram)
    <7ae>   DW_AT_external    : 1
    <7ae>   DW_AT_name        : (indirect string, offset: 0x49d): L6474_GetPositionMark
    <7b2>   DW_AT_decl_file   : 1
    <7b2>   DW_AT_decl_line   : 954
    <7b4>   DW_AT_decl_column : 5
    <7b5>   DW_AT_prototyped  : 1
    <7b5>   DW_AT_type        : <0x324>
    <7b9>   DW_AT_low_pc      : 0
    <7bd>   DW_AT_high_pc     : 0x92
    <7c1>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7c3>   DW_AT_call_all_tail_calls: 1
    <7c3>   DW_AT_sibling     : <0x7f3>
 <2><7c7>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <7c8>   DW_AT_name        : h
    <7ca>   DW_AT_decl_file   : 1
    <7ca>   DW_AT_decl_line   : 954
    <7cc>   DW_AT_decl_column : 42
    <7cd>   DW_AT_type        : <0x1f7>
    <7d1>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><7d4>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <7d5>   DW_AT_name        : (indirect string, offset: 0x100bdd): position
    <7d9>   DW_AT_decl_file   : 1
    <7d9>   DW_AT_decl_line   : 954
    <7db>   DW_AT_decl_column : 50
    <7dc>   DW_AT_type        : <0x6c7>
    <7e0>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><7e3>: Abbrev Number: 3 (DW_TAG_variable)
    <7e4>   DW_AT_name        : val
    <7e8>   DW_AT_decl_file   : 1
    <7e8>   DW_AT_decl_line   : 957
    <7ea>   DW_AT_decl_column : 6
    <7eb>   DW_AT_type        : <0x324>
    <7ef>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><7f2>: Abbrev Number: 0
 <1><7f3>: Abbrev Number: 5 (DW_TAG_subprogram)
    <7f4>   DW_AT_external    : 1
    <7f4>   DW_AT_name        : (indirect string, offset: 0x29b8): L6474_SetElectricalPosition
    <7f8>   DW_AT_decl_file   : 1
    <7f8>   DW_AT_decl_line   : 922
    <7fa>   DW_AT_decl_column : 5
    <7fb>   DW_AT_prototyped  : 1
    <7fb>   DW_AT_type        : <0x324>
    <7ff>   DW_AT_low_pc      : 0
    <803>   DW_AT_high_pc     : 0x72
    <807>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <809>   DW_AT_call_all_tail_calls: 1
    <809>   DW_AT_sibling     : <0x839>
 <2><80d>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <80e>   DW_AT_name        : h
    <810>   DW_AT_decl_file   : 1
    <810>   DW_AT_decl_line   : 922
    <812>   DW_AT_decl_column : 48
    <813>   DW_AT_type        : <0x1f7>
    <817>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><81a>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <81b>   DW_AT_name        : (indirect string, offset: 0x100bdd): position
    <81f>   DW_AT_decl_file   : 1
    <81f>   DW_AT_decl_line   : 922
    <821>   DW_AT_decl_column : 55
    <822>   DW_AT_type        : <0x324>
    <826>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><829>: Abbrev Number: 3 (DW_TAG_variable)
    <82a>   DW_AT_name        : val
    <82e>   DW_AT_decl_file   : 1
    <82e>   DW_AT_decl_line   : 925
    <830>   DW_AT_decl_column : 6
    <831>   DW_AT_type        : <0x324>
    <835>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><838>: Abbrev Number: 0
 <1><839>: Abbrev Number: 5 (DW_TAG_subprogram)
    <83a>   DW_AT_external    : 1
    <83a>   DW_AT_name        : (indirect string, offset: 0x23c5): L6474_GetElectricalPosition
    <83e>   DW_AT_decl_file   : 1
    <83e>   DW_AT_decl_line   : 889
    <840>   DW_AT_decl_column : 5
    <841>   DW_AT_prototyped  : 1
    <841>   DW_AT_type        : <0x324>
    <845>   DW_AT_low_pc      : 0
    <849>   DW_AT_high_pc     : 0x7c
    <84d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <84f>   DW_AT_call_all_tail_calls: 1
    <84f>   DW_AT_sibling     : <0x87f>
 <2><853>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <854>   DW_AT_name        : h
    <856>   DW_AT_decl_file   : 1
    <856>   DW_AT_decl_line   : 889
    <858>   DW_AT_decl_column : 48
    <859>   DW_AT_type        : <0x1f7>
    <85d>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><860>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <861>   DW_AT_name        : (indirect string, offset: 0x100bdd): position
    <865>   DW_AT_decl_file   : 1
    <865>   DW_AT_decl_line   : 889
    <867>   DW_AT_decl_column : 56
    <868>   DW_AT_type        : <0x6c7>
    <86c>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><86f>: Abbrev Number: 3 (DW_TAG_variable)
    <870>   DW_AT_name        : val
    <874>   DW_AT_decl_file   : 1
    <874>   DW_AT_decl_line   : 892
    <876>   DW_AT_decl_column : 6
    <877>   DW_AT_type        : <0x324>
    <87b>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><87e>: Abbrev Number: 0
 <1><87f>: Abbrev Number: 5 (DW_TAG_subprogram)
    <880>   DW_AT_external    : 1
    <880>   DW_AT_name        : (indirect string, offset: 0x2517): L6474_SetAbsolutePosition
    <884>   DW_AT_decl_file   : 1
    <884>   DW_AT_decl_line   : 857
    <886>   DW_AT_decl_column : 5
    <887>   DW_AT_prototyped  : 1
    <887>   DW_AT_type        : <0x324>
    <88b>   DW_AT_low_pc      : 0
    <88f>   DW_AT_high_pc     : 0x72
    <893>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <895>   DW_AT_call_all_tail_calls: 1
    <895>   DW_AT_sibling     : <0x8c5>
 <2><899>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <89a>   DW_AT_name        : h
    <89c>   DW_AT_decl_file   : 1
    <89c>   DW_AT_decl_line   : 857
    <89e>   DW_AT_decl_column : 46
    <89f>   DW_AT_type        : <0x1f7>
    <8a3>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><8a6>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <8a7>   DW_AT_name        : (indirect string, offset: 0x100bdd): position
    <8ab>   DW_AT_decl_file   : 1
    <8ab>   DW_AT_decl_line   : 857
    <8ad>   DW_AT_decl_column : 53
    <8ae>   DW_AT_type        : <0x324>
    <8b2>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><8b5>: Abbrev Number: 3 (DW_TAG_variable)
    <8b6>   DW_AT_name        : val
    <8ba>   DW_AT_decl_file   : 1
    <8ba>   DW_AT_decl_line   : 860
    <8bc>   DW_AT_decl_column : 6
    <8bd>   DW_AT_type        : <0x324>
    <8c1>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><8c4>: Abbrev Number: 0
 <1><8c5>: Abbrev Number: 5 (DW_TAG_subprogram)
    <8c6>   DW_AT_external    : 1
    <8c6>   DW_AT_name        : (indirect string, offset: 0x2b7d): L6474_GetAbsolutePosition
    <8ca>   DW_AT_decl_file   : 1
    <8ca>   DW_AT_decl_line   : 820
    <8cc>   DW_AT_decl_column : 5
    <8cd>   DW_AT_prototyped  : 1
    <8cd>   DW_AT_type        : <0x324>
    <8d1>   DW_AT_low_pc      : 0
    <8d5>   DW_AT_high_pc     : 0x92
    <8d9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <8db>   DW_AT_call_all_tail_calls: 1
    <8db>   DW_AT_sibling     : <0x90b>
 <2><8df>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <8e0>   DW_AT_name        : h
    <8e2>   DW_AT_decl_file   : 1
    <8e2>   DW_AT_decl_line   : 820
    <8e4>   DW_AT_decl_column : 46
    <8e5>   DW_AT_type        : <0x1f7>
    <8e9>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><8ec>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <8ed>   DW_AT_name        : (indirect string, offset: 0x100bdd): position
    <8f1>   DW_AT_decl_file   : 1
    <8f1>   DW_AT_decl_line   : 820
    <8f3>   DW_AT_decl_column : 54
    <8f4>   DW_AT_type        : <0x6c7>
    <8f8>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><8fb>: Abbrev Number: 3 (DW_TAG_variable)
    <8fc>   DW_AT_name        : val
    <900>   DW_AT_decl_file   : 1
    <900>   DW_AT_decl_line   : 823
    <902>   DW_AT_decl_column : 6
    <903>   DW_AT_type        : <0x324>
    <907>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><90a>: Abbrev Number: 0
 <1><90b>: Abbrev Number: 5 (DW_TAG_subprogram)
    <90c>   DW_AT_external    : 1
    <90c>   DW_AT_name        : (indirect string, offset: 0x20b1): L6474_SetPowerOutputs
    <910>   DW_AT_decl_file   : 1
    <910>   DW_AT_decl_line   : 788
    <912>   DW_AT_decl_column : 5
    <913>   DW_AT_prototyped  : 1
    <913>   DW_AT_type        : <0x324>
    <917>   DW_AT_low_pc      : 0x80019ee
    <91b>   DW_AT_high_pc     : 0x80
    <91f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <921>   DW_AT_call_all_tail_calls: 1
    <921>   DW_AT_sibling     : <0x951>
 <2><925>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <926>   DW_AT_name        : h
    <928>   DW_AT_decl_file   : 1
    <928>   DW_AT_decl_line   : 788
    <92a>   DW_AT_decl_column : 42
    <92b>   DW_AT_type        : <0x1f7>
    <92f>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><932>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <933>   DW_AT_name        : ena
    <937>   DW_AT_decl_file   : 1
    <937>   DW_AT_decl_line   : 788
    <939>   DW_AT_decl_column : 49
    <93a>   DW_AT_type        : <0x324>
    <93e>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><941>: Abbrev Number: 3 (DW_TAG_variable)
    <942>   DW_AT_name        : val
    <946>   DW_AT_decl_file   : 1
    <946>   DW_AT_decl_line   : 791
    <948>   DW_AT_decl_column : 6
    <949>   DW_AT_type        : <0x324>
    <94d>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><950>: Abbrev Number: 0
 <1><951>: Abbrev Number: 5 (DW_TAG_subprogram)
    <952>   DW_AT_external    : 1
    <952>   DW_AT_name        : (indirect string, offset: 0x125a): L6474_GetStepMode
    <956>   DW_AT_decl_file   : 1
    <956>   DW_AT_decl_line   : 751
    <958>   DW_AT_decl_column : 5
    <959>   DW_AT_prototyped  : 1
    <959>   DW_AT_type        : <0x324>
    <95d>   DW_AT_low_pc      : 0
    <961>   DW_AT_high_pc     : 0x8a
    <965>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <967>   DW_AT_call_all_tail_calls: 1
    <967>   DW_AT_sibling     : <0x997>
 <2><96b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <96c>   DW_AT_name        : h
    <96e>   DW_AT_decl_file   : 1
    <96e>   DW_AT_decl_line   : 751
    <970>   DW_AT_decl_column : 38
    <971>   DW_AT_type        : <0x1f7>
    <975>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><978>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <979>   DW_AT_name        : (indirect string, offset: 0x101061): mode
    <97d>   DW_AT_decl_file   : 1
    <97d>   DW_AT_decl_line   : 751
    <97f>   DW_AT_decl_column : 60
    <980>   DW_AT_type        : <0x997>
    <984>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><987>: Abbrev Number: 3 (DW_TAG_variable)
    <988>   DW_AT_name        : val
    <98c>   DW_AT_decl_file   : 1
    <98c>   DW_AT_decl_line   : 754
    <98e>   DW_AT_decl_column : 6
    <98f>   DW_AT_type        : <0x324>
    <993>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><996>: Abbrev Number: 0
 <1><997>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <998>   DW_AT_byte_size   : 4
    <998>   DW_AT_type        : <0x94>
 <1><99c>: Abbrev Number: 5 (DW_TAG_subprogram)
    <99d>   DW_AT_external    : 1
    <99d>   DW_AT_name        : (indirect string, offset: 0xa19): L6474_SetStepMode
    <9a1>   DW_AT_decl_file   : 1
    <9a1>   DW_AT_decl_line   : 713
    <9a3>   DW_AT_decl_column : 5
    <9a4>   DW_AT_prototyped  : 1
    <9a4>   DW_AT_type        : <0x324>
    <9a8>   DW_AT_low_pc      : 0x8001964
    <9ac>   DW_AT_high_pc     : 0x8a
    <9b0>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9b2>   DW_AT_call_all_tail_calls: 1
    <9b2>   DW_AT_sibling     : <0x9e2>
 <2><9b6>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9b7>   DW_AT_name        : h
    <9b9>   DW_AT_decl_file   : 1
    <9b9>   DW_AT_decl_line   : 713
    <9bb>   DW_AT_decl_column : 38
    <9bc>   DW_AT_type        : <0x1f7>
    <9c0>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><9c3>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <9c4>   DW_AT_name        : (indirect string, offset: 0x101061): mode
    <9c8>   DW_AT_decl_file   : 1
    <9c8>   DW_AT_decl_line   : 713
    <9ca>   DW_AT_decl_column : 59
    <9cb>   DW_AT_type        : <0x94>
    <9cf>   DW_AT_location    : 2 byte block: 91 6b 	(DW_OP_fbreg: -21)
 <2><9d2>: Abbrev Number: 3 (DW_TAG_variable)
    <9d3>   DW_AT_name        : val
    <9d7>   DW_AT_decl_file   : 1
    <9d7>   DW_AT_decl_line   : 716
    <9d9>   DW_AT_decl_column : 6
    <9da>   DW_AT_type        : <0x324>
    <9de>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><9e1>: Abbrev Number: 0
 <1><9e2>: Abbrev Number: 5 (DW_TAG_subprogram)
    <9e3>   DW_AT_external    : 1
    <9e3>   DW_AT_name        : (indirect string, offset: 0x2dfb): L6474_IsMoving
    <9e7>   DW_AT_decl_file   : 1
    <9e7>   DW_AT_decl_line   : 696
    <9e9>   DW_AT_decl_column : 5
    <9ea>   DW_AT_prototyped  : 1
    <9ea>   DW_AT_type        : <0x324>
    <9ee>   DW_AT_low_pc      : 0
    <9f2>   DW_AT_high_pc     : 0x46
    <9f6>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <9f8>   DW_AT_call_all_tail_calls: 1
    <9f8>   DW_AT_sibling     : <0xa19>
 <2><9fc>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <9fd>   DW_AT_name        : h
    <9ff>   DW_AT_decl_file   : 1
    <9ff>   DW_AT_decl_line   : 696
    <a01>   DW_AT_decl_column : 35
    <a02>   DW_AT_type        : <0x1f7>
    <a06>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><a09>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <a0a>   DW_AT_name        : (indirect string, offset: 0x36b9): moving
    <a0e>   DW_AT_decl_file   : 1
    <a0e>   DW_AT_decl_line   : 696
    <a10>   DW_AT_decl_column : 43
    <a11>   DW_AT_type        : <0x6c7>
    <a15>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><a18>: Abbrev Number: 0
 <1><a19>: Abbrev Number: 5 (DW_TAG_subprogram)
    <a1a>   DW_AT_external    : 1
    <a1a>   DW_AT_name        : (indirect string, offset: 0x130b): L6474_Initialize
    <a1e>   DW_AT_decl_file   : 1
    <a1e>   DW_AT_decl_line   : 570
    <a20>   DW_AT_decl_column : 5
    <a21>   DW_AT_prototyped  : 1
    <a21>   DW_AT_type        : <0x324>
    <a25>   DW_AT_low_pc      : 0x80016c2
    <a29>   DW_AT_high_pc     : 0x2a2
    <a2d>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a2f>   DW_AT_call_all_tail_calls: 1
    <a2f>   DW_AT_sibling     : <0xa6c>
 <2><a33>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a34>   DW_AT_name        : h
    <a36>   DW_AT_decl_file   : 1
    <a36>   DW_AT_decl_line   : 570
    <a38>   DW_AT_decl_column : 37
    <a39>   DW_AT_type        : <0x1f7>
    <a3d>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><a40>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a41>   DW_AT_name        : p
    <a43>   DW_AT_decl_file   : 1
    <a43>   DW_AT_decl_line   : 570
    <a45>   DW_AT_decl_column : 63
    <a46>   DW_AT_type        : <0xa6c>
    <a4a>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><a4d>: Abbrev Number: 3 (DW_TAG_variable)
    <a4e>   DW_AT_name        : val
    <a52>   DW_AT_decl_file   : 1
    <a52>   DW_AT_decl_line   : 573
    <a54>   DW_AT_decl_column : 6
    <a55>   DW_AT_type        : <0x324>
    <a59>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><a5c>: Abbrev Number: 9 (DW_TAG_variable)
    <a5d>   DW_AT_name        : (indirect string, offset: 0x2c40f): CONFIG
    <a61>   DW_AT_decl_file   : 1
    <a61>   DW_AT_decl_line   : 599
    <a63>   DW_AT_decl_column : 15
    <a64>   DW_AT_type        : <0x2df>
    <a68>   DW_AT_location    : 2 byte block: 91 70 	(DW_OP_fbreg: -16)
 <2><a6b>: Abbrev Number: 0
 <1><a6c>: Abbrev Number: 7 (DW_TAG_pointer_type)
    <a6d>   DW_AT_byte_size   : 4
    <a6d>   DW_AT_type        : <0x461>
 <1><a71>: Abbrev Number: 26 (DW_TAG_subprogram)
    <a72>   DW_AT_external    : 1
    <a72>   DW_AT_name        : (indirect string, offset: 0x2fc5): L6474_SetBaseParameter
    <a76>   DW_AT_decl_file   : 1
    <a76>   DW_AT_decl_line   : 553
    <a78>   DW_AT_decl_column : 5
    <a78>   DW_AT_prototyped  : 1
    <a78>   DW_AT_type        : <0x324>
    <a7c>   DW_AT_low_pc      : 0x800167c
    <a80>   DW_AT_high_pc     : 0x46
    <a84>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <a86>   DW_AT_call_all_calls: 1
    <a86>   DW_AT_sibling     : <0xa98>
 <2><a8a>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <a8b>   DW_AT_name        : p
    <a8d>   DW_AT_decl_file   : 1
    <a8d>   DW_AT_decl_line   : 553
    <a8f>   DW_AT_decl_column : 51
    <a90>   DW_AT_type        : <0xa6c>
    <a94>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><a97>: Abbrev Number: 0
 <1><a98>: Abbrev Number: 5 (DW_TAG_subprogram)
    <a99>   DW_AT_external    : 1
    <a99>   DW_AT_name        : (indirect string, offset: 0x3b12): L6474_ResetStandBy
    <a9d>   DW_AT_decl_file   : 1
    <a9d>   DW_AT_decl_line   : 511
    <a9f>   DW_AT_decl_column : 5
    <aa0>   DW_AT_prototyped  : 1
    <aa0>   DW_AT_type        : <0x324>
    <aa4>   DW_AT_low_pc      : 0x80015d6
    <aa8>   DW_AT_high_pc     : 0xa6
    <aac>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <aae>   DW_AT_call_all_tail_calls: 1
    <aae>   DW_AT_sibling     : <0xad9>
 <2><ab2>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <ab3>   DW_AT_name        : h
    <ab5>   DW_AT_decl_file   : 1
    <ab5>   DW_AT_decl_line   : 511
    <ab7>   DW_AT_decl_column : 39
    <ab8>   DW_AT_type        : <0x1f7>
    <abc>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><abf>: Abbrev Number: 36 (DW_TAG_lexical_block)
    <ac0>   DW_AT_low_pc      : 0x800160a
    <ac4>   DW_AT_high_pc     : 0x42
 <3><ac8>: Abbrev Number: 3 (DW_TAG_variable)
    <ac9>   DW_AT_name        : ret
    <acd>   DW_AT_decl_file   : 1
    <acd>   DW_AT_decl_line   : 534
    <acf>   DW_AT_decl_column : 7
    <ad0>   DW_AT_type        : <0x324>
    <ad4>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <3><ad7>: Abbrev Number: 0
 <2><ad8>: Abbrev Number: 0
 <1><ad9>: Abbrev Number: 5 (DW_TAG_subprogram)
    <ada>   DW_AT_external    : 1
    <ada>   DW_AT_name        : (indirect string, offset: 0x2c51): L6474_DestroyInstance
    <ade>   DW_AT_decl_file   : 1
    <ade>   DW_AT_decl_line   : 486
    <ae0>   DW_AT_decl_column : 5
    <ae1>   DW_AT_prototyped  : 1
    <ae1>   DW_AT_type        : <0x324>
    <ae5>   DW_AT_low_pc      : 0
    <ae9>   DW_AT_high_pc     : 0x4a
    <aed>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <aef>   DW_AT_call_all_tail_calls: 1
    <aef>   DW_AT_sibling     : <0xb01>
 <2><af3>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <af4>   DW_AT_name        : h
    <af6>   DW_AT_decl_file   : 1
    <af6>   DW_AT_decl_line   : 486
    <af8>   DW_AT_decl_column : 42
    <af9>   DW_AT_type        : <0x1f7>
    <afd>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><b00>: Abbrev Number: 0
 <1><b01>: Abbrev Number: 5 (DW_TAG_subprogram)
    <b02>   DW_AT_external    : 1
    <b02>   DW_AT_name        : (indirect string, offset: 0x3419): L6474_CreateInstance
    <b06>   DW_AT_decl_file   : 1
    <b06>   DW_AT_decl_line   : 440
    <b08>   DW_AT_decl_column : 16
    <b09>   DW_AT_prototyped  : 1
    <b09>   DW_AT_type        : <0x1f7>
    <b0d>   DW_AT_low_pc      : 0x800152c
    <b11>   DW_AT_high_pc     : 0xaa
    <b15>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b17>   DW_AT_call_all_tail_calls: 1
    <b17>   DW_AT_sibling     : <0xb63>
 <2><b1b>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b1c>   DW_AT_name        : p
    <b1e>   DW_AT_decl_file   : 1
    <b1e>   DW_AT_decl_line   : 440
    <b20>   DW_AT_decl_column : 56
    <b21>   DW_AT_type        : <0x50d>
    <b25>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><b28>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b29>   DW_AT_name        : pIO
    <b2d>   DW_AT_decl_file   : 1
    <b2d>   DW_AT_decl_line   : 440
    <b2f>   DW_AT_decl_column : 65
    <b30>   DW_AT_type        : <0x2dd>
    <b34>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><b37>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <b38>   DW_AT_name        : (indirect string, offset: 0x2bd2): pGPO
    <b3c>   DW_AT_decl_file   : 1
    <b3c>   DW_AT_decl_line   : 440
    <b3e>   DW_AT_decl_column : 76
    <b3f>   DW_AT_type        : <0x2dd>
    <b43>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><b46>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <b47>   DW_AT_name        : (indirect string, offset: 0x399d): pPWM
    <b4b>   DW_AT_decl_file   : 1
    <b4b>   DW_AT_decl_line   : 440
    <b4d>   DW_AT_decl_column : 88
    <b4e>   DW_AT_type        : <0x2dd>
    <b52>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><b55>: Abbrev Number: 3 (DW_TAG_variable)
    <b56>   DW_AT_name        : h
    <b58>   DW_AT_decl_file   : 1
    <b58>   DW_AT_decl_line   : 467
    <b5a>   DW_AT_decl_column : 17
    <b5b>   DW_AT_type        : <0x1f7>
    <b5f>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><b62>: Abbrev Number: 0
 <1><b63>: Abbrev Number: 23 (DW_TAG_subprogram)
    <b64>   DW_AT_name        : (indirect string, offset: 0x2c08): L6474_DisableCommand
    <b68>   DW_AT_decl_file   : 1
    <b68>   DW_AT_decl_line   : 407
    <b6a>   DW_AT_decl_column : 12
    <b6a>   DW_AT_prototyped  : 1
    <b6a>   DW_AT_type        : <0x324>
    <b6e>   DW_AT_low_pc      : 0x800149c
    <b72>   DW_AT_high_pc     : 0x90
    <b76>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <b78>   DW_AT_call_all_tail_calls: 1
    <b78>   DW_AT_sibling     : <0xbc6>
 <2><b7c>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <b7d>   DW_AT_name        : h
    <b7f>   DW_AT_decl_file   : 1
    <b7f>   DW_AT_decl_line   : 407
    <b81>   DW_AT_decl_column : 48
    <b82>   DW_AT_type        : <0x1f7>
    <b86>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><b89>: Abbrev Number: 9 (DW_TAG_variable)
    <b8a>   DW_AT_name        : (indirect string, offset: 0x2d5b): length
    <b8e>   DW_AT_decl_file   : 1
    <b8e>   DW_AT_decl_line   : 413
    <b90>   DW_AT_decl_column : 6
    <b91>   DW_AT_type        : <0x324>
    <b95>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><b98>: Abbrev Number: 9 (DW_TAG_variable)
    <b99>   DW_AT_name        : (indirect string, offset: 0x3ac7): rxBuff
    <b9d>   DW_AT_decl_file   : 1
    <b9d>   DW_AT_decl_line   : 415
    <b9f>   DW_AT_decl_column : 16
    <ba0>   DW_AT_type        : <0xbc6>
    <ba4>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><ba7>: Abbrev Number: 9 (DW_TAG_variable)
    <ba8>   DW_AT_name        : (indirect string, offset: 0x2a5b): txBuff
    <bac>   DW_AT_decl_file   : 1
    <bac>   DW_AT_decl_line   : 416
    <bae>   DW_AT_decl_column : 16
    <baf>   DW_AT_type        : <0xbc6>
    <bb3>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><bb6>: Abbrev Number: 3 (DW_TAG_variable)
    <bb7>   DW_AT_name        : ret
    <bbb>   DW_AT_decl_file   : 1
    <bbb>   DW_AT_decl_line   : 419
    <bbd>   DW_AT_decl_column : 6
    <bbe>   DW_AT_type        : <0x324>
    <bc2>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><bc5>: Abbrev Number: 0
 <1><bc6>: Abbrev Number: 21 (DW_TAG_array_type)
    <bc7>   DW_AT_type        : <0x53>
    <bcb>   DW_AT_sibling     : <0xbd6>
 <2><bcf>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <bd0>   DW_AT_type        : <0x2df>
    <bd4>   DW_AT_upper_bound : 0
 <2><bd5>: Abbrev Number: 0
 <1><bd6>: Abbrev Number: 23 (DW_TAG_subprogram)
    <bd7>   DW_AT_name        : (indirect string, offset: 0x2f2d): L6474_EnableCommand
    <bdb>   DW_AT_decl_file   : 1
    <bdb>   DW_AT_decl_line   : 376
    <bdd>   DW_AT_decl_column : 12
    <bdd>   DW_AT_prototyped  : 1
    <bdd>   DW_AT_type        : <0x324>
    <be1>   DW_AT_low_pc      : 0x8001414
    <be5>   DW_AT_high_pc     : 0x88
    <be9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <beb>   DW_AT_call_all_tail_calls: 1
    <beb>   DW_AT_sibling     : <0xc39>
 <2><bef>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <bf0>   DW_AT_name        : h
    <bf2>   DW_AT_decl_file   : 1
    <bf2>   DW_AT_decl_line   : 376
    <bf4>   DW_AT_decl_column : 47
    <bf5>   DW_AT_type        : <0x1f7>
    <bf9>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><bfc>: Abbrev Number: 9 (DW_TAG_variable)
    <bfd>   DW_AT_name        : (indirect string, offset: 0x2d5b): length
    <c01>   DW_AT_decl_file   : 1
    <c01>   DW_AT_decl_line   : 385
    <c03>   DW_AT_decl_column : 6
    <c04>   DW_AT_type        : <0x324>
    <c08>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><c0b>: Abbrev Number: 9 (DW_TAG_variable)
    <c0c>   DW_AT_name        : (indirect string, offset: 0x3ac7): rxBuff
    <c10>   DW_AT_decl_file   : 1
    <c10>   DW_AT_decl_line   : 387
    <c12>   DW_AT_decl_column : 16
    <c13>   DW_AT_type        : <0xbc6>
    <c17>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><c1a>: Abbrev Number: 9 (DW_TAG_variable)
    <c1b>   DW_AT_name        : (indirect string, offset: 0x2a5b): txBuff
    <c1f>   DW_AT_decl_file   : 1
    <c1f>   DW_AT_decl_line   : 388
    <c21>   DW_AT_decl_column : 16
    <c22>   DW_AT_type        : <0xbc6>
    <c26>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><c29>: Abbrev Number: 3 (DW_TAG_variable)
    <c2a>   DW_AT_name        : ret
    <c2e>   DW_AT_decl_file   : 1
    <c2e>   DW_AT_decl_line   : 391
    <c30>   DW_AT_decl_column : 6
    <c31>   DW_AT_type        : <0x324>
    <c35>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><c38>: Abbrev Number: 0
 <1><c39>: Abbrev Number: 23 (DW_TAG_subprogram)
    <c3a>   DW_AT_name        : (indirect string, offset: 0xa65): L6474_SetParamCommand
    <c3e>   DW_AT_decl_file   : 1
    <c3e>   DW_AT_decl_line   : 316
    <c40>   DW_AT_decl_column : 12
    <c40>   DW_AT_prototyped  : 1
    <c40>   DW_AT_type        : <0x324>
    <c44>   DW_AT_low_pc      : 0x8001294
    <c48>   DW_AT_high_pc     : 0x180
    <c4c>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <c4e>   DW_AT_call_all_tail_calls: 1
    <c4e>   DW_AT_sibling     : <0xcd8>
 <2><c52>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <c53>   DW_AT_name        : h
    <c55>   DW_AT_decl_file   : 1
    <c55>   DW_AT_decl_line   : 316
    <c57>   DW_AT_decl_column : 49
    <c58>   DW_AT_type        : <0x1f7>
    <c5c>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><c5f>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c60>   DW_AT_name        : (indirect string, offset: 0x36f0): addr
    <c64>   DW_AT_decl_file   : 1
    <c64>   DW_AT_decl_line   : 316
    <c66>   DW_AT_decl_column : 56
    <c67>   DW_AT_type        : <0x324>
    <c6b>   DW_AT_location    : 2 byte block: 91 50 	(DW_OP_fbreg: -48)
 <2><c6e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <c6f>   DW_AT_name        : (indirect string, offset: 0xfe493): value
    <c73>   DW_AT_decl_file   : 1
    <c73>   DW_AT_decl_line   : 316
    <c75>   DW_AT_decl_column : 66
    <c76>   DW_AT_type        : <0x324>
    <c7a>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><c7d>: Abbrev Number: 9 (DW_TAG_variable)
    <c7e>   DW_AT_name        : (indirect string, offset: 0x2d5b): length
    <c82>   DW_AT_decl_file   : 1
    <c82>   DW_AT_decl_line   : 329
    <c84>   DW_AT_decl_column : 6
    <c85>   DW_AT_type        : <0x324>
    <c89>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><c8c>: Abbrev Number: 9 (DW_TAG_variable)
    <c8d>   DW_AT_name        : (indirect string, offset: 0x3ac7): rxBuff
    <c91>   DW_AT_decl_file   : 1
    <c91>   DW_AT_decl_line   : 333
    <c93>   DW_AT_decl_column : 16
    <c94>   DW_AT_type        : <0xcd8>
    <c98>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><c9b>: Abbrev Number: 9 (DW_TAG_variable)
    <c9c>   DW_AT_name        : (indirect string, offset: 0x2a5b): txBuff
    <ca0>   DW_AT_decl_file   : 1
    <ca0>   DW_AT_decl_line   : 334
    <ca2>   DW_AT_decl_column : 16
    <ca3>   DW_AT_type        : <0xcd8>
    <ca7>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><caa>: Abbrev Number: 3 (DW_TAG_variable)
    <cab>   DW_AT_name        : tmp
    <caf>   DW_AT_decl_file   : 1
    <caf>   DW_AT_decl_line   : 335
    <cb1>   DW_AT_decl_column : 16
    <cb2>   DW_AT_type        : <0x2df>
    <cb6>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><cb9>: Abbrev Number: 3 (DW_TAG_variable)
    <cba>   DW_AT_name        : ret
    <cbe>   DW_AT_decl_file   : 1
    <cbe>   DW_AT_decl_line   : 360
    <cc0>   DW_AT_decl_column : 6
    <cc1>   DW_AT_type        : <0x324>
    <cc5>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><cc8>: Abbrev Number: 3 (DW_TAG_variable)
    <cc9>   DW_AT_name        : res
    <ccd>   DW_AT_decl_file   : 1
    <ccd>   DW_AT_decl_line   : 365
    <ccf>   DW_AT_decl_column : 6
    <cd0>   DW_AT_type        : <0x324>
    <cd4>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><cd7>: Abbrev Number: 0
 <1><cd8>: Abbrev Number: 21 (DW_TAG_array_type)
    <cd9>   DW_AT_type        : <0x53>
    <cdd>   DW_AT_sibling     : <0xce8>
 <2><ce1>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <ce2>   DW_AT_type        : <0x2df>
    <ce6>   DW_AT_upper_bound : 3
 <2><ce7>: Abbrev Number: 0
 <1><ce8>: Abbrev Number: 23 (DW_TAG_subprogram)
    <ce9>   DW_AT_name        : (indirect string, offset: 0x3545): L6474_GetParamCommand
    <ced>   DW_AT_decl_file   : 1
    <ced>   DW_AT_decl_line   : 257
    <cef>   DW_AT_decl_column : 12
    <cef>   DW_AT_prototyped  : 1
    <cef>   DW_AT_type        : <0x324>
    <cf3>   DW_AT_low_pc      : 0x8001134
    <cf7>   DW_AT_high_pc     : 0x160
    <cfb>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <cfd>   DW_AT_call_all_tail_calls: 1
    <cfd>   DW_AT_sibling     : <0xd87>
 <2><d01>: Abbrev Number: 2 (DW_TAG_formal_parameter)
    <d02>   DW_AT_name        : h
    <d04>   DW_AT_decl_file   : 1
    <d04>   DW_AT_decl_line   : 257
    <d06>   DW_AT_decl_column : 49
    <d07>   DW_AT_type        : <0x1f7>
    <d0b>   DW_AT_location    : 2 byte block: 91 4c 	(DW_OP_fbreg: -52)
 <2><d0e>: Abbrev Number: 4 (DW_TAG_formal_parameter)
    <d0f>   DW_AT_name        : (indirect string, offset: 0x36f0): addr
    <d13>   DW_AT_decl_file   : 1
    <d13>   DW_AT_decl_line   : 257
    <d15>   DW_AT_decl_column : 56
    <d16>   DW_AT_type        : <0x324>
    <d1a>   DW_AT_location    : 2 byte block: 91 48 	(DW_OP_fbreg: -56)
 <2><d1d>: Abbrev Number: 9 (DW_TAG_variable)
    <d1e>   DW_AT_name        : (indirect string, offset: 0x2d5b): length
    <d22>   DW_AT_decl_file   : 1
    <d22>   DW_AT_decl_line   : 270
    <d24>   DW_AT_decl_column : 6
    <d25>   DW_AT_type        : <0x324>
    <d29>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><d2c>: Abbrev Number: 9 (DW_TAG_variable)
    <d2d>   DW_AT_name        : (indirect string, offset: 0x3ac7): rxBuff
    <d31>   DW_AT_decl_file   : 1
    <d31>   DW_AT_decl_line   : 274
    <d33>   DW_AT_decl_column : 16
    <d34>   DW_AT_type        : <0xcd8>
    <d38>   DW_AT_location    : 2 byte block: 91 58 	(DW_OP_fbreg: -40)
 <2><d3b>: Abbrev Number: 9 (DW_TAG_variable)
    <d3c>   DW_AT_name        : (indirect string, offset: 0x2a5b): txBuff
    <d40>   DW_AT_decl_file   : 1
    <d40>   DW_AT_decl_line   : 275
    <d42>   DW_AT_decl_column : 16
    <d43>   DW_AT_type        : <0xcd8>
    <d47>   DW_AT_location    : 2 byte block: 91 54 	(DW_OP_fbreg: -44)
 <2><d4a>: Abbrev Number: 3 (DW_TAG_variable)
    <d4b>   DW_AT_name        : ret
    <d4f>   DW_AT_decl_file   : 1
    <d4f>   DW_AT_decl_line   : 278
    <d51>   DW_AT_decl_column : 6
    <d52>   DW_AT_type        : <0x324>
    <d56>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><d59>: Abbrev Number: 3 (DW_TAG_variable)
    <d5a>   DW_AT_name        : res
    <d5e>   DW_AT_decl_file   : 1
    <d5e>   DW_AT_decl_line   : 283
    <d60>   DW_AT_decl_column : 6
    <d61>   DW_AT_type        : <0x324>
    <d65>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><d68>: Abbrev Number: 3 (DW_TAG_variable)
    <d69>   DW_AT_name        : tmp
    <d6d>   DW_AT_decl_file   : 1
    <d6d>   DW_AT_decl_line   : 284
    <d6f>   DW_AT_decl_column : 15
    <d70>   DW_AT_type        : <0x2df>
    <d74>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><d77>: Abbrev Number: 9 (DW_TAG_variable)
    <d78>   DW_AT_name        : (indirect string, offset: 0x358b): opres
    <d7c>   DW_AT_decl_file   : 1
    <d7c>   DW_AT_decl_line   : 305
    <d7e>   DW_AT_decl_column : 6
    <d7f>   DW_AT_type        : <0x324>
    <d83>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><d86>: Abbrev Number: 0
 <1><d87>: Abbrev Number: 27 (DW_TAG_subprogram)
    <d88>   DW_AT_name        : (indirect string, offset: 0x3c0): L6474_NopCommand
    <d8c>   DW_AT_decl_file   : 1
    <d8c>   DW_AT_decl_line   : 236
    <d8d>   DW_AT_decl_column : 12
    <d8d>   DW_AT_prototyped  : 1
    <d8d>   DW_AT_type        : <0x324>
    <d91>   DW_AT_low_pc      : 0
    <d95>   DW_AT_high_pc     : 0x54
    <d99>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <d9b>   DW_AT_call_all_tail_calls: 1
    <d9b>   DW_AT_sibling     : <0xde3>
 <2><d9f>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <da0>   DW_AT_name        : h
    <da2>   DW_AT_decl_file   : 1
    <da2>   DW_AT_decl_line   : 236
    <da3>   DW_AT_decl_column : 44
    <da4>   DW_AT_type        : <0x1f7>
    <da8>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><dab>: Abbrev Number: 12 (DW_TAG_variable)
    <dac>   DW_AT_name        : (indirect string, offset: 0x2d5b): length
    <db0>   DW_AT_decl_file   : 1
    <db0>   DW_AT_decl_line   : 242
    <db1>   DW_AT_decl_column : 6
    <db2>   DW_AT_type        : <0x324>
    <db6>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><db9>: Abbrev Number: 12 (DW_TAG_variable)
    <dba>   DW_AT_name        : (indirect string, offset: 0x3ac7): rxBuff
    <dbe>   DW_AT_decl_file   : 1
    <dbe>   DW_AT_decl_line   : 244
    <dbf>   DW_AT_decl_column : 16
    <dc0>   DW_AT_type        : <0xbc6>
    <dc4>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><dc7>: Abbrev Number: 12 (DW_TAG_variable)
    <dc8>   DW_AT_name        : (indirect string, offset: 0x2a5b): txBuff
    <dcc>   DW_AT_decl_file   : 1
    <dcc>   DW_AT_decl_line   : 245
    <dcd>   DW_AT_decl_column : 16
    <dce>   DW_AT_type        : <0xbc6>
    <dd2>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><dd5>: Abbrev Number: 28 (DW_TAG_variable)
    <dd6>   DW_AT_name        : ret
    <dda>   DW_AT_decl_file   : 1
    <dda>   DW_AT_decl_line   : 248
    <ddb>   DW_AT_decl_column : 6
    <ddb>   DW_AT_type        : <0x324>
    <ddf>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><de2>: Abbrev Number: 0
 <1><de3>: Abbrev Number: 27 (DW_TAG_subprogram)
    <de4>   DW_AT_name        : (indirect string, offset: 0x3b8a): L6474_GetStatusCommand
    <de8>   DW_AT_decl_file   : 1
    <de8>   DW_AT_decl_line   : 212
    <de9>   DW_AT_decl_column : 12
    <de9>   DW_AT_prototyped  : 1
    <de9>   DW_AT_type        : <0x324>
    <ded>   DW_AT_low_pc      : 0x80010ac
    <df1>   DW_AT_high_pc     : 0x88
    <df5>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <df7>   DW_AT_call_all_tail_calls: 1
    <df7>   DW_AT_sibling     : <0xe3f>
 <2><dfb>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <dfc>   DW_AT_name        : h
    <dfe>   DW_AT_decl_file   : 1
    <dfe>   DW_AT_decl_line   : 212
    <dff>   DW_AT_decl_column : 50
    <e00>   DW_AT_type        : <0x1f7>
    <e04>   DW_AT_location    : 2 byte block: 91 5c 	(DW_OP_fbreg: -36)
 <2><e07>: Abbrev Number: 12 (DW_TAG_variable)
    <e08>   DW_AT_name        : (indirect string, offset: 0x2d5b): length
    <e0c>   DW_AT_decl_file   : 1
    <e0c>   DW_AT_decl_line   : 218
    <e0d>   DW_AT_decl_column : 6
    <e0e>   DW_AT_type        : <0x324>
    <e12>   DW_AT_location    : 2 byte block: 91 6c 	(DW_OP_fbreg: -20)
 <2><e15>: Abbrev Number: 12 (DW_TAG_variable)
    <e16>   DW_AT_name        : (indirect string, offset: 0x3ac7): rxBuff
    <e1a>   DW_AT_decl_file   : 1
    <e1a>   DW_AT_decl_line   : 220
    <e1b>   DW_AT_decl_column : 16
    <e1c>   DW_AT_type        : <0xe3f>
    <e20>   DW_AT_location    : 2 byte block: 91 64 	(DW_OP_fbreg: -28)
 <2><e23>: Abbrev Number: 12 (DW_TAG_variable)
    <e24>   DW_AT_name        : (indirect string, offset: 0x2a5b): txBuff
    <e28>   DW_AT_decl_file   : 1
    <e28>   DW_AT_decl_line   : 221
    <e29>   DW_AT_decl_column : 16
    <e2a>   DW_AT_type        : <0xe3f>
    <e2e>   DW_AT_location    : 2 byte block: 91 60 	(DW_OP_fbreg: -32)
 <2><e31>: Abbrev Number: 28 (DW_TAG_variable)
    <e32>   DW_AT_name        : ret
    <e36>   DW_AT_decl_file   : 1
    <e36>   DW_AT_decl_line   : 224
    <e37>   DW_AT_decl_column : 6
    <e37>   DW_AT_type        : <0x324>
    <e3b>   DW_AT_location    : 2 byte block: 91 68 	(DW_OP_fbreg: -24)
 <2><e3e>: Abbrev Number: 0
 <1><e3f>: Abbrev Number: 21 (DW_TAG_array_type)
    <e40>   DW_AT_type        : <0x53>
    <e44>   DW_AT_sibling     : <0xe4f>
 <2><e48>: Abbrev Number: 22 (DW_TAG_subrange_type)
    <e49>   DW_AT_type        : <0x2df>
    <e4d>   DW_AT_upper_bound : 2
 <2><e4e>: Abbrev Number: 0
 <1><e4f>: Abbrev Number: 37 (DW_TAG_subprogram)
    <e50>   DW_AT_name        : (indirect string, offset: 0x3372): L6474_HelperReleaseStep
    <e54>   DW_AT_decl_file   : 1
    <e55>   DW_AT_decl_line   : 203
    <e56>   DW_AT_decl_column : 13
    <e57>   DW_AT_prototyped  : 1
    <e57>   DW_AT_low_pc      : 0x800108a
    <e5b>   DW_AT_high_pc     : 0x22
    <e5f>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e61>   DW_AT_call_all_tail_calls: 1
    <e61>   DW_AT_sibling     : <0xe72>
 <2><e65>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <e66>   DW_AT_name        : h
    <e68>   DW_AT_decl_file   : 1
    <e68>   DW_AT_decl_line   : 203
    <e69>   DW_AT_decl_column : 52
    <e6a>   DW_AT_type        : <0x1f7>
    <e6e>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><e71>: Abbrev Number: 0
 <1><e72>: Abbrev Number: 38 (DW_TAG_subprogram)
    <e73>   DW_AT_name        : (indirect string, offset: 0x13): L6474_HelperUnlock
    <e77>   DW_AT_decl_file   : 1
    <e78>   DW_AT_decl_line   : 190
    <e79>   DW_AT_decl_column : 20
    <e7a>   DW_AT_prototyped  : 1
    <e7a>   DW_AT_low_pc      : 0x8001076
    <e7e>   DW_AT_high_pc     : 0x14
    <e82>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <e84>   DW_AT_call_all_calls: 1
    <e84>   DW_AT_sibling     : <0xe95>
 <2><e88>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <e89>   DW_AT_name        : h
    <e8b>   DW_AT_decl_file   : 1
    <e8b>   DW_AT_decl_line   : 190
    <e8c>   DW_AT_decl_column : 54
    <e8d>   DW_AT_type        : <0x1f7>
    <e91>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><e94>: Abbrev Number: 0
 <1><e95>: Abbrev Number: 39 (DW_TAG_subprogram)
    <e96>   DW_AT_name        : (indirect string, offset: 0x1926): L6474_HelperLock
    <e9a>   DW_AT_decl_file   : 1
    <e9b>   DW_AT_decl_line   : 178
    <e9c>   DW_AT_decl_column : 19
    <e9d>   DW_AT_prototyped  : 1
    <e9d>   DW_AT_type        : <0x324>
    <ea1>   DW_AT_low_pc      : 0x8001060
    <ea5>   DW_AT_high_pc     : 0x16
    <ea9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <eab>   DW_AT_call_all_calls: 1
 <2><eab>: Abbrev Number: 16 (DW_TAG_formal_parameter)
    <eac>   DW_AT_name        : h
    <eae>   DW_AT_decl_file   : 1
    <eae>   DW_AT_decl_line   : 178
    <eaf>   DW_AT_decl_column : 51
    <eb0>   DW_AT_type        : <0x1f7>
    <eb4>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><eb7>: Abbrev Number: 0
 <1><eb8>: Abbrev Number: 0
  Compilation Unit @ offset 0xeb9:
   Length:        0x1f7a (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x281
   Pointer Size:  4
 <0><ec5>: Abbrev Number: 47 (DW_TAG_compile_unit)
    <ec6>   DW_AT_producer    : (indirect string, offset: 0x2452): GNU C17 13.3.1 20240614 -mcpu=cortex-m7 -mfpu=fpv5-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fpv5 -g3 -O0 -std=gnu17 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <eca>   DW_AT_language    : 29	(C11)
    <ecb>   DW_AT_name        : (indirect string, offset: 0xdfafb): ../Core/Src/main.c
    <ecf>   DW_AT_comp_dir    : (indirect string, offset: 0x11a): C:/Users/hans-/Nextcloud/Documents/DHBW/Labor/Labor_HWNahesProg_Echtzeitsysteme/Semester4/Solution/stepper/Debug
    <ed3>   DW_AT_ranges      : 0xe9
    <ed7>   DW_AT_low_pc      : 0
    <edb>   DW_AT_stmt_list   : 0xdfe
    <edf>   DW_AT_macros      : 0x21a
 <1><ee3>: Abbrev Number: 14 (DW_TAG_base_type)
    <ee4>   DW_AT_byte_size   : 1
    <ee5>   DW_AT_encoding    : 6	(signed char)
    <ee6>   DW_AT_name        : (indirect string, offset: 0x2e4e): signed char
 <1><eea>: Abbrev Number: 6 (DW_TAG_typedef)
    <eeb>   DW_AT_name        : (indirect string, offset: 0x4b39b): __uint8_t
    <eef>   DW_AT_decl_file   : 4
    <ef0>   DW_AT_decl_line   : 43
    <ef1>   DW_AT_decl_column : 24
    <ef2>   DW_AT_type        : <0xef6>
 <1><ef6>: Abbrev Number: 14 (DW_TAG_base_type)
    <ef7>   DW_AT_byte_size   : 1
    <ef8>   DW_AT_encoding    : 8	(unsigned char)
    <ef9>   DW_AT_name        : (indirect string, offset: 0x3069): unsigned char
 <1><efd>: Abbrev Number: 14 (DW_TAG_base_type)
    <efe>   DW_AT_byte_size   : 2
    <eff>   DW_AT_encoding    : 5	(signed)
    <f00>   DW_AT_name        : (indirect string, offset: 0x836): short int
 <1><f04>: Abbrev Number: 6 (DW_TAG_typedef)
    <f05>   DW_AT_name        : (indirect string, offset: 0xcdaca): __uint16_t
    <f09>   DW_AT_decl_file   : 4
    <f0a>   DW_AT_decl_line   : 57
    <f0b>   DW_AT_decl_column : 25
    <f0c>   DW_AT_type        : <0xf10>
 <1><f10>: Abbrev Number: 14 (DW_TAG_base_type)
    <f11>   DW_AT_byte_size   : 2
    <f12>   DW_AT_encoding    : 7	(unsigned)
    <f13>   DW_AT_name        : (indirect string, offset: 0x62f): short unsigned int
 <1><f17>: Abbrev Number: 14 (DW_TAG_base_type)
    <f18>   DW_AT_byte_size   : 4
    <f19>   DW_AT_encoding    : 5	(signed)
    <f1a>   DW_AT_name        : (indirect string, offset: 0x2cb4): long int
 <1><f1e>: Abbrev Number: 6 (DW_TAG_typedef)
    <f1f>   DW_AT_name        : (indirect string, offset: 0xa14d0): __uint32_t
    <f23>   DW_AT_decl_file   : 4
    <f24>   DW_AT_decl_line   : 79
    <f25>   DW_AT_decl_column : 25
    <f26>   DW_AT_type        : <0xf2a>
 <1><f2a>: Abbrev Number: 14 (DW_TAG_base_type)
    <f2b>   DW_AT_byte_size   : 4
    <f2c>   DW_AT_encoding    : 7	(unsigned)
    <f2d>   DW_AT_name        : (indirect string, offset: 0x28d5): long unsigned int
 <1><f31>: Abbrev Number: 14 (DW_TAG_base_type)
    <f32>   DW_AT_byte_size   : 8
    <f33>   DW_AT_encoding    : 5	(signed)
    <f34>   DW_AT_name        : (indirect string, offset: 0x2631): long long int
 <1><f38>: Abbrev Number: 6 (DW_TAG_typedef)
    <f39>   DW_AT_name        : (indirect string, offset: 0x74ec4): __uint64_t
    <f3d>   DW_AT_decl_file   : 4
    <f3e>   DW_AT_decl_line   : 105
    <f3f>   DW_AT_decl_column : 25
    <f40>   DW_AT_type        : <0xf44>
 <1><f44>: Abbrev Number: 14 (DW_TAG_base_type)
    <f45>   DW_AT_byte_size   : 8
    <f46>   DW_AT_encoding    : 7	(unsigned)
    <f47>   DW_AT_name        : (indirect string, offset: 0x1b5f): long long unsigned int
 <1><f4b>: Abbrev Number: 48 (DW_TAG_base_type)
    <f4c>   DW_AT_byte_size   : 4
    <f4d>   DW_AT_encoding    : 5	(signed)
    <f4e>   DW_AT_name        : int
 <1><f52>: Abbrev Number: 11 (DW_TAG_const_type)
    <f53>   DW_AT_type        : <0xf4b>
 <1><f57>: Abbrev Number: 14 (DW_TAG_base_type)
    <f58>   DW_AT_byte_size   : 4
    <f59>   DW_AT_encoding    : 7	(unsigned)
    <f5a>   DW_AT_name        : (indirect string, offset: 0x2d14): unsigned int
 <1><f5e>: Abbrev Number: 6 (DW_TAG_typedef)
    <f5f>   DW_AT_name        : (indirect string, offset: 0x4b39d): uint8_t
    <f63>   DW_AT_decl_file   : 5
    <f64>   DW_AT_decl_line   : 24
    <f65>   DW_AT_decl_column : 19
    <f66>   DW_AT_type        : <0xeea>
 <1><f6a>: Abbrev Number: 11 (DW_TAG_const_type)
    <f6b>   DW_AT_type        : <0xf5e>
 <1><f6f>: Abbrev Number: 6 (DW_TAG_typedef)
    <f70>   DW_AT_name        : (indirect string, offset: 0xcdacc): uint16_t
    <f74>   DW_AT_decl_file   : 5
    <f75>   DW_AT_decl_line   : 36
    <f76>   DW_AT_decl_column : 20
    <f77>   DW_AT_type        : <0xf04>
 <1><f7b>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <f7c>   DW_AT_type        : <0xf6f>
 <1><f80>: Abbrev Number: 6 (DW_TAG_typedef)
    <f81>   DW_AT_name        : (indirect string, offset: 0xefbf0): uint32_t
    <f85>   DW_AT_decl_file   : 5
    <f86>   DW_AT_decl_line   : 48
    <f87>   DW_AT_decl_column : 20
    <f88>   DW_AT_type        : <0xf1e>
 <1><f8c>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <f8d>   DW_AT_type        : <0xf80>
 <1><f91>: Abbrev Number: 6 (DW_TAG_typedef)
    <f92>   DW_AT_name        : (indirect string, offset: 0x74ec6): uint64_t
    <f96>   DW_AT_decl_file   : 5
    <f97>   DW_AT_decl_line   : 60
    <f98>   DW_AT_decl_column : 20
    <f99>   DW_AT_type        : <0xf38>
 <1><f9d>: Abbrev Number: 18 (DW_TAG_array_type)
    <f9e>   DW_AT_type        : <0xf80>
    <fa2>   DW_AT_sibling     : <0xfad>
 <2><fa6>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <fa7>   DW_AT_type        : <0xf57>
    <fab>   DW_AT_upper_bound : 1
 <2><fac>: Abbrev Number: 0
 <1><fad>: Abbrev Number: 16 (DW_TAG_structure_type)
    <fae>   DW_AT_byte_size   : 24
    <faf>   DW_AT_decl_file   : 6
    <fb0>   DW_AT_decl_line   : 372
    <fb2>   DW_AT_decl_column : 9
    <fb2>   DW_AT_sibling     : <0x1004>
 <2><fb6>: Abbrev Number: 7 (DW_TAG_member)
    <fb7>   DW_AT_name        : CR
    <fba>   DW_AT_decl_file   : 6
    <fba>   DW_AT_decl_line   : 374
    <fbc>   DW_AT_decl_column : 17
    <fbc>   DW_AT_type        : <0xf8c>
    <fc0>   DW_AT_data_member_location: 0
 <2><fc1>: Abbrev Number: 2 (DW_TAG_member)
    <fc2>   DW_AT_name        : (indirect string, offset: 0x211f6): NDTR
    <fc6>   DW_AT_decl_file   : 6
    <fc7>   DW_AT_decl_line   : 375
    <fc9>   DW_AT_decl_column : 17
    <fca>   DW_AT_type        : <0xf8c>
    <fce>   DW_AT_data_member_location: 4
 <2><fcf>: Abbrev Number: 7 (DW_TAG_member)
    <fd0>   DW_AT_name        : PAR
    <fd4>   DW_AT_decl_file   : 6
    <fd4>   DW_AT_decl_line   : 376
    <fd6>   DW_AT_decl_column : 17
    <fd6>   DW_AT_type        : <0xf8c>
    <fda>   DW_AT_data_member_location: 8
 <2><fdb>: Abbrev Number: 2 (DW_TAG_member)
    <fdc>   DW_AT_name        : (indirect string, offset: 0x6a062): M0AR
    <fe0>   DW_AT_decl_file   : 6
    <fe1>   DW_AT_decl_line   : 377
    <fe3>   DW_AT_decl_column : 17
    <fe4>   DW_AT_type        : <0xf8c>
    <fe8>   DW_AT_data_member_location: 12
 <2><fe9>: Abbrev Number: 2 (DW_TAG_member)
    <fea>   DW_AT_name        : (indirect string, offset: 0x8b66f): M1AR
    <fee>   DW_AT_decl_file   : 6
    <fef>   DW_AT_decl_line   : 378
    <ff1>   DW_AT_decl_column : 17
    <ff2>   DW_AT_type        : <0xf8c>
    <ff6>   DW_AT_data_member_location: 16
 <2><ff7>: Abbrev Number: 7 (DW_TAG_member)
    <ff8>   DW_AT_name        : FCR
    <ffc>   DW_AT_decl_file   : 6
    <ffc>   DW_AT_decl_line   : 379
    <ffe>   DW_AT_decl_column : 17
    <ffe>   DW_AT_type        : <0xf8c>
    <1002>   DW_AT_data_member_location: 20
 <2><1003>: Abbrev Number: 0
 <1><1004>: Abbrev Number: 9 (DW_TAG_typedef)
    <1005>   DW_AT_name        : (indirect string, offset: 0x222a0): DMA_Stream_TypeDef
    <1009>   DW_AT_decl_file   : 6
    <100a>   DW_AT_decl_line   : 380
    <100c>   DW_AT_decl_column : 3
    <100d>   DW_AT_type        : <0xfad>
 <1><1011>: Abbrev Number: 18 (DW_TAG_array_type)
    <1012>   DW_AT_type        : <0xf8c>
    <1016>   DW_AT_sibling     : <0x1021>
 <2><101a>: Abbrev Number: 19 (DW_TAG_subrange_type)
    <101b>   DW_AT_type        : <0xf57>
    <101f>   DW_AT_upper_bound : 1
 <2><1020>: Abbrev Number: 0
 <1><1021>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <1022>   DW_AT_type        : <0x1011>
 <1><1026>: Abbrev Number: 16 (DW_TAG_structure_type)
    <1027>   DW_AT_byte_size   : 40
    <1028>   DW_AT_decl_file   : 6
    <1029>   DW_AT_decl_line   : 579
    <102b>   DW_AT_decl_column : 9
    <102b>   DW_AT_sibling     : <0x10a8>
 <2><102f>: Abbrev Number: 2 (DW_TAG_member)
    <1030>   DW_AT_name        : (indirect string, offset: 0x5941): MODER
    <1034>   DW_AT_decl_file   : 6
    <1035>   DW_AT_decl_line   : 581
    <1037>   DW_AT_decl_column : 17
    <1038>   DW_AT_type        : <0xf8c>
    <103c>   DW_AT_data_member_location: 0
 <2><103d>: Abbrev Number: 2 (DW_TAG_member)
    <103e>   DW_AT_name        : (indirect string, offset: 0xc3622): OTYPER
    <1042>   DW_AT_decl_file   : 6
    <1043>   DW_AT_decl_line   : 582
    <1045>   DW_AT_decl_column : 17
    <1046>   DW_AT_type        : <0xf8c>
    <104a>   DW_AT_data_member_location: 4
 <2><104b>: Abbrev Number: 2 (DW_TAG_member)
    <104c>   DW_AT_name        : (indirect string, offset: 0xda97a): OSPEEDR
    <1050>   DW_AT_decl_file   : 6
    <1051>   DW_AT_decl_line   : 583
    <1053>   DW_AT_decl_column : 17
    <1054>   DW_AT_type        : <0xf8c>
    <1058>   DW_AT_data_member_location: 8
 <2><1059>: Abbrev Number: 2 (DW_TAG_member)
    <105a>   DW_AT_name        : (indirect string, offset: 0xa423e): PUPDR
    <105e>   DW_AT_decl_file   : 6
    <105f>   DW_AT_decl_line   : 584
    <1061>   DW_AT_decl_column : 17
    <1062>   DW_AT_type        : <0xf8c>
    <1066>   DW_AT_data_member_location: 12
 <2><1067>: Abbrev Number: 7 (DW_TAG_member)
    <1068>   DW_AT_name        : IDR
    <106c>   DW_AT_decl_file   : 6
    <106c>   DW_AT_decl_line   : 585
    <106e>   DW_AT_decl_column : 17
    <106e>   DW_AT_type        : <0xf8c>
    <1072>   DW_AT_data_member_location: 16
 <2><1073>: Abbrev Number: 7 (DW_TAG_member)
    <1074>   DW_AT_name        : ODR
    <1078>   DW_AT_decl_file   : 6
    <1078>   DW_AT_decl_line   : 586
    <107a>   DW_AT_decl_column : 17
    <107a>   DW_AT_type        : <0xf8c>
    <107e>   DW_AT_data_member_location: 20
 <2><107f>: Abbrev Number: 2 (DW_TAG_member)
    <1080>   DW_AT_name        : (indirect string, offset: 0x3b529): BSRR
    <1084>   DW_AT_decl_file   : 6
    <1085>   DW_AT_decl_line   : 587
    <1087>   DW_AT_decl_column : 17
    <1088>   DW_AT_type        : <0xf8c>
    <108c>   DW_AT_data_member_location: 24
 <2><108d>: Abbrev Number: 2 (DW_TAG_member)
    <108e>   DW_AT_name        : (indirect string, offset: 0xd7c2f): LCKR
    <1092>   DW_AT_decl_file   : 6
    <1093>   DW_AT_decl_line   : 588
    <1095>   DW_AT_decl_column : 17
    <1096>   DW_AT_type        : <0xf8c>
    <109a>   DW_AT_data_member_location: 28
 <2><109b>: Abbrev Number: 7 (DW_TAG_member)
    <109c>   DW_AT_name        : AFR
    <10a0>   DW_AT_decl_file   : 6
    <10a0>   DW_AT_decl_line   : 589
    <10a2>   DW_AT_decl_column : 17
    <10a2>   DW_AT_type        : <0x1021>
    <10a6>   DW_AT_data_member_location: 32
 <2><10a7>: Abbrev Number: 0
 <1><10a8>: Abbrev Number: 9 (DW_TAG_typedef)
    <10a9>   DW_AT_name        : (indirect string, offset: 0xf2e87): GPIO_TypeDef
    <10ad>   DW_AT_decl_file   : 6
    <10ae>   DW_AT_decl_line   : 590
    <10b0>   DW_AT_decl_column : 3
    <10b1>   DW_AT_type        : <0x1026>
 <1><10b5>: Abbrev Number: 16 (DW_TAG_structure_type)
    <10b6>   DW_AT_byte_size   : 16
    <10b7>   DW_AT_decl_file   : 6
    <10b8>   DW_AT_decl_line   : 690
    <10ba>   DW_AT_decl_column : 9
    <10ba>   DW_AT_sibling     : <0x10f3>
 <2><10be>: Abbrev Number: 7 (DW_TAG_member)
    <10bf>   DW_AT_name        : CR1
    <10c3>   DW_AT_decl_file   : 6
    <10c3>   DW_AT_decl_line   : 692
    <10c5>   DW_AT_decl_column : 17
    <10c5>   DW_AT_type        : <0xf8c>
    <10c9>   DW_AT_data_member_location: 0
 <2><10ca>: Abbrev Number: 2 (DW_TAG_member)
    <10cb>   DW_AT_name        : (indirect string, offset: 0x682da): CSR1
    <10cf>   DW_AT_decl_file   : 6
    <10d0>   DW_AT_decl_line   : 693
    <10d2>   DW_AT_decl_column : 17
    <10d3>   DW_AT_type        : <0xf8c>
    <10d7>   DW_AT_data_member_location: 4
 <2><10d8>: Abbrev Number: 7 (DW_TAG_member)
    <10d9>   DW_AT_name        : CR2
    <10dd>   DW_AT_decl_file   : 6
    <10dd>   DW_AT_decl_line   : 694
    <10df>   DW_AT_decl_column : 17
    <10df>   DW_AT_type        : <0xf8c>
    <10e3>   DW_AT_data_member_location: 8
 <2><10e4>: Abbrev Number: 2 (DW_TAG_member)
    <10e5>   DW_AT_name        : (indirect string, offset: 0x682df): CSR2
    <10e9>   DW_AT_decl_file   : 6
    <10ea>   DW_AT_decl_line   : 695
    <10ec>   DW_AT_decl_column : 17
    <10ed>   DW_AT_type        : <0xf8c>
    <10f1>   DW_AT_data_member_location: 12
 <2><10f2>: Abbrev Number: 0
 <1><10f3>: Abbrev Number: 9 (DW_TAG_typedef)
    <10f4>   DW_AT_name        : (indirect string, offset: 0xb71e4): PWR_TypeDef
    <10f8>   DW_AT_decl_file   : 6
    <10f9>   DW_AT_decl_line   : 696
    <10fb>   DW_AT_decl_column : 3
    <10fc>   DW_AT_type        : <0x10b5>
 <1><1100>: Abbrev Number: 16 (DW_TAG_structure_type)
    <1101>   DW_AT_byte_size   : 148
    <1102>   DW_AT_decl_file   : 6
    <1103>   DW_AT_decl_line   : 703
    <1105>   DW_AT_decl_column : 9
    <1105>   DW_AT_sibling     : <0x12d1>
 <2><1109>: Abbrev Number: 7 (DW_TAG_member)
    <110a>   DW_AT_name        : CR
    <110d>   DW_AT_decl_file   : 6
    <110d>   DW_AT_decl_line   : 705
